const quiz = [
	{
		pronunciation:[['イン'],['ひく','ひける']],
		question:['引火','引用','引力','強引','字引','手引','友引','長引','引合','引当','引金','引算','間引','水引'],
		kanji:['引火','引用','引力','強引','字引','手引','友引','長引','引合','引当','引金','引算','間引','水引'],
		answer:['いんか','いんよう','いんりょく','ごういん','じびき','てびき','ともびき','ながび','ひきあい','ひきあて','ひきがね','ひきざん','まび','みずひき']
	},
	{
		pronunciation:[['ウ'],['は','はね']],
		question:['羽毛','白羽','羽目'],
		kanji:['羽毛','白羽','羽目'],
		answer:['うもう','しらは','はめ']
	},
	{
		pronunciation:[['ウン'],['くも']],
		question:['雨雲','雲間','星雲','青雲','風雲'],
		kanji:['雨雲','雲間','星雲','青雲','風雲'],
		answer:['あまぐも','くもま','せいうん','せいうん','ふううん']
	},
	{
		pronunciation:[['エン'],['その']],
		question:['園長','学園','公園','通園','田園','入園','花園','楽園'],
		kanji:['園長','学園','公園','通園','田園','入園','花園','楽園'],
		answer:['えんちょう','がくえん','こうえん','つうえん','でんえん','にゅうえん','はなぞの','らくえん']
	},
	{
		pronunciation:[['エン','オン'],['とおい']],
		question:['遠足','遠方','遠出','遠山','間遠'],
		kanji:['遠足','遠方','遠出','遠山','間遠'],
		answer:['えんそく','えんぽう','とおで','とおやま','まどお']
	},
	{
		pronunciation:[['カ'],['なに','なん']],
		question:['何分','何回','何時','何台','何日','何人','何年','何人','何分'],
		kanji:['何分','何回','何時','何台','何日','何人','何年','何人','何分'],
		answer:['なにぶん','なんかい','なんじ','なんだい','なんにち','なんにん','なんねん','なんぴと','なんぷん']
	},
	{
		pronunciation:[['カ'],['']],
		question:['科学','科目','学科','教科','外科','工科','前科','内科','百科','分科','文科','本科','理科'],
		kanji:['科学','科目','学科','教科','外科','工科','前科','内科','百科','分科','文科','本科','理科'],
		answer:['かがく','かもく','がっか','きょうか','げか','こうか','ぜんか','ないか','ひゃっか','ぶんか','ぶんか','ほんか','りか']
	},
	{
		pronunciation:[['カ','ゲ'],['なつ']],
		question:['今夏','夏場','夏山','来夏','立夏'],
		kanji:['今夏','夏場','夏山','来夏','立夏'],
		answer:['こんか','なつば','なつやま','らいか','りっか']
	},
	{
		pronunciation:[['カ','ケ'],['いえ','や']],
		question:['家出','一家','大家','家計','家電','家内','家風','画家','家来','国家','後家','作家','自家','人家','生家','大家','分家','本家','名家'],
		kanji:['家出','一家','大家','家計','家電','家内','家風','画家','家来','国家','後家','作家','自家','人家','生家','大家','分家','本家','名家'],
		answer:['いえで','いっか','おおや','かけい','かでん','かない','かふう','がか','けらい','こっか','ごけ','さっか','じか','じんか','せいか','たいか','ぶんけ','ほんけ','めいか']
	},
	{
		pronunciation:[['カ'],['うた','うたう']],
		question:['歌声','歌手','校歌','国歌'],
		kanji:['歌声','歌手','校歌','国歌'],
		answer:['うたごえ','かしゅ','こうか','こっか']
	},
	{
		pronunciation:[['ガ','カク'],['']],
		question:['絵画','画数','画家','画才','計画','原画','作画','書画','字画','自画','図画','名画'],
		kanji:['絵画','画数','画家','画才','計画','原画','作画','書画','字画','自画','図画','名画'],
		answer:['かいが','かくすう','がか','がさい','けいかく','げんが','さくが','しょが','じかく','じが','ずが','めいが']
	},
	{
		pronunciation:[['カイ','エ'],['まわる','まわす']],
		question:['一回','回数','回線','回答','今回','下回','数回','前回','出回','何回','毎回','見回','見回'],
		kanji:['一回','回数','回線','回答','今回','下回','数回','前回','出回','何回','毎回','見回','見回'],
		answer:['いっかい','かいすう','かいせん','かいとう','こんかい','したまわ','すうかい','ぜんかい','でまわ','なんかい','まいかい','みまわ','みまわ']
	},
	{
		pronunciation:[['カイ','エ'],['あう']],
		question:['会計','会見','会社','会心','会場','会長','会話','会社','学会','休会','教会','国会','市会','社会','大会','朝会','町会','出会','入会','分会','本会','来会'],
		kanji:['会計','会見','会社','会心','会場','会長','会話','会社','学会','休会','教会','国会','市会','社会','大会','朝会','町会','出会','入会','分会','本会','来会'],
		answer:['かいけい','かいけん','かいしゃ','かいしん','かいじょう','かいちょう','かいわ','がいしゃ','がっかい','きゅうかい','きょうかい','こっかい','しかい','しゃかい','たいかい','ちょうかい','ちょうかい','であ','にゅうかい','ぶんかい','ほんかい','らいかい']
	},
	{
		pronunciation:[['カイ'],['うみ']],
		question:['海外','海上','海水','海草','海中','近海','公海','黒海','人海','大海','南海'],
		kanji:['海外','海上','海水','海草','海中','近海','公海','黒海','人海','大海','南海'],
		answer:['かいがい','かいじょう','かいすい','かいそう','かいちゅう','きんかい','こうかい','こっかい','じんかい','たいかい','なんかい']
	},
	{
		pronunciation:[['カイ','エ'],['']],
		question:['絵本','絵画','下絵'],
		kanji:['絵本','絵画','下絵'],
		answer:['えほん','かいが','したえ']
	},
	{
		pronunciation:[['ガイ','ゲ'],['そと','ほか','はずす','はずれる']],
		question:['海外','外角','外気','外見','外交','外国','外車','外出','外食','外人','外野','外科','口外','校外','戸外','国外','市外','室外','社外','心外','場外','体外','内外','番外','門外','野外'],
		kanji:['海外','外角','外気','外見','外交','外国','外車','外出','外食','外人','外野','外科','口外','校外','戸外','国外','市外','室外','社外','心外','場外','体外','内外','番外','門外','野外'],
		answer:['かいがい','がいかく','がいき','がいけん','がいこう','がいこく','がいしゃ','がいしゅつ','がいしょく','がいじん','がいや','げか','こうがい','こうがい','こがい','こくがい','しがい','しつがい','しゃがい','しんがい','じょうがい','たいがい','ないがい','ばんがい','もんがい','やがい']
	},
	{
		pronunciation:[['カク'],['かど','つの']],
		question:['岩角','角地','外角','広角','三角','四角','四角','多角','直角','頭角','内角','半角','方角'],
		kanji:['岩角','角地','外角','広角','三角','四角','四角','多角','直角','頭角','内角','半角','方角'],
		answer:['いわかど','かどち','がいかく','こうかく','さんかく','しかく','しかく','たかく','ちょっかく','とうかく','ないかく','はんかく','ほうがく']
	},
	{
		pronunciation:[['ガク','ラク'],['たのしい','たのしむ']],
		question:['音楽','気楽','行楽','行楽','声楽','道楽','文楽','楽園','楽天'],
		kanji:['音楽','気楽','行楽','行楽','声楽','道楽','文楽','楽園','楽天'],
		answer:['おんがく','きらく','こうらく','こうらく','せいがく','どうらく','ぶんらく','らくえん','らくてん']
	},
	{
		pronunciation:[['カツ'],['']],
		question:['活気','活字','活用','活力','自活','生活'],
		kanji:['活気','活字','活用','活力','自活','生活'],
		answer:['かっき','かつじ','かつよう','かつりょく','じかつ','せいかつ']
	},
	{
		pronunciation:[['カン','ケン'],['あいだ','ま']],
		question:['合間','間食','京間','行間','空間','雲間','月間','山間','週間','食間','時間','谷間','中間','手間','土間','中間','人間','年間','昼間','広間','間合','間男','間近','間近','間遠','間引','夜間','山間','林間'],
		kanji:['合間','間食','京間','行間','空間','雲間','月間','山間','週間','食間','時間','谷間','中間','手間','土間','中間','人間','年間','昼間','広間','間合','間男','間近','間近','間遠','間引','夜間','山間','林間'],
		answer:['あいま','かんしょく','きょうま','ぎょうかん','くうかん','くもま','げっかん','さんかん','しゅうかん','しょっかん','じかん','たにま','ちゅうかん','てま','どま','なかま','にんげん','ねんかん','ひるま','ひろま','まあい','まおとこ','まぢか','まぢか','まどお','まび','やかん','やまあい','りんかん']
	},
	{
		pronunciation:[['ガン'],['まる','まるい','まるめる']],
		question:['赤丸','一丸','方丸','丸木','丸太'],
		kanji:['赤丸','一丸','方丸','丸木','丸太'],
		answer:['あかまる','いちがん','ほうがん','まるき','まるた']
	},
	{
		pronunciation:[['ガン'],['いわ']],
		question:['岩角','岩場','岩石'],
		kanji:['岩角','岩場','岩石'],
		answer:['いわかど','いわば','がんせき']
	},
	{
		pronunciation:[['ガン'],['かお']],
		question:['顔色','顔色','新顔'],
		kanji:['顔色','顔色','新顔'],
		answer:['かおいろ','がんしょく','しんがお']
	},
	{
		pronunciation:[['キ'],['']],
		question:['汽車','汽船'],
		kanji:['汽車','汽船'],
		answer:['きしゃ','きせん']
	},
	{
		pronunciation:[['キ'],['しるす']],
		question:['下記','記入','記名','後記','左記','手記','書記','上記','前記','日記','明記'],
		kanji:['下記','記入','記名','後記','左記','手記','書記','上記','前記','日記','明記'],
		answer:['かき','きにゅう','きめい','こうき','さき','しゅき','しょき','じょうき','ぜんき','にっき','めいき']
	},
	{
		pronunciation:[['キ'],['かえる','かえす']],
		question:['帰京','帰国','直帰'],
		kanji:['帰京','帰国','直帰'],
		answer:['ききょう','きこく','ちょっき']
	},
	{
		pronunciation:[['キュウ'],['ゆみ']],
		question:['弓道'],
		kanji:['弓道'],
		answer:['きゅうどう']
	},
	{
		pronunciation:[['ギュウ'],['うし']],
		question:['牛肉','牛馬','肉牛'],
		kanji:['牛肉','牛馬','肉牛'],
		answer:['ぎゅうにく','ぎゅうば','にくぎゅう']
	},
	{
		pronunciation:[['ギョ'],['うお','さかな']],
		question:['金魚','魚肉','紙魚'],
		kanji:['金魚','魚肉','紙魚'],
		answer:['きんぎょ','ぎょにく','しみ']
	},
	{
		pronunciation:[['キョウ','ケイ'],['']],
		question:['帰京','京間','上京'],
		kanji:['帰京','京間','上京'],
		answer:['ききょう','きょうま','じょうきょう']
	},
	{
		pronunciation:[['キョウ','ゴウ'],['つよい','つよまる','つよめる','しいる']],
		question:['強行','強心','強弱','強大','強風','強力','心強','強引','強力','力強','強気','手強'],
		kanji:['強行','強心','強弱','強大','強風','強力','心強','強引','強力','力強','強気','手強'],
		answer:['きょうこう','きょうしん','きょうじゃく','きょうだい','きょうふう','きょうりょく','こころづよ','ごういん','ごうりき','ちからづよ','つよき','てごわ']
	},
	{
		pronunciation:[['キョウ'],['おしえる','おそわる']],
		question:['教科','教会','教室','教頭','文教'],
		kanji:['教科','教会','教室','教頭','文教'],
		answer:['きょうか','きょうかい','きょうしつ','きょうとう','ぶんきょう']
	},
	{
		pronunciation:[['キン'],['ちかい']],
		question:['近海','近親','近日','近年','近来','親近','近場','近道','手近','間近','間近'],
		kanji:['近海','近親','近日','近年','近来','親近','近場','近道','手近','間近','間近'],
		answer:['きんかい','きんしん','きんじつ','きんねん','きんらい','しんきん','ちかば','ちかみち','てぢか','まぢか','まぢか']
	},
	{
		pronunciation:[['ケイ','キョウ'],['あに']],
		question:['兄弟','父兄'],
		kanji:['兄弟','父兄'],
		answer:['きょうだい','ふけい']
	},
	{
		pronunciation:[['ケイ','ギョウ'],['かた','かたち']],
		question:['形見','原形','小形','図形','台形','地形','手形','同形','人形','方形'],
		kanji:['形見','原形','小形','図形','台形','地形','手形','同形','人形','方形'],
		answer:['かたみ','げんけい','こがた','ずけい','だいけい','ちけい','てがた','どうけい','にんぎょう','ほうけい']
	},
	{
		pronunciation:[['ケイ'],['はかる','はからう']],
		question:['会計','家計','計画','計算','計上','合計','小計','生計','早計','時計','時計','日計'],
		kanji:['会計','家計','計画','計算','計上','合計','小計','生計','早計','時計','時計','日計'],
		answer:['かいけい','かけい','けいかく','けいさん','けいじょう','ごうけい','しょうけい','せいけい','そうけい','とけい','どけい','にっけい']
	},
	{
		pronunciation:[['ゲン','ガン'],['もと']],
		question:['足元','親元','元金','元日','元年','元本','元来','口元','元気','地元','多元','中元','手元','二元','火元','本元','目元','元手'],
		kanji:['足元','親元','元金','元日','元年','元本','元来','口元','元気','地元','多元','中元','手元','二元','火元','本元','目元','元手'],
		answer:['あしもと','おやもと','がんきん','がんじつ','がんねん','がんぽん','がんらい','くちもと','げんき','じもと','たげん','ちゅうげん','てもと','にげん','ひもと','ほんもと','めもと','もとで']
	},
	{
		pronunciation:[['ゲン','ゴン'],['いう','こと']],
		question:['言行','言語','言明','公言','小言','言上','前言','体言','多言','一言','方言','名言','明言','用言'],
		kanji:['言行','言語','言明','公言','小言','言上','前言','体言','多言','一言','方言','名言','明言','用言'],
		answer:['げんこう','げんご','げんめい','こうげん','こごと','ごんじょう','ぜんげん','たいげん','たげん','ひとこと','ほうげん','めいげん','めいげん','ようげん']
	},
	{
		pronunciation:[['ゲン'],['はら']],
		question:['川原','原画','原形','原作','原子','原紙','原色','原石','原文','原木','原本','原理','高原','雪原','草原','野原'],
		kanji:['川原','原画','原形','原作','原子','原紙','原色','原石','原文','原木','原本','原理','高原','雪原','草原','野原'],
		answer:['かわら','げんが','げんけい','げんさく','げんし','げんし','げんしょく','げんせき','げんぶん','げんぼく','げんぽん','げんり','こうげん','せつげん','そうげん','のはら']
	},
	{
		pronunciation:[['コ'],['と']],
		question:['雨戸','戸外','戸数','上戸','戸口','門戸'],
		kanji:['雨戸','戸外','戸数','上戸','戸口','門戸'],
		answer:['あまど','こがい','こすう','じょうご','とぐち','もんこ']
	},
	{
		pronunciation:[['コ'],['ふるい','ふるす']],
		question:['古今','古語','古書','古寺','古風','古文','古名','古来','上古','太古','中古','古里','古手','古本'],
		kanji:['古今','古語','古書','古寺','古風','古文','古名','古来','上古','太古','中古','古里','古手','古本'],
		answer:['ここん','こご','こしょ','こじ','こふう','こぶん','こめい','こらい','じょうこ','たいこ','ちゅうこ','ふるさと','ふるて','ふるほん']
	},
	{
		pronunciation:[['ゴ'],['']],
		question:['午後','午前','正午'],
		kanji:['午後','午前','正午'],
		answer:['ごご','ごぜん','しょうご']
	},
	{
		pronunciation:[['ゴ','コウ'],['のち','うしろ','あと','おくれる']],
		question:['後先','後学','後記','後半','後方','今後','後家','後光','午後','後生','後日','食後','後目','生後','前後','直後'],
		kanji:['後先','後学','後記','後半','後方','今後','後家','後光','午後','後生','後日','食後','後目','生後','前後','直後'],
		answer:['あとさき','こうがく','こうき','こうはん','こうほう','こんご','ごけ','ごこう','ごご','ごしょう','ごじつ','しょくご','しりめ','せいご','ぜんご','ちょくご']
	},
	{
		pronunciation:[['ゴ'],['かたる','かたらう','つげる']],
		question:['言語','口語','国語','古語','語学','語気','語数','語頭','文語','母語','用語'],
		kanji:['言語','口語','国語','古語','語学','語気','語数','語頭','文語','母語','用語'],
		answer:['げんご','こうご','こくご','こご','ごがく','ごき','ごすう','ごとう','ぶんご','ぼご','ようご']
	},
	{
		pronunciation:[['コウ','ク'],['']],
		question:['工科','工学','工作','工場','工場','細工','人工','図工','大工','名工','木工','理工'],
		kanji:['工科','工学','工作','工場','工場','細工','人工','図工','大工','名工','木工','理工'],
		answer:['こうか','こうがく','こうさく','こうじょう','こうば','さいく','じんこう','ずこう','だいく','めいこう','もっこう','りこう']
	},
	{
		pronunciation:[['コウ'],['おおやけ']],
		question:['公園','公海','公休','公金','公言','公正','公道','公明','公用','公立','大公'],
		kanji:['公園','公海','公休','公金','公言','公正','公道','公明','公用','公立','大公'],
		answer:['こうえん','こうかい','こうきゅう','こうきん','こうげん','こうせい','こうどう','こうめい','こうよう','こうりつ','たいこう']
	},
	{
		pronunciation:[['コウ'],['ひろい','ひろまる','ひろめる','ひろがる','ひろげる']],
		question:['広角','広大','広野','広場','広間'],
		kanji:['広角','広大','広野','広場','広間'],
		answer:['こうかく','こうだい','こうや','ひろば','ひろま']
	},
	{
		pronunciation:[['コウ'],['まじわる','まじえる','まじる','まざる','まぜる','かう','かわす']],
		question:['外交','交通','交点','交番','交友','国交','社交','親交','直交'],
		kanji:['外交','交通','交点','交番','交友','国交','社交','親交','直交'],
		answer:['がいこう','こうつう','こうてん','こうばん','こうゆう','こっこう','しゃこう','しんこう','ちょっこう']
	},
	{
		pronunciation:[['コウ'],['ひかる','ひかり']],
		question:['月光','光学','光線','後光','日光','風光','夜光','来光'],
		kanji:['月光','光学','光線','後光','日光','風光','夜光','来光'],
		answer:['げっこう','こうがく','こうせん','ごこう','にっこう','ふうこう','やこう','らいこう']
	},
	{
		pronunciation:[['コウ'],['かんがえる']],
		question:['思考','長考'],
		kanji:['思考','長考'],
		answer:['しこう','ちょうこう']
	},
	{
		pronunciation:[['コウ','ギョウ','アン'],['いく','ゆく','おこなう']],
		question:['強行','行間','言行','行楽','行楽','心行','五行','先行','走行','直行','通行','同行','歩行','夜行','行方'],
		kanji:['強行','行間','言行','行楽','行楽','心行','五行','先行','走行','直行','通行','同行','歩行','夜行','行方'],
		answer:['きょうこう','ぎょうかん','げんこう','こうらく','こうらく','こころゆ','ごぎょう','せんこう','そうこう','ちょっこう','つうこう','どうこう','ほこう','やこう','ゆくえ']
	},
	{
		pronunciation:[['コウ'],['たかい','たか','たかまる','たかめる']],
		question:['高音','高原','高校','高年','高木','高名','石高','小高','車高','高台','高鳴','名高'],
		kanji:['高音','高原','高校','高年','高木','高名','石高','小高','車高','高台','高鳴','名高'],
		answer:['こうおん','こうげん','こうこう','こうねん','こうぼく','こうめい','こくだか','こだか','しゃこう','たかだい','たかな','なだか']
	},
	{
		pronunciation:[['コウ','オウ'],['き','こ']],
		question:['黄金','黄色','黄土','黄金'],
		kanji:['黄金','黄色','黄土','黄金'],
		answer:['おうごん','きいろ','こうど','こがね']
	},
	{
		pronunciation:[['ゴウ','ガッ','カッ'],['あう','あわす','あわせる']],
		question:['合図','合間','合作','合算','合体','組合','合金','合計','合字','合同','合名','合理','場合','引合','歩合','間合','見合','百合'],
		kanji:['合図','合間','合作','合算','合体','組合','合金','合計','合字','合同','合名','合理','場合','引合','歩合','間合','見合','百合'],
		answer:['あいず','あいま','がっさく','がっさん','がったい','くみあい','ごうきん','ごうけい','ごうじ','ごうどう','ごうめい','ごうり','ばあい','ひきあい','ぶあい','まあい','みあ','ゆり']
	},
	{
		pronunciation:[['コク'],['たに']],
		question:['谷川','谷間'],
		kanji:['谷川','谷間'],
		answer:['たにがわ','たにま']
	},
	{
		pronunciation:[['コク'],['くに']],
		question:['王国','外国','帰国','国王','国外','国語','国書','国大','国電','国土','国道','国内','国名','国立','国家','国歌','国会','国交','出国','小国','生国','生国','自国','大国','天国','同国','内国','南国','入国','万国','本国','母国','山国','雪国'],
		kanji:['王国','外国','帰国','国王','国外','国語','国書','国大','国電','国土','国道','国内','国名','国立','国家','国歌','国会','国交','出国','小国','生国','生国','自国','大国','天国','同国','内国','南国','入国','万国','本国','母国','山国','雪国'],
		answer:['おうこく','がいこく','きこく','こくおう','こくがい','こくご','こくしょ','こくだい','こくでん','こくど','こくどう','こくない','こくめい','こくりつ','こっか','こっか','こっかい','こっこう','しゅっこく','しょうこく','しょうこく','しょうごく','じこく','たいこく','てんごく','どうこく','ないこく','なんごく','にゅうこく','ばんこく','ほんごく','ぼこく','やまぐに','ゆきぐに']
	},
	{
		pronunciation:[['コク'],['くろ','くろい']],
		question:['黒石','黒字','黒土','黒星','黒目','黒山','黒人','黒海','白黒','大黒'],
		kanji:['黒石','黒字','黒土','黒星','黒目','黒山','黒人','黒海','白黒','大黒'],
		answer:['くろいし','くろじ','くろつち','くろぼし','くろめ','くろやま','こくじん','こっかい','しろくろ','だいこく']
	},
	{
		pronunciation:[['コン','キン'],['いま']],
		question:['今日','今朝','古今','今年','今夏','今回','今月','今後','今秋','今週','今春','今時','今生','今夕','今日','今年','今夜'],
		kanji:['今日','今朝','古今','今年','今夏','今回','今月','今後','今秋','今週','今春','今時','今生','今夕','今日','今年','今夜'],
		answer:['きょう','けさ','ここん','ことし','こんか','こんかい','こんげつ','こんご','こんしゅう','こんしゅう','こんしゅん','こんじ','こんじょう','こんせき','こんにち','こんねん','こんや']
	},
	{
		pronunciation:[['サイ'],['']],
		question:['画才','才気','才色','才女','才知','才走','多才','天才','文才'],
		kanji:['画才','才気','才色','才女','才知','才走','多才','天才','文才'],
		answer:['がさい','さいき','さいしょく','さいじょ','さいち','さいばし','たさい','てんさい','ぶんさい']
	},
	{
		pronunciation:[['サイ'],['ほそい','ほそる','こまか','こまかい']],
		question:['心細','細工','細心','細大','細分','細目','子細','細長','明細'],
		kanji:['心細','細工','細心','細大','細分','細目','子細','細長','明細'],
		answer:['こころぼそ','さいく','さいしん','さいだい','さいぶん','さいもく','しさい','ほそなが','めいさい']
	},
	{
		pronunciation:[['サク','サ'],['つくる']],
		question:['合作','原作','工作','作画','作字','作図','作風','作文','作家','作用','新作','自作','前作','大作','多作','米作','名作','力作'],
		kanji:['合作','原作','工作','作画','作字','作図','作風','作文','作家','作用','新作','自作','前作','大作','多作','米作','名作','力作'],
		answer:['がっさく','げんさく','こうさく','さくが','さくじ','さくず','さくふう','さくぶん','さっか','さよう','しんさく','じさく','ぜんさく','たいさく','たさく','べいさく','めいさく','りきさく']
	},
	{
		pronunciation:[['サン'],['']],
		question:['合算','計算','算出','算数','算入','算用','足算','通算','引算','目算'],
		kanji:['合算','計算','算出','算数','算入','算用','足算','通算','引算','目算'],
		answer:['がっさん','けいさん','さんしゅつ','さんすう','さんにゅう','さんよう','たしざん','つうさん','ひきざん','もくさん']
	},
	{
		pronunciation:[['シ'],['とまる','とめる','とどまる']],
		question:['休止','中止'],
		kanji:['休止','中止'],
		answer:['きゅうし','ちゅうし']
	},
	{
		pronunciation:[['シ'],['いち']],
		question:['朝市','市場','市会','市外','市場','市中','市長','市電','市内','市立','同市'],
		kanji:['朝市','市場','市会','市外','市場','市中','市長','市電','市内','市立','同市'],
		answer:['あさいち','いちば','しかい','しがい','しじょう','しちゅう','しちょう','しでん','しない','しりつ','どうし']
	},
	{
		pronunciation:[['シ'],['や']],
		question:['矢先'],
		kanji:['矢先'],
		answer:['やさき']
	},
	{
		pronunciation:[['シ'],['あね']],
		question:['姉妹'],
		kanji:['姉妹'],
		answer:['しまい']
	},
	{
		pronunciation:[['シ'],['おもう']],
		question:['思考'],
		kanji:['思考'],
		answer:['しこう']
	},
	{
		pronunciation:[['シ'],['かみ']],
		question:['原紙','色紙','紙上','紙魚','草紙','台紙','手紙','白紙','半紙','本紙','用紙'],
		kanji:['原紙','色紙','紙上','紙魚','草紙','台紙','手紙','白紙','半紙','本紙','用紙'],
		answer:['げんし','しきし','しじょう','しみ','そうし','だいし','てがみ','はくし','はんし','ほんし','ようし']
	},
	{
		pronunciation:[['ジ'],['てら']],
		question:['古寺','社寺','寺社'],
		kanji:['古寺','社寺','寺社'],
		answer:['こじ','しゃじ','じしゃ']
	},
	{
		pronunciation:[['ジ','シ'],['みずから']],
		question:['出自','自家','自活','自画','自学','自国','自作','自室','自社','自首','自体','自答','自白','自分','自前','自明','自力','自立','刀自'],
		kanji:['出自','自家','自活','自画','自学','自国','自作','自室','自社','自首','自体','自答','自白','自分','自前','自明','自力','自立','刀自'],
		answer:['しゅつじ','じか','じかつ','じが','じがく','じこく','じさく','じしつ','じしゃ','じしゅ','じたい','じとう','じはく','じぶん','じまえ','じめい','じりき','じりつ','とじ']
	},
	{
		pronunciation:[['ジ'],['とき']],
		question:['一時','一時','今時','時雨','時下','時間','時空','時点','時分','十時','通時','当時','時計','同時','時計','何時','日時','半時','一時','毎時'],
		kanji:['一時','一時','今時','時雨','時下','時間','時空','時点','時分','十時','通時','当時','時計','同時','時計','何時','日時','半時','一時','毎時'],
		answer:['いちじ','いっとき','こんじ','しぐれ','じか','じかん','じくう','じてん','じぶん','じゅうじ','つうじ','とうじ','とけい','どうじ','どけい','なんじ','にちじ','はんとき','ひととき','まいじ']
	},
	{
		pronunciation:[['シツ'],['むろ']],
		question:['一室','王室','教室','室外','室長','室内','自室','船室','同室','入室','分室','室町'],
		kanji:['一室','王室','教室','室外','室長','室内','自室','船室','同室','入室','分室','室町'],
		answer:['いっしつ','おうしつ','きょうしつ','しつがい','しつちょう','しつない','じしつ','せんしつ','どうしつ','にゅうしつ','ぶんしつ','むろまち']
	},
	{
		pronunciation:[['シャ'],['やしろ']],
		question:['会社','会社','社会','社外','社交','社寺','社中','社長','社内','社風','社名','社用','出社','小社','寺社','自社','当社','同社','入社','分社','本社','来社'],
		kanji:['会社','会社','社会','社外','社交','社寺','社中','社長','社内','社風','社名','社用','出社','小社','寺社','自社','当社','同社','入社','分社','本社','来社'],
		answer:['かいしゃ','がいしゃ','しゃかい','しゃがい','しゃこう','しゃじ','しゃちゅう','しゃちょう','しゃない','しゃふう','しゃめい','しゃよう','しゅっしゃ','しょうしゃ','じしゃ','じしゃ','とうしゃ','どうしゃ','にゅうしゃ','ぶんしゃ','ほんしゃ','らいしゃ']
	},
	{
		pronunciation:[['ジャク'],['よわい','よわる','よわまる','よわめる']],
		question:['強弱','気弱','弱小','弱点','弱気','弱音'],
		kanji:['強弱','気弱','弱小','弱点','弱気','弱音'],
		answer:['きょうじゃく','きよわ','じゃくしょう','じゃくてん','よわき','よわね']
	},
	{
		pronunciation:[['シュ'],['くび']],
		question:['足首','首長','自首','船首','手首','生首'],
		kanji:['足首','首長','自首','船首','手首','生首'],
		answer:['あしくび','しゅちょう','じしゅ','せんしゅ','てくび','なまくび']
	},
	{
		pronunciation:[['シュウ'],['あき']],
		question:['秋雨','今秋','秋分','春秋','来秋','立秋'],
		kanji:['秋雨','今秋','秋分','春秋','来秋','立秋'],
		answer:['あきさめ','こんしゅう','しゅうぶん','しゅんじゅう','らいしゅう','りっしゅう']
	},
	{
		pronunciation:[['シュウ'],['']],
		question:['今週','週間','週休','先週','前週','毎週','来週'],
		kanji:['今週','週間','週休','先週','前週','毎週','来週'],
		answer:['こんしゅう','しゅうかん','しゅうきゅう','せんしゅう','ぜんしゅう','まいしゅう','らいしゅう']
	},
	{
		pronunciation:[['シュン'],['はる']],
		question:['小春','今春','春秋','春雪','春分','新春','青春','早春','買春','売春','来春','立春'],
		kanji:['小春','今春','春秋','春雪','春分','新春','青春','早春','買春','売春','来春','立春'],
		answer:['こはる','こんしゅん','しゅんじゅう','しゅんせつ','しゅんぶん','しんしゅん','せいしゅん','そうしゅん','ばいしゅん','ばいしゅん','らいしゅん','りっしゅん']
	},
	{
		pronunciation:[['ショ'],['かく']],
		question:['国書','古書','書画','書記','書見','書生','書体','書中','書店','書道','書名','新書','草書','図書','読書','白書','文書','本書'],
		kanji:['国書','古書','書画','書記','書見','書生','書体','書中','書店','書道','書名','新書','草書','図書','読書','白書','文書','本書'],
		answer:['こくしょ','こしょ','しょが','しょき','しょけん','しょせい','しょたい','しょちゅう','しょてん','しょどう','しょめい','しんしょ','そうしょ','としょ','どくしょ','はくしょ','ぶんしょ','ほんしょ']
	},
	{
		pronunciation:[['ショウ'],['すくない','すこし']],
		question:['少食','少女','少数','少年','多少','年少'],
		kanji:['少食','少女','少数','少年','多少','年少'],
		answer:['しょうしょく','しょうじょ','しょうすう','しょうねん','たしょう','ねんしょう']
	},
	{
		pronunciation:[['ジョウ'],['ば']],
		question:['市場','岩場','売場','会場','休場','工場','工場','市場','出場','地場','場外','上場','場内','船場','立場','近場','道場','夏場','入場','場合','場数','馬場','広場','冬場','本場','山場','来場'],
		kanji:['市場','岩場','売場','会場','休場','工場','工場','市場','出場','地場','場外','上場','場内','船場','立場','近場','道場','夏場','入場','場合','場数','馬場','広場','冬場','本場','山場','来場'],
		answer:['いちば','いわば','うりば','かいじょう','きゅうじょう','こうじょう','こうば','しじょう','しゅつじょう','じば','じょうがい','じょうじょう','じょうない','せんば','たちば','ちかば','どうじょう','なつば','にゅうじょう','ばあい','ばかず','ばば','ひろば','ふゆば','ほんば','やまば','らいじょう']
	},
	{
		pronunciation:[['ショク','シキ'],['いろ']],
		question:['色色','色気','色目','顔色','顔色','黄色','気色','金色','気色','原色','声色','金色','才色','色紙','出色','生色','赤色','茶色','同色','音色','白色','水色','明色'],
		kanji:['色色','色気','色目','顔色','顔色','黄色','気色','金色','気色','原色','声色','金色','才色','色紙','出色','生色','赤色','茶色','同色','音色','白色','水色','明色'],
		answer:['いろいろ','いろけ','いろめ','かおいろ','がんしょく','きいろ','きしょく','きんいろ','けしき','げんしょく','こわいろ','こんじき','さいしょく','しきし','しゅっしょく','せいしょく','せきしょく','ちゃいろ','どうしょく','ねいろ','はくしょく','みずいろ','めいしょく']
	},
	{
		pronunciation:[['ショク','ジキ'],['くう','たべる','くらう']],
		question:['間食','外食','月食','三食','小食','少食','食後','食前','食通','食道','食肉','食用','食間','草食','大食','昼食','朝食','肉食','日食','米食','夜食','夕食','立食'],
		kanji:['間食','外食','月食','三食','小食','少食','食後','食前','食通','食道','食肉','食用','食間','草食','大食','昼食','朝食','肉食','日食','米食','夜食','夕食','立食'],
		answer:['かんしょく','がいしょく','げっしょく','さんしょく','しょうしょく','しょうしょく','しょくご','しょくぜん','しょくつう','しょくどう','しょくにく','しょくよう','しょっかん','そうしょく','たいしょく','ちゅうしょく','ちょうしょく','にくしょく','にっしょく','べいしょく','やしょく','ゆうしょく','りっしょく']
	},
	{
		pronunciation:[['シン'],['こころ']],
		question:['一心','会心','気心','強心','心地','心強','心細','心行','心地','細心','小心','心音','心外','心中','心線','心中','心頭','心理','中心','点心','同心','内心','本心','野心','用心'],
		kanji:['一心','会心','気心','強心','心地','心強','心細','心行','心地','細心','小心','心音','心外','心中','心線','心中','心頭','心理','中心','点心','同心','内心','本心','野心','用心'],
		answer:['いっしん','かいしん','きごころ','きょうしん','ここち','こころづよ','こころぼそ','こころゆ','ごこち','さいしん','しょうしん','しんおん','しんがい','しんじゅう','しんせん','しんちゅう','しんとう','しんり','ちゅうしん','てんしん','どうしん','ないしん','ほんしん','やしん','ようじん']
	},
	{
		pronunciation:[['シン'],['あたらしい','あらた','にい']],
		question:['新手','新顔','新作','新車','新春','新書','新人','新星','新生','新雪','新地','新田','新入','新年','新聞','新風','新本','新米'],
		kanji:['新手','新顔','新作','新車','新春','新書','新人','新星','新生','新雪','新地','新田','新入','新年','新聞','新風','新本','新米'],
		answer:['あらて','しんがお','しんさく','しんしゃ','しんしゅん','しんしょ','しんじん','しんせい','しんせい','しんせつ','しんち','しんでん','しんにゅう','しんねん','しんぶん','しんぷう','しんぽん','しんまい']
	},
	{
		pronunciation:[['シン'],['おや','したしい','したしむ']],
		question:['親方','親子','親父','親玉','親分','親元','近親','親近','親交','親切','親友','父親','肉親','母親'],
		kanji:['親方','親子','親父','親玉','親分','親元','近親','親近','親交','親切','親友','父親','肉親','母親'],
		answer:['おやかた','おやこ','おやじ','おやだま','おやぶん','おやもと','きんしん','しんきん','しんこう','しんせつ','しんゆう','ちちおや','にくしん','ははおや']
	},
	{
		pronunciation:[['ズ','ト'],['はかる']],
		question:['合図','作図','図画','図形','図工','図上','図星','星図','地図','図書'],
		kanji:['合図','作図','図画','図形','図工','図上','図星','星図','地図','図書'],
		answer:['あいず','さくず','ずが','ずけい','ずこう','ずじょう','ずぼし','せいず','ちず','としょ']
	},
	{
		pronunciation:[['スウ','ス'],['かず','かぞえる']],
		question:['頭数','回数','画数','口数','口数','戸数','語数','算数','小数','少数','字数','数回','数学','数字','数日','数台','数人','数名','数理','正数','多数','台数','手数','手数','点数','同数','日数','人数','年数','半数','場数','分数','本数','名数'],
		kanji:['頭数','回数','画数','口数','口数','戸数','語数','算数','小数','少数','字数','数回','数学','数字','数日','数台','数人','数名','数理','正数','多数','台数','手数','手数','点数','同数','日数','人数','年数','半数','場数','分数','本数','名数'],
		answer:['あたまかず','かいすう','かくすう','くちかず','くちすう','こすう','ごすう','さんすう','しょうすう','しょうすう','じすう','すうかい','すうがく','すうじ','すうじつ','すうだい','すうにん','すうめい','すうり','せいすう','たすう','だいすう','てかず','てすう','てんすう','どうすう','にっすう','にんずう','ねんすう','はんすう','ばかず','ぶんすう','ほんすう','めいすう']
	},
	{
		pronunciation:[['セイ','サイ'],['にし']],
		question:['西方','東西','南西','西風','西口','西日','北西'],
		kanji:['西方','東西','南西','西風','西口','西日','北西'],
		answer:['せいほう','とうざい','なんせい','にしかぜ','にしぐち','にしび','ほくせい']
	},
	{
		pronunciation:[['セイ','ショウ'],['こえ','こわ']],
		question:['歌声','大声','音声','声色','声音','女声','声楽','声明','男声','同声','内声','肉声','名声'],
		kanji:['歌声','大声','音声','声色','声音','女声','声楽','声明','男声','同声','内声','肉声','名声'],
		answer:['うたごえ','おおごえ','おんせい','こわいろ','こわね','じょせい','せいがく','せいめい','だんせい','どうせい','ないせい','にくせい','めいせい']
	},
	{
		pronunciation:[['セイ','ショウ'],['ほし']],
		question:['金星','金星','黒星','白星','新星','図星','星雲','星図','星空','明星','目星'],
		kanji:['金星','金星','黒星','白星','新星','図星','星雲','星図','星空','明星','目星'],
		answer:['きんせい','きんぼし','くろぼし','しろぼし','しんせい','ずぼし','せいうん','せいず','ほしぞら','みょうじょう','めぼし']
	},
	{
		pronunciation:[['セイ'],['はれる','はらす']],
		question:['晴天'],
		kanji:['晴天'],
		answer:['せいてん']
	},
	{
		pronunciation:[['セツ','サイ'],['きる','きれる']],
		question:['一切','切先','切手','切口','親切','大切','月切','見切'],
		kanji:['一切','切先','切手','切口','親切','大切','月切','見切'],
		answer:['いっさい','きっさき','きって','きりくち','しんせつ','たいせつ','つきぎり','みき']
	},
	{
		pronunciation:[['セツ'],['ゆき']],
		question:['大雪','春雪','小雪','新雪','雪原','大雪','大雪','風雪','雪国','雪見'],
		kanji:['大雪','春雪','小雪','新雪','雪原','大雪','大雪','風雪','雪国','雪見'],
		answer:['おおゆき','しゅんせつ','しょうせつ','しんせつ','せつげん','たいせつ','だいせつ','ふうせつ','ゆきぐに','ゆきみ']
	},
	{
		pronunciation:[['セン'],['ふね','ふな']],
		question:['汽船','下船','船室','船首','船上','船体','船長','船頭','船内','船場','方船','風船','船出','本船','母船'],
		kanji:['汽船','下船','船室','船首','船上','船体','船長','船頭','船内','船場','方船','風船','船出','本船','母船'],
		answer:['きせん','げせん','せんしつ','せんしゅ','せんじょう','せんたい','せんちょう','せんどう','せんない','せんば','はこぶね','ふうせん','ふなで','ほんせん','ぼせん']
	},
	{
		pronunciation:[['セン'],['']],
		question:['赤線','回線','下線','光線','車線','心線','線上','線分','前線','直線','点線','電線','内線','番線','本線','目線'],
		kanji:['赤線','回線','下線','光線','車線','心線','線上','線分','前線','直線','点線','電線','内線','番線','本線','目線'],
		answer:['あかせん','かいせん','かせん','こうせん','しゃせん','しんせん','せんじょう','せんぶん','ぜんせん','ちょくせん','てんせん','でんせん','ないせん','ばんせん','ほんせん','めせん']
	},
	{
		pronunciation:[['ゼン'],['まえ']],
		question:['気前','空前','午前','食前','自前','生前','前科','前回','前記','前月','前言','前後','前作','前週','前日','前線','前半','前半','前文','前方','前夜','直前','手前','名前','人前','前足','前売','前金','目前','門前'],
		kanji:['気前','空前','午前','食前','自前','生前','前科','前回','前記','前月','前言','前後','前作','前週','前日','前線','前半','前半','前文','前方','前夜','直前','手前','名前','人前','前足','前売','前金','目前','門前'],
		answer:['きまえ','くうぜん','ごぜん','しょくぜん','じまえ','せいぜん','ぜんか','ぜんかい','ぜんき','ぜんげつ','ぜんげん','ぜんご','ぜんさく','ぜんしゅう','ぜんじつ','ぜんせん','ぜんはん','ぜんぱん','ぜんぶん','ぜんぽう','ぜんや','ちょくぜん','てまえ','なまえ','ひとまえ','まえあし','まえうり','まえきん','もくぜん','もんぜん']
	},
	{
		pronunciation:[['ソ'],['くむ','くみ']],
		question:['組合','番組'],
		kanji:['組合','番組'],
		answer:['くみあい','ばんぐみ']
	},
	{
		pronunciation:[['ソウ'],['はしる']],
		question:['才走','先走','出走','走行'],
		kanji:['才走','先走','出走','走行'],
		answer:['さいばし','さきばし','しゅっそう','そうこう']
	},
	{
		pronunciation:[['タ'],['おおい']],
		question:['多雨','多角','多元','多言','多才','多作','多少','多数','多体','多大','多読','多年','多売','多分','多分','多用'],
		kanji:['多雨','多角','多元','多言','多才','多作','多少','多数','多体','多大','多読','多年','多売','多分','多分','多用'],
		answer:['たう','たかく','たげん','たげん','たさい','たさく','たしょう','たすう','たたい','ただい','たどく','たねん','たばい','たぶん','たぶん','たよう']
	},
	{
		pronunciation:[['タイ','タ'],['ふとい','ふとる']],
		question:['太古','太子','太刀','太字','丸太'],
		kanji:['太古','太子','太刀','太字','丸太'],
		answer:['たいこ','たいし','たち','ふとじ','まるた']
	},
	{
		pronunciation:[['タイ','テイ'],['からだ']],
		question:['一体','合体','気体','車体','正体','書体','字体','自体','人体','生体','船体','体外','体言','体長','体内','体毛','体力','多体','大体','天体','肉体','風体','文体','方体','本体','母体','立体'],
		kanji:['一体','合体','気体','車体','正体','書体','字体','自体','人体','生体','船体','体外','体言','体長','体内','体毛','体力','多体','大体','天体','肉体','風体','文体','方体','本体','母体','立体'],
		answer:['いったい','がったい','きたい','しゃたい','しょうたい','しょたい','じたい','じたい','じんたい','せいたい','せんたい','たいがい','たいげん','たいちょう','たいない','たいもう','たいりょく','たたい','だいたい','てんたい','にくたい','ふうてい','ぶんたい','ほうたい','ほんたい','ぼたい','りったい']
	},
	{
		pronunciation:[['ダイ','タイ'],['']],
		question:['数台','台頭','台風','高台','台形','台紙','台車','台数','台地','台本','土台','何台','番台'],
		kanji:['数台','台頭','台風','高台','台形','台紙','台車','台数','台地','台本','土台','何台','番台'],
		answer:['すうだい','たいとう','たいふう','たかだい','だいけい','だいし','だいしゃ','だいすう','だいち','だいほん','どだい','なんだい','ばんだい']
	},
	{
		pronunciation:[['チ','ジ'],['']],
		question:['角地','生地','木地','心地','心地','山地','下地','白地','新地','地場','地道','地元','地力','生地','台地','大地','地下','地学','地形','地上','地図','地中','地点','地番','地方','地名','地理','天地','当地','土地','同地','内地','番地','用地'],
		kanji:['角地','生地','木地','心地','心地','山地','下地','白地','新地','地場','地道','地元','地力','生地','台地','大地','地下','地学','地形','地上','地図','地中','地点','地番','地方','地名','地理','天地','当地','土地','同地','内地','番地','用地'],
		answer:['かどち','きじ','きじ','ここち','ごこち','さんち','したじ','しろじ','しんち','じば','じみち','じもと','じりき','せいち','だいち','だいち','ちか','ちがく','ちけい','ちじょう','ちず','ちちゅう','ちてん','ちばん','ちほう','ちめい','ちり','てんち','とうち','とち','どうち','ないち','ばんち','ようち']
	},
	{
		pronunciation:[['チ'],['いけ']],
		question:['小池','電池'],
		kanji:['小池','電池'],
		answer:['こいけ','でんち']
	},
	{
		pronunciation:[['チ'],['しる','しらせる']],
		question:['才知','人知','知見','知人','知名','通知','見知','明知','理知'],
		kanji:['才知','人知','知見','知人','知名','通知','見知','明知','理知'],
		answer:['さいち','じんち','ちけん','ちじん','ちめい','つうち','みし','めいち','りち']
	},
	{
		pronunciation:[['チャ','サ'],['']],
		question:['茶道','茶色','茶番','番茶','麦茶'],
		kanji:['茶道','茶色','茶番','番茶','麦茶'],
		answer:['さどう','ちゃいろ','ちゃばん','ばんちゃ','むぎちゃ']
	},
	{
		pronunciation:[['チュウ'],['ひる']],
		question:['昼食','昼夜','白昼','昼間'],
		kanji:['昼食','昼夜','白昼','昼間'],
		answer:['ちゅうしょく','ちゅうや','はくちゅう','ひるま']
	},
	{
		pronunciation:[['チョウ'],['ながい']],
		question:['園長','会長','学長','気長','校長','市長','室長','社長','首長','生長','船長','村長','体長','長音','長考','長子','長女','長大','町長','長男','長文','店長','長雨','長月','長年','長話','長引','年長','細長'],
		kanji:['園長','会長','学長','気長','校長','市長','室長','社長','首長','生長','船長','村長','体長','長音','長考','長子','長女','長大','町長','長男','長文','店長','長雨','長月','長年','長話','長引','年長','細長'],
		answer:['えんちょう','かいちょう','がくちょう','きなが','こうちょう','しちょう','しつちょう','しゃちょう','しゅちょう','せいちょう','せんちょう','そんちょう','たいちょう','ちょうおん','ちょうこう','ちょうし','ちょうじょ','ちょうだい','ちょうちょう','ちょうなん','ちょうぶん','てんちょう','ながあめ','ながつき','ながねん','ながばなし','ながび','ねんちょう','ほそなが']
	},
	{
		pronunciation:[['チョウ'],['とり']],
		question:['小鳥','千鳥','鳥目','鳥目','白鳥','水鳥','野鳥'],
		kanji:['小鳥','千鳥','鳥目','鳥目','白鳥','水鳥','野鳥'],
		answer:['ことり','ちどり','ちょうもく','とりめ','はくちょう','みずどり','やちょう']
	},
	{
		pronunciation:[['チョウ'],['あさ']],
		question:['朝市','朝方','朝日','今朝','早朝','朝会','朝食','毎朝','明朝'],
		kanji:['朝市','朝方','朝日','今朝','早朝','朝会','朝食','毎朝','明朝'],
		answer:['あさいち','あさがた','あさひ','けさ','そうちょう','ちょうかい','ちょうしょく','まいあさ','みょうちょう']
	},
	{
		pronunciation:[['チョク','ジキ'],['なおす','なおる']],
		question:['正直','直後','直線','直前','直通','直答','直売','直立','直下','直角','直帰','直交','直行','出直','当直','日直','見直'],
		kanji:['正直','直後','直線','直前','直通','直答','直売','直立','直下','直角','直帰','直交','直行','出直','当直','日直','見直'],
		answer:['しょうじき','ちょくご','ちょくせん','ちょくぜん','ちょくつう','ちょくとう','ちょくばい','ちょくりつ','ちょっか','ちょっかく','ちょっき','ちょっこう','ちょっこう','でなお','とうちょく','にっちょく','みなお']
	},
	{
		pronunciation:[['ツウ','ツ'],['とおる','とおす','かよう']],
		question:['交通','食通','直通','通園','通学','通気','通行','通算','通時','通知','通電','通読','通風','通用','通話','通夜','文通','見通'],
		kanji:['交通','食通','直通','通園','通学','通気','通行','通算','通時','通知','通電','通読','通風','通用','通話','通夜','文通','見通'],
		answer:['こうつう','しょくつう','ちょくつう','つうえん','つうがく','つうき','つうこう','つうさん','つうじ','つうち','つうでん','つうどく','つうふう','つうよう','つうわ','つや','ぶんつう','みとお']
	},
	{
		pronunciation:[['テイ','ダイ','デ'],['おとうと']],
		question:['兄弟','弟子','門弟'],
		kanji:['兄弟','弟子','門弟'],
		answer:['きょうだい','でし','もんてい']
	},
	{
		pronunciation:[['テン'],['みせ']],
		question:['出店','書店','店長','店頭','店内','出店','当店','売店','本店','店先','店番','来店'],
		kanji:['出店','書店','店長','店頭','店内','出店','当店','売店','本店','店先','店番','来店'],
		answer:['しゅってん','しょてん','てんちょう','てんとう','てんない','でみせ','とうてん','ばいてん','ほんてん','みせさき','みせばん','らいてん']
	},
	{
		pronunciation:[['テン'],['つける']],
		question:['一点','交点','時点','弱点','地点','中点','点火','点心','点字','点数','点線','読点','同点'],
		kanji:['一点','交点','時点','弱点','地点','中点','点火','点心','点字','点数','点線','読点','同点'],
		answer:['いってん','こうてん','じてん','じゃくてん','ちてん','ちゅうてん','てんか','てんしん','てんじ','てんすう','てんせん','とうてん','どうてん']
	},
	{
		pronunciation:[['デン'],['']],
		question:['家電','国電','市電','通電','電気','電子','電車','電線','電池','電文','電力','電話','入電'],
		kanji:['家電','国電','市電','通電','電気','電子','電車','電線','電池','電文','電力','電話','入電'],
		answer:['かでん','こくでん','しでん','つうでん','でんき','でんし','でんしゃ','でんせん','でんち','でんぶん','でんりょく','でんわ','にゅうでん']
	},
	{
		pronunciation:[['トウ'],['かたな']],
		question:['竹刀','太刀','刀自','木刀','名刀'],
		kanji:['竹刀','太刀','刀自','木刀','名刀'],
		answer:['しない','たち','とじ','ぼくとう','めいとう']
	},
	{
		pronunciation:[['トウ'],['ふゆ']],
		question:['冬場','冬山','立冬'],
		kanji:['冬場','冬山','立冬'],
		answer:['ふゆば','ふゆやま','りっとう']
	},
	{
		pronunciation:[['トウ'],['あたる','あてる']],
		question:['見当','正当','手当','当月','当社','当時','当日','当地','当直','当店','当人','当年','当番','当分','当方','当用','日当','引当','本当'],
		kanji:['見当','正当','手当','当月','当社','当時','当日','当地','当直','当店','当人','当年','当番','当分','当方','当用','日当','引当','本当'],
		answer:['けんとう','せいとう','てあて','とうげつ','とうしゃ','とうじ','とうじつ','とうち','とうちょく','とうてん','とうにん','とうねん','とうばん','とうぶん','とうほう','とうよう','にっとう','ひきあて','ほんとう']
	},
	{
		pronunciation:[['トウ'],['ひがし']],
		question:['東西','東南','東方','東北','南東','東口','北東'],
		kanji:['東西','東南','東方','東北','南東','東口','北東'],
		answer:['とうざい','とうなん','とうほう','とうほく','なんとう','ひがしぐち','ほくとう']
	},
	{
		pronunciation:[['トウ'],['こたえる','こたえ']],
		question:['回答','自答','正答','直答','名答','名答'],
		kanji:['回答','自答','正答','直答','名答','名答'],
		answer:['かいとう','じとう','せいとう','ちょくとう','めいとう','めいとう']
	},
	{
		pronunciation:[['トウ','ズ','ト'],['あたま','かしら']],
		question:['頭数','一頭','教頭','口頭','語頭','出頭','心頭','頭上','先頭','船頭','台頭','店頭','頭角','頭目','年頭','番頭','目頭','毛頭'],
		kanji:['頭数','一頭','教頭','口頭','語頭','出頭','心頭','頭上','先頭','船頭','台頭','店頭','頭角','頭目','年頭','番頭','目頭','毛頭'],
		answer:['あたまかず','いっとう','きょうとう','こうとう','ごとう','しゅっとう','しんとう','ずじょう','せんとう','せんどう','たいとう','てんとう','とうかく','とうもく','ねんとう','ばんとう','めがしら','もうとう']
	},
	{
		pronunciation:[['ドウ'],['おなじ']],
		question:['一同','合同','同一','同音','同形','同月','同行','同国','同市','同室','同社','同色','同心','同時','同日','同上','同人','同数','同声','同地','同点','同年','同名','同友'],
		kanji:['一同','合同','同一','同音','同形','同月','同行','同国','同市','同室','同社','同色','同心','同時','同日','同上','同人','同数','同声','同地','同点','同年','同名','同友'],
		answer:['いちどう','ごうどう','どういつ','どうおん','どうけい','どうげつ','どうこう','どうこく','どうし','どうしつ','どうしゃ','どうしょく','どうしん','どうじ','どうじつ','どうじょう','どうじん','どうすう','どうせい','どうち','どうてん','どうねん','どうめい','どうゆう']
	},
	{
		pronunciation:[['ドウ','トウ'],['みち']],
		question:['王道','弓道','公道','国道','小道','茶道','車道','食道','書道','地道','人道','水道','赤道','近道','道場','道中','道内','道楽','道理','花道','歩道','本道','夜道','林道'],
		kanji:['王道','弓道','公道','国道','小道','茶道','車道','食道','書道','地道','人道','水道','赤道','近道','道場','道中','道内','道楽','道理','花道','歩道','本道','夜道','林道'],
		answer:['おうどう','きゅうどう','こうどう','こくどう','こみち','さどう','しゃどう','しょくどう','しょどう','じみち','じんどう','すいどう','せきどう','ちかみち','どうじょう','どうちゅう','どうない','どうらく','どうり','はなみち','ほどう','ほんどう','よみち','りんどう']
	},
	{
		pronunciation:[['ドク','トク','トウ'],['よむ','よみ']],
		question:['一読','多読','通読','読点','読書','読本'],
		kanji:['一読','多読','通読','読点','読書','読本'],
		answer:['いちどく','たどく','つうどく','とうてん','どくしょ','どくほん']
	},
	{
		pronunciation:[['ナイ','ダイ'],['うち']],
		question:['内気','家内','学内','校内','国内','室内','市内','社内','車内','場内','船内','体内','町内','店内','道内','内科','内角','内外','内国','内心','内声','内線','内地','内力','年内'],
		kanji:['内気','家内','学内','校内','国内','室内','市内','社内','車内','場内','船内','体内','町内','店内','道内','内科','内角','内外','内国','内心','内声','内線','内地','内力','年内'],
		answer:['うちき','かない','がくない','こうない','こくない','しつない','しない','しゃない','しゃない','じょうない','せんない','たいない','ちょうない','てんない','どうない','ないか','ないかく','ないがい','ないこく','ないしん','ないせい','ないせん','ないち','ないりょく','ねんない']
	},
	{
		pronunciation:[['ナン','ナ'],['みなみ']],
		question:['東南','南下','南海','南国','南西','南東','南北','南方'],
		kanji:['東南','南下','南海','南国','南西','南東','南北','南方'],
		answer:['とうなん','なんか','なんかい','なんごく','なんせい','なんとう','なんぼく','なんぽう']
	},
	{
		pronunciation:[['ニク'],['']],
		question:['牛肉','魚肉','食肉','肉牛','肉食','肉親','肉声','肉体'],
		kanji:['牛肉','魚肉','食肉','肉牛','肉食','肉親','肉声','肉体'],
		answer:['ぎゅうにく','ぎょにく','しょくにく','にくぎゅう','にくしょく','にくしん','にくせい','にくたい']
	},
	{
		pronunciation:[['バ'],['うま','ま']],
		question:['牛馬','出馬','人馬','早馬','馬車','馬場','馬力','名馬','木馬'],
		kanji:['牛馬','出馬','人馬','早馬','馬車','馬場','馬力','名馬','木馬'],
		answer:['ぎゅうば','しゅつば','じんば','はやうま','ばしゃ','ばば','ばりき','めいば','もくば']
	},
	{
		pronunciation:[['バイ'],['うる','うれる']],
		question:['売上','売子','売場','小売','立売','多売','直売','売春','売店','売買','売名','前売'],
		kanji:['売上','売子','売場','小売','立売','多売','直売','売春','売店','売買','売名','前売'],
		answer:['うりあげ','うりこ','うりば','こうり','たちうり','たばい','ちょくばい','ばいしゅん','ばいてん','ばいばい','ばいめい','まえうり']
	},
	{
		pronunciation:[['バイ'],['かう']],
		question:['買春','売買'],
		kanji:['買春','売買'],
		answer:['ばいしゅん','ばいばい']
	},
	{
		pronunciation:[['バク'],['むぎ']],
		question:['小麦','麦茶'],
		kanji:['小麦','麦茶'],
		answer:['こむぎ','むぎちゃ']
	},
	{
		pronunciation:[['ハン'],['なかば']],
		question:['後半','前半','前半','大半','半円','半角','半紙','半数','半月','半時','半年','半日','半分','夜半'],
		kanji:['後半','前半','前半','大半','半円','半角','半紙','半数','半月','半時','半年','半日','半分','夜半'],
		answer:['こうはん','ぜんはん','ぜんぱん','たいはん','はんえん','はんかく','はんし','はんすう','はんつき','はんとき','はんとし','はんにち','はんぶん','やはん']
	},
	{
		pronunciation:[['バン'],['']],
		question:['一番','交番','三番','地番','茶番','出番','当番','番外','番組','番線','番台','番地','番茶','番頭','番人','本番','店番','門番'],
		kanji:['一番','交番','三番','地番','茶番','出番','当番','番外','番組','番線','番台','番地','番茶','番頭','番人','本番','店番','門番'],
		answer:['いちばん','こうばん','さんばん','ちばん','ちゃばん','でばん','とうばん','ばんがい','ばんぐみ','ばんせん','ばんだい','ばんち','ばんちゃ','ばんとう','ばんにん','ほんばん','みせばん','もんばん']
	},
	{
		pronunciation:[['フ'],['ちち']],
		question:['親父','父親','父兄','父母'],
		kanji:['親父','父親','父兄','父母'],
		answer:['おやじ','ちちおや','ふけい','ふぼ']
	},
	{
		pronunciation:[['フウ','フ'],['かぜ','かざ']],
		question:['風上','風車','風下','家風','北風','気風','強風','校風','古風','作風','社風','新風','台風','中風','通風','西風','風雨','風雲','風光','風車','風雪','風船','風体','風土','風力'],
		kanji:['風上','風車','風下','家風','北風','気風','強風','校風','古風','作風','社風','新風','台風','中風','通風','西風','風雨','風雲','風光','風車','風雪','風船','風体','風土','風力'],
		answer:['かざかみ','かざぐるま','かざしも','かふう','きたかぜ','きふう','きょうふう','こうふう','こふう','さくふう','しゃふう','しんぷう','たいふう','ちゅうぶう','つうふう','にしかぜ','ふうう','ふううん','ふうこう','ふうしゃ','ふうせつ','ふうせん','ふうてい','ふうど','ふうりょく']
	},
	{
		pronunciation:[['ブン','フン','ブ'],['わける','わかれる','わかる','わかつ']],
		question:['親分','気分','五分','細分','三分','秋分','春分','時分','自分','十分','水分','線分','多分','多分','大分','大分','天分','当分','何分','何分','二分','八分','半分','分科','分会','分家','分校','分子','分室','分社','分数','分母','分野','分立','名分','夜分'],
		kanji:['親分','気分','五分','細分','三分','秋分','春分','時分','自分','十分','水分','線分','多分','多分','大分','大分','天分','当分','何分','何分','二分','八分','半分','分科','分会','分家','分校','分子','分室','分社','分数','分母','分野','分立','名分','夜分'],
		answer:['おやぶん','きぶん','ごぶ','さいぶん','さんぶん','しゅうぶん','しゅんぶん','じぶん','じぶん','じゅうぶん','すいぶん','せんぶん','たぶん','たぶん','だいぶ','だいぶん','てんぶん','とうぶん','なにぶん','なんぷん','にぶん','はちぶ','はんぶん','ぶんか','ぶんかい','ぶんけ','ぶんこう','ぶんし','ぶんしつ','ぶんしゃ','ぶんすう','ぶんぼ','ぶんや','ぶんりつ','めいぶん','やぶん']
	},
	{
		pronunciation:[['ブン','モン'],['きく','きこえる']],
		question:['新聞','百聞'],
		kanji:['新聞','百聞'],
		answer:['しんぶん','ひゃくぶん']
	},
	{
		pronunciation:[['ベイ','マイ'],['こめ']],
		question:['新米','白米','米作','米食'],
		kanji:['新米','白米','米作','米食'],
		answer:['しんまい','はくまい','べいさく','べいしょく']
	},
	{
		pronunciation:[['ホ','ブ','フ'],['あるく','あゆむ']],
		question:['一歩','出歩','日歩','歩合','歩行','歩道'],
		kanji:['一歩','出歩','日歩','歩合','歩行','歩道'],
		answer:['いっぽ','である','ひぶ','ぶあい','ほこう','ほどう']
	},
	{
		pronunciation:[['ボ'],['はは']],
		question:['空母','生母','母親','父母','分母','母音','母校','母国','母語','母子','母船','母体'],
		kanji:['空母','生母','母親','父母','分母','母音','母校','母国','母語','母子','母船','母体'],
		answer:['くうぼ','せいぼ','ははおや','ふぼ','ぶんぼ','ぼいん','ぼこう','ぼこく','ぼご','ぼし','ぼせん','ぼたい']
	},
	{
		pronunciation:[['ホウ'],['かた']],
		question:['朝方','一方','遠方','大方','親方','上方','後方','四方','上方','正方','西方','先方','前方','地方','東方','当方','土方','南方','方船','八方','方角','方丸','方形','方言','方正','方体','北方','見方','目方','夕方','行方'],
		kanji:['朝方','一方','遠方','大方','親方','上方','後方','四方','上方','正方','西方','先方','前方','地方','東方','当方','土方','南方','方船','八方','方角','方丸','方形','方言','方正','方体','北方','見方','目方','夕方','行方'],
		answer:['あさがた','いっぽう','えんぽう','おおかた','おやかた','かみがた','こうほう','しほう','じょうほう','せいほう','せいほう','せんぽう','ぜんぽう','ちほう','とうほう','とうほう','どかた','なんぽう','はこぶね','はっぽう','ほうがく','ほうがん','ほうけい','ほうげん','ほうせい','ほうたい','ほっぽう','みかた','めかた','ゆうがた','ゆくえ']
	},
	{
		pronunciation:[['ホク'],['きた']],
		question:['北風','北口','東北','南北','北上','北西','北東','北方'],
		kanji:['北風','北口','東北','南北','北上','北西','北東','北方'],
		answer:['きたかぜ','きたぐち','とうほく','なんぼく','ほくじょう','ほくせい','ほくとう','ほっぽう']
	},
	{
		pronunciation:[['マイ'],['']],
		question:['日毎','毎朝','毎回','毎週','毎時','毎月','毎年','毎日','毎年','毎夜'],
		kanji:['日毎','毎朝','毎回','毎週','毎時','毎月','毎年','毎日','毎年','毎夜'],
		answer:['ひごと','まいあさ','まいかい','まいしゅう','まいじ','まいつき','まいとし','まいにち','まいねん','まいよ']
	},
	{
		pronunciation:[['マイ'],['いもうと']],
		question:['姉妹'],
		kanji:['姉妹'],
		answer:['しまい']
	},
	{
		pronunciation:[['マン','バン'],['']],
		question:['千万','万国','万人','万一','万一','万円','万人'],
		kanji:['千万','万国','万人','万一','万一','万円','万人'],
		answer:['せんばん','ばんこく','ばんにん','まんいち','まんいち','まんえん','まんにん']
	},
	{
		pronunciation:[['メイ','ミョウ'],['あかり','あかるい','あかるむ','あからむ','あきらか','あける','あく','あくる','あかす']],
		question:['明日','明日','言明','公明','自明','声明','文明','明星','明朝','明日','明年','明記','明言','明細','明色','明知','明白'],
		kanji:['明日','明日','言明','公明','自明','声明','文明','明星','明朝','明日','明年','明記','明言','明細','明色','明知','明白'],
		answer:['あした','あす','げんめい','こうめい','じめい','せいめい','ぶんめい','みょうじょう','みょうちょう','みょうにち','みょうねん','めいき','めいげん','めいさい','めいしょく','めいち','めいはく']
	},
	{
		pronunciation:[['メイ'],['なく','なる','ならす']],
		question:['高鳴'],
		kanji:['高鳴'],
		answer:['たかな']
	},
	{
		pronunciation:[['モウ'],['け']],
		question:['赤毛','羽毛','毛糸','毛虫','体毛','三毛','毛頭'],
		kanji:['赤毛','羽毛','毛糸','毛虫','体毛','三毛','毛頭'],
		answer:['あかげ','うもう','けいと','けむし','たいもう','みけ','もうとう']
	},
	{
		pronunciation:[['モン'],['かど']],
		question:['門出','校門','水門','正門','大門','中門','入門','名門','門下','門外','門戸','門前','門弟','門番'],
		kanji:['門出','校門','水門','正門','大門','中門','入門','名門','門下','門外','門戸','門前','門弟','門番'],
		answer:['かどで','こうもん','すいもん','せいもん','だいもん','ちゅうもん','にゅうもん','めいもん','もんか','もんがい','もんこ','もんぜん','もんてい','もんばん']
	},
	{
		pronunciation:[['ヤ'],['よ','よる']],
		question:['一夜','今夜','前夜','昼夜','月夜','通夜','日夜','白夜','毎夜','夜間','夜学','夜光','夜行','夜食','夜半','夜分','夜来','夜空','夜中','夜道'],
		kanji:['一夜','今夜','前夜','昼夜','月夜','通夜','日夜','白夜','毎夜','夜間','夜学','夜光','夜行','夜食','夜半','夜分','夜来','夜空','夜中','夜道'],
		answer:['いちや','こんや','ぜんや','ちゅうや','つきよ','つや','にちや','びゃくや','まいよ','やかん','やがく','やこう','やこう','やしょく','やはん','やぶん','やらい','よぞら','よなか','よみち']
	},
	{
		pronunciation:[['ヤ'],['の']],
		question:['外野','広野','野天','野中','野原','野山','分野','野外','野手','野心','野人','野生','野草','野鳥','林野'],
		kanji:['外野','広野','野天','野中','野原','野山','分野','野外','野手','野心','野人','野生','野草','野鳥','林野'],
		answer:['がいや','こうや','のてん','のなか','のはら','のやま','ぶんや','やがい','やしゅ','やしん','やじん','やせい','やそう','やちょう','りんや']
	},
	{
		pronunciation:[['ユウ'],['とも']],
		question:['学友','交友','親友','友引','同友','友人'],
		kanji:['学友','交友','親友','友引','同友','友人'],
		answer:['がくゆう','こうゆう','しんゆう','ともびき','どうゆう','ゆうじん']
	},
	{
		pronunciation:[['ヨウ'],['もちいる','はたらき']],
		question:['引用','活用','公用','作用','算用','社用','食用','多用','通用','当用','土用','入用','用言','用語','用紙','用心','用水','用地'],
		kanji:['引用','活用','公用','作用','算用','社用','食用','多用','通用','当用','土用','入用','用言','用語','用紙','用心','用水','用地'],
		answer:['いんよう','かつよう','こうよう','さよう','さんよう','しゃよう','しょくよう','たよう','つうよう','とうよう','どよう','にゅうよう','ようげん','ようご','ようし','ようじん','ようすい','ようち']
	},
	{
		pronunciation:[['ヨウ'],['']],
		question:['火曜','金曜','月曜','七曜','水曜','土曜','日曜','木曜','曜日','六曜'],
		kanji:['火曜','金曜','月曜','七曜','水曜','土曜','日曜','木曜','曜日','六曜'],
		answer:['かよう','きんよう','げつよう','しちよう','すいよう','どよう','にちよう','もくよう','ようび','ろくよう']
	},
	{
		pronunciation:[['ライ'],['くる','きたる','きたす']],
		question:['元来','近来','家来','古来','出来','出来','生来','出来','年来','本来','本来','夜来','来夏','来会','来月','来光','来校','来社','来秋','来週','来春','来場','来店','来日','来年'],
		kanji:['元来','近来','家来','古来','出来','出来','生来','出来','年来','本来','本来','夜来','来夏','来会','来月','来光','来校','来社','来秋','来週','来春','来場','来店','来日','来年'],
		answer:['がんらい','きんらい','けらい','こらい','しゅったい','しゅつらい','せいらい','でき','ねんらい','ほんらい','ほんらい','やらい','らいか','らいかい','らいげつ','らいこう','らいこう','らいしゃ','らいしゅう','らいしゅう','らいしゅん','らいじょう','らいてん','らいにち','らいねん']
	},
	{
		pronunciation:[['リ'],['さと']],
		question:['千里','人里','古里','山里'],
		kanji:['千里','人里','古里','山里'],
		answer:['せんり','ひとざと','ふるさと','やまざと']
	},
	{
		pronunciation:[['リ'],['']],
		question:['原理','合理','心理','数理','生理','地理','天理','道理','理科','理学','理工','理知'],
		kanji:['原理','合理','心理','数理','生理','地理','天理','道理','理科','理学','理工','理知'],
		answer:['げんり','ごうり','しんり','すうり','せいり','ちり','てんり','どうり','りか','りがく','りこう','りち']
	},
	{
		pronunciation:[['ワ'],['はなす','はなし']],
		question:['会話','小話','手話','通話','電話','長話'],
		kanji:['会話','小話','手話','通話','電話','長話'],
		answer:['かいわ','こばなし','しゅわ','つうわ','でんわ','ながばなし']
	}
];

const kanjiList = [
    ['一','右','雨','円','王','音','下','火','花','貝','学','気','九','休','玉','金','空','月','犬','見','五','口','校','左','三','山','子','四','糸','字','耳','七','車','手','十','出','女','小','上','森','人','水','正','生','青','夕','石','赤','千','川','先','早','草','足','村','大','男','竹','中','虫','町','天','田','土','二','日','入','年','白','八','百','文','木','本','名','目','立','力','林','六'],
    ['引','羽','雲','園','遠','何','科','夏','家','歌','画','回','会','海','絵','外','角','楽','活','間','丸','岩','顔','汽','記','帰','弓','牛','魚','京','強','教','近','兄','形','計','元','言','原','戸','古','午','後','語','工','公','広','交','光','考','行','高','黄','合','谷','国','黒','今','才','細','作','算','止','市','矢','姉','思','紙','寺','自','時','室','社','弱','首','秋','週','春','書','少','場','色','食','心','新','親','図','数','西','声','星','晴','切','雪','船','線','前','組','走','多','太','体','台','地','池','知','茶','昼','長','鳥','朝','直','通','弟','店','点','電','刀','冬','当','東','答','頭','同','道','読','内','南','肉','馬','売','買','麦','半','番','父','風','分','聞','米','歩','母','方','北','毎','妹','万','明','鳴','毛','門','夜','野','友','用','曜','来','里','理','話'],
    ['悪','安','暗','医','委','意','育','員','院','飲','運','泳','駅','央','横','屋','温','化','荷','界','開','階','寒','感','漢','館','岸','起','期','客','究','急','級','宮','球','去','橋','業','曲','局','銀','区','苦','具','君','係','軽','血','決','研','県','庫','湖','向','幸','港','号','根','祭','皿','仕','死','使','始','指','歯','詩','次','事','持','式','実','写','者','主','守','取','酒','受','州','拾','終','習','集','住','重','宿','所','暑','助','昭','消','商','章','勝','乗','植','申','身','神','真','深','進','世','整','昔','全','相','送','想','息','速','族','他','打','対','待','代','第','題','炭','短','談','着','注','柱','丁','帳','調','追','定','庭','笛','鉄','転','都','度','投','豆','島','湯','登','等','動','童','農','波','配','倍','箱','畑','発','反','坂','板','皮','悲','美','鼻','筆','氷','表','秒','病','品','負','部','服','福','物','平','返','勉','放','味','命','面','問','役','薬','由','油','有','遊','予','羊','洋','葉','陽','様','落','流','旅','両','緑','礼','列','練','路','和'],
    ['愛','案','以','衣','位','茨','印','英','栄','媛','塩','岡','億','加','果','貨','課','芽','賀','改','械','害','街','各','覚','潟','完','官','管','関','観','願','岐','希','季','旗','器','機','議','求','泣','給','挙','漁','共','協','鏡','競','極','熊','訓','軍','郡','群','径','景','芸','欠','結','建','健','験','固','功','好','香','候','康','佐','差','菜','最','埼','材','崎','昨','札','刷','察','参','産','散','残','氏','司','試','児','治','滋','辞','鹿','失','借','種','周','祝','順','初','松','笑','唱','焼','照','城','縄','臣','信','井','成','省','清','静','席','積','折','節','説','浅','戦','選','然','争','倉','巣','束','側','続','卒','孫','帯','隊','達','単','置','仲','沖','兆','低','底','的','典','伝','徒','努','灯','働','特','徳','栃','奈','梨','熱','念','敗','梅','博','阪','飯','飛','必','票','標','不','夫','付','府','阜','富','副','兵','別','辺','変','便','包','法','望','牧','末','満','未','民','無','約','勇','要','養','浴','利','陸','良','料','量','輪','類','令','冷','例','連','老','労','録'],
    ['圧','囲','移','因','永','営','衛','易','益','液','演','応','往','桜','可','仮','価','河','過','快','解','格','確','額','刊','幹','慣','眼','紀','基','寄','規','喜','技','義','逆','久','旧','救','居','許','境','均','禁','句','型','経','潔','件','険','検','限','現','減','故','個','護','効','厚','耕','航','鉱','構','興','講','告','混','査','再','災','妻','採','際','在','財','罪','殺','雑','酸','賛','士','支','史','志','枝','師','資','飼','示','似','識','質','舎','謝','授','修','述','術','準','序','招','証','象','賞','条','状','常','情','織','職','制','性','政','勢','精','製','税','責','績','接','設','絶','祖','素','総','造','像','増','則','測','属','率','損','貸','態','団','断','築','貯','張','停','提','程','適','統','堂','銅','導','得','毒','独','任','燃','能','破','犯','判','版','比','肥','非','費','備','評','貧','布','婦','武','復','複','仏','粉','編','弁','保','墓','報','豊','防','貿','暴','脈','務','夢','迷','綿','輸','余','容','略','留','領','歴'],
    ['胃','異','遺','域','宇','映','延','沿','恩','我','灰','拡','革','閣','割','株','干','巻','看','簡','危','机','揮','貴','疑','吸','供','胸','郷','勤','筋','系','敬','警','劇','激','穴','券','絹','権','憲','源','厳','己','呼','誤','后','孝','皇','紅','降','鋼','刻','穀','骨','困','砂','座','済','裁','策','冊','蚕','至','私','姿','視','詞','誌','磁','射','捨','尺','若','樹','収','宗','就','衆','従','縦','縮','熟','純','処','署','諸','除','承','将','傷','障','蒸','針','仁','垂','推','寸','盛','聖','誠','舌','宣','専','泉','洗','染','銭','善','奏','窓','創','装','層','操','蔵','臓','存','尊','退','宅','担','探','誕','段','暖','値','宙','忠','著','庁','頂','腸','潮','賃','痛','敵','展','討','党','糖','届','難','乳','認','納','脳','派','拝','背','肺','俳','班','晩','否','批','秘','俵','腹','奮','並','陛','閉','片','補','暮','宝','訪','亡','忘','棒','枚','幕','密','盟','模','訳','郵','優','預','幼','欲','翌','乱','卵','覧','裏','律','臨','朗','論']
];


window.onload = function () {

    if (window.name != "any") {
        location.reload();
        window.name = "any";
    } else {
        window.name = "";
    }

}

let kanjiGrade = 1;
let kanjiNumber = 0;
let passData = 0;
const quizLength = quiz.length;



//漢字の読みクイズのセットアップ
const setUpQuiz = (kanjiNumber, quiz) => {
	
	//指定学年に合わせて漢字ボタンを作成
	let kanjiCloneCounter = 0;
	while(kanjiCloneCounter < kanjiList[kanjiGrade].length-1){
		let kanjiClone = document.getElementsByClassName('kanjis');
		let cloneElement = kanjiClone[kanjiCloneCounter].cloneNode(true);
		kanjiClone[kanjiCloneCounter].after(cloneElement);
		kanjiCloneCounter++;
	}
	setKanji(kanjiGrade);
	
	//漢字の読みクイズをあるだけ作成
	let cloneCounter = 0;
		while(cloneCounter < quiz[kanjiNumber].question.length-1){
		let quizClone = document.getElementsByClassName('quiz_clone');
		let cloneElement = quizClone[cloneCounter].cloneNode(true);
		quizClone[cloneCounter].after(cloneElement);
		cloneCounter++;
	}

	const $question = document.getElementsByClassName('kanji-question');
	const $how_to_read = document.getElementsByClassName('how_to_read');
	
	//クイズ作成
	let inputCounter = 0;
	while(inputCounter < quiz[kanjiNumber].question.length){
		let inputToSplit = quiz[kanjiNumber].question[inputCounter].split(quiz[kanjiNumber].kanji[inputCounter]);
		$question[inputCounter].textContent = String(inputCounter+1) + '、 ' + inputToSplit[0] + ' [ ' + quiz[kanjiNumber].kanji[inputCounter] + ' ] ' + inputToSplit[1];
		$how_to_read[inputCounter].value = '';
		inputCounter++;
	}
	document.getElementById('correct_message').textContent = '';
	goToQuestion(kanjiGrade);
	hiddenRegisterBtn();
	setKanjiColor(kanjiGrade);
	changePassKanjiColor();
}
setUpQuiz(kanjiNumber, quiz);
document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];



//漢字の読みクイズの合否判定
function judge() {
	let score = 0;
	let quizLength = quiz[kanjiNumber].question.length;

	let answerToShow = document.getElementsByClassName('kanji-answer');

	for(let i = 0; i < quizLength; i++){
		let $answer = document.getElementsByClassName('how_to_read')[i].value;
		answerToShow[i].textContent = quiz[kanjiNumber].answer[i];
		if ($answer == quiz[kanjiNumber].answer[i]){
			score++;
		}
	}
	setTimeout(removeAnswer,3000);

	if (score == quizLength){
		document.getElementById('correct_message').textContent = '全問正解です！！（' + score + '点/' + quizLength + '点中）';
		$targetPassKanji = document.getElementById('kanji');
		passNumber = kanjiList[kanjiGrade].indexOf($targetPassKanji.textContent);
		passData = passNumber;

		$('#congratulations').css('visibility','visible');
		$('#registerButton').css('visibility','visible');
		openPopup(kanjiGrade, kanjiNumber);
	} else {
		document.getElementById('correct_message').textContent = '残念！もう一度やってみよう！！';
	}

}


//答えを消す
function removeAnswer(){
	let quizLength = quiz[kanjiNumber].question.length;
	let answerToShow = document.getElementsByClassName('kanji-answer');
	for(let i = 0; i < quizLength; i++){
		answerToShow[i].textContent = '';
	}
}


//各学年の漢字に色をつける
function setKanjiColor(kanjiGrade){
	let colorList = ['#ffdbdb','#ffdbed','#eddbff','#dbdbff','#dbedff','#ffeddb'];
	if(kanjiGrade == 0){
		changeColor(colorList[0]);
	}else if(kanjiGrade == 1){
		changeColor(colorList[1]);
	}else if(kanjiGrade == 2){
		changeColor(colorList[2]);
	}else if(kanjiGrade == 3){
		changeColor(colorList[3]);
	}else if(kanjiGrade == 4){
		changeColor(colorList[4]);
	}else if(kanjiGrade == 5){
		changeColor(colorList[5]);
	}
}

//色変え
function changeColor(color){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].style.backgroundColor = color;
	}
	setHover(color);
}

function setHover(color){
	let $mouseover = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $mouseover.length; i++){
		$mouseover[i].addEventListener('mouseover', function() {
			$mouseover[i].style.backgroundColor = 'white';
		});
		$mouseover[i].addEventListener('mouseleave', function() {
			$mouseover[i].style.backgroundColor = color;
		});
	}
}





//指定された学年の漢字をボタンに書き込む
function setKanji(kanjiGrade){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].textContent = kanjiList[kanjiGrade][i];
	}
	//漢字ボタンのクリック機能(漢字大きく表示)をオンにする
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].addEventListener('click', showKanji, false);
	}

}





//前回のクイズ削除
function removeQuiz(){
	removeAnswer();
	let cloneRemoveCounter = quiz[kanjiNumber].question.length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('quiz_clone');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
}





//前回の学年の漢字削除
function removeKanji(){
	let cloneRemoveCounter = kanjiList[kanjiGrade].length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('kanjis');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
	document.getElementsByClassName('kanjis')[0].textContent = kanjiList[kanjiGrade][0];
}




//漢字ボタンを押すと、その漢字を大きく表示
function showKanji(e){
	removeQuiz();
	removeKanji();

	$targetKanji = document.getElementById('kanji');
	$targetKanji.textContent = e.target.textContent;
	kanjiNumber = kanjiList[kanjiGrade].indexOf($targetKanji.textContent);

	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	document.getElementsByClassName('how_to_read')[0].value = '';
	
	setUpQuiz(kanjiNumber, quiz);
}




//学年変更
function changeGrade(grade){
	removeQuiz();
	removeKanji();

	kanjiGrade = grade;
	kanjiNumber = 0;

	if(grade == 1){
		quiz = quiz2;
		document.getElementById('grade').textContent = '小学校２年生の漢字';
	} else if(grade == 2){
		quiz = quiz3;
		document.getElementById('grade').textContent = '小学校３年生の漢字';
	} else if(grade == 3){
		quiz = quiz4;
		document.getElementById('grade').textContent = '小学校４年生の漢字';
	} else if(grade == 4){
		quiz = quiz5;
		document.getElementById('grade').textContent = '小学校５年生の漢字';
	} else if(grade == 5){
		quiz = quiz6;
		document.getElementById('grade').textContent = '小学校６年生の漢字';
	} else {
		quiz = quiz1;
		document.getElementById('grade').textContent = '小学校1年生の漢字';
	}
	
	setUpQuiz(kanjiNumber, quiz);
	document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	location.href = '#';
}





function hiddenRegisterBtn() {
    $('#congratulations').css('visibility','hidden');
	$('#registerButton').css('visibility','hidden');
}




//答え合わせボタンでjudge()発動
document.addEventListener('DOMContentLoaded', () => {
    const answerButton = document.getElementById("answerButton");
    answerButton.addEventListener("click", () => { judge() });
});

//学年変更ボタンでchangeGrade()発動
document.addEventListener('DOMContentLoaded', () => {
	const changeGradeButton = document.getElementsByClassName("changeGradeButton");
	for(let i = 0; i < changeGradeButton.length; i++){
    	changeGradeButton[i].addEventListener("click", () => { changeGrade(i) });
	}
});


//railsに正解した漢字のデータをpost
function postData(){

	$.ajax({
		url: '/kanji_quiz/update',
		type: 'GET',
		dataType: 'text',
		async: true,
		data: {
			grade: String(kanjiGrade),
			passData: String(passData),
		},
	});
}


//図鑑に登録ボタンでpostData()発動
let login_checker = document.getElementById('login_checker');
if(login_checker.textContent == 'true'){
	document.addEventListener('DOMContentLoaded', () => {
		const registerButton = document.getElementById("registerButton");
		registerButton.addEventListener("click", () => { postData() });
	});
}



//合格時のアニメーション
function openPopup(grade, num){
	let img = document.getElementById('image_file');
	let imgName = '/image' + grade + '_' + num + '.jpg';
	if(num > 8){
		imgName = '/dummy.jpg';
	}
	if(grade > 0){
		imgName = '/dummy.jpg';
	}
	img.src = imgName;
	document.querySelector('#image_file').animate(
		[
			{ transform: 'scale(0)' },
			{ transform: 'scale(2)' },
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(0, 0)'}
		],
		{
		  duration: 3000,
		  iterations: 1,
		  direction: 'normal'
		}
	);
	let popup = document.getElementById('js-popup');
	popup.classList.add('is-show');
	let passMessage = document.getElementById('pass_message');
	passMessage.style.visibility = 'visible';
}

function closePopUp() {
	let popup = document.getElementById('js-popup');
	let blackBg = document.getElementById('js-black-bg');
	let closeBtn = document.getElementById('js-close-btn');
	let img = document.getElementById('image_file');
	blackBg.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
	closeBtn.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
}
closePopUp();


let pageTop = document.getElementById('page_top');
pageTop.addEventListener('click', function() {
	$('html, body').animate({scrollTop:0},400);
});

function goToQuestion(kanjiGrade){
	let $goToQues = document.getElementsByClassName('kanjis');
	let $target = document.getElementById('hidden_block');
	for(let i = 0; i < kanjiList[kanjiGrade].length; i++){
		$goToQues[i].addEventListener('click', function() {
			$target.scrollIntoView({
				behavior: "smooth",
				block: "start",
				inline: "nearest"
			  });
		});
	}
}


//合格漢字の色を変える
function changePassKanjiColor(){
	//forで正解配列作る処理
	let login_checker = document.getElementById('login_checker');
	if(login_checker.textContent == 'true'){
		let $dummy = document.getElementsByClassName('dummy_data');
		let correctList = [];
		for(let i = 1; i < $dummy.length; i++){
			let splitData = $dummy[i].textContent.trim();
			splitData = splitData.slice(0,-1);
			let splitList = splitData.split(',');
			correctList.push(splitList);
		}
		

		let newColorList = ['#ff7f7f', '#ff7fbf', '#bf7fff', '#7f7fff', '#7fbfff', '#ffbf7f'];
		const $kanjiList = document.getElementsByClassName('kanjis');
		for(let i = 0; i < correctList[kanjiGrade].length; i++){
			let num = correctList[kanjiGrade][i];
			if(num != ''){
				$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];
				$kanjiList[num].addEventListener('mouseleave', function() {
					$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];	
				});
			}
		}
	}
	
}