const quiz = [
	{
		pronunciation:[['イ'],['']],
		question:['胃腸'],
		kanji:['胃腸'],
		answer:['いちょう']
	},
	{
		pronunciation:[['イ'],['こと']],
		question:['異化','異境','異郷','異義','異議','異見','異国','異質','異種','異色','異常','異状','異人','異性','異星','異説','異存','異体','異動','異同','異物','異変','異名','異様','異例','異論','差異','小異','特異'],
		kanji:['異化','異境','異郷','異義','異議','異見','異国','異質','異種','異色','異常','異状','異人','異性','異星','異説','異存','異体','異動','異同','異物','異変','異名','異様','異例','異論','差異','小異','特異'],
		answer:['いか','いきょう','いきょう','いぎ','いぎ','いけん','いこく','いしつ','いしゅ','いしょく','いじょう','いじょう','いじん','いせい','いせい','いせつ','いぞん','いたい','いどう','いどう','いぶつ','いへん','いめい','いよう','いれい','いろん','さい','しょうい','とくい']
	},
	{
		pronunciation:[['イ','ユイ'],['']],
		question:['遺業','遺骨','遺言','遺作','遺産','遺志','遺失','遺書','遺児','遺族','遺体','遺著','遺伝','遺品','遺物','遺留','拾遺','補遺','遺言'],
		kanji:['遺業','遺骨','遺言','遺作','遺産','遺志','遺失','遺書','遺児','遺族','遺体','遺著','遺伝','遺品','遺物','遺留','拾遺','補遺','遺言'],
		answer:['いぎょう','いこつ','いごん','いさく','いさん','いし','いしつ','いしょ','いじ','いぞく','いたい','いちょ','いでん','いひん','いぶつ','いりゅう','しゅうい','ほい','ゆいごん']
	},
	{
		pronunciation:[['イキ'],['']],
		question:['海域','区域','空域','広域','水域','全域','帯域','大域','地域','流域','領域'],
		kanji:['海域','区域','空域','広域','水域','全域','帯域','大域','地域','流域','領域'],
		answer:['かいいき','くいき','くういき','こういき','すいいき','ぜんいき','たいいき','たいいき','ちいき','りゅういき','りょういき']
	},
	{
		pronunciation:[['ウ'],['']],
		question:['宇宙','気宇'],
		kanji:['宇宙','気宇'],
		answer:['うちゅう','きう']
	},
	{
		pronunciation:[['エイ'],['うつる','うつす','はえる']],
		question:['映画','映写','映像','面映','残映','上映','反映','放映'],
		kanji:['映画','映写','映像','面映','残映','上映','反映','放映'],
		answer:['えいが','えいしゃ','えいぞう','おもはゆ','ざんえい','じょうえい','はんえい','ほうえい']
	},
	{
		pronunciation:[['エン'],['のびる','のべる','のばす']],
		question:['圧延','延期','延焼','延性','延着','延長','延命','外延','順延'],
		kanji:['圧延','延期','延焼','延性','延着','延長','延命','外延','順延'],
		answer:['あつえん','えんき','えんしょう','えんせい','えんちゃく','えんちょう','えんめい','がいえん','じゅんえん']
	},
	{
		pronunciation:[['エン'],['そう']],
		question:['沿海','沿革','沿岸','沿線','沿道'],
		kanji:['沿海','沿革','沿岸','沿線','沿道'],
		answer:['えんかい','えんかく','えんがん','えんせん','えんどう']
	},
	{
		pronunciation:[['オン'],['']],
		question:['恩給','恩師','恩賞','恩人','恩典','謝恩'],
		kanji:['恩給','恩師','恩賞','恩人','恩典','謝恩'],
		answer:['おんきゅう','おんし','おんしょう','おんじん','おんてん','しゃおん']
	},
	{
		pronunciation:[['ガ'],['われ','わ']],
		question:['我欲','我流','自我','忘我','無我','我家'],
		kanji:['我欲','我流','自我','忘我','無我','我家'],
		answer:['がよく','がりゅう','じが','ぼうが','むが','わがや']
	},
	{
		pronunciation:[['カイ'],['はい']],
		question:['石灰','灰色','灰皿'],
		kanji:['石灰','灰色','灰皿'],
		answer:['せっかい','はいいろ','はいざら']
	},
	{
		pronunciation:[['カク'],['']],
		question:['拡散','拡声','拡大','拡張','軍拡'],
		kanji:['拡散','拡声','拡大','拡張','軍拡'],
		answer:['かくさん','かくせい','かくだい','かくちょう','ぐんかく']
	},
	{
		pronunciation:[['カク'],['かわ']],
		question:['沿革','改革','革新','革命','行革','皮革','変革','保革'],
		kanji:['沿革','改革','革新','革命','行革','皮革','変革','保革'],
		answer:['えんかく','かいかく','かくしん','かくめい','ぎょうかく','ひかく','へんかく','ほかく']
	},
	{
		pronunciation:[['カク'],['']],
		question:['閣議','閣内','閣下','組閣','内閣','入閣','仏閣'],
		kanji:['閣議','閣内','閣下','組閣','内閣','入閣','仏閣'],
		answer:['かくぎ','かくない','かっか','そかく','ないかく','にゅうかく','ぶっかく']
	},
	{
		pronunciation:[['カツ'],['わる','わり','われる','さく']],
		question:['割腹','割愛','学割','日割','分割','役割','割合','割当','割印','割算','割高','割引','割安'],
		kanji:['割腹','割愛','学割','日割','分割','役割','割合','割当','割印','割算','割高','割引','割安'],
		answer:['かっぷく','かつあい','がくわり','ひわり','ぶんかつ','やくわり','わりあい','わりあて','わりいん','わりざん','わりだか','わりびき','わりやす']
	},
	{
		pronunciation:[[''],['かぶ']],
		question:['株価','株券','株式','株主','切株','新株'],
		kanji:['株価','株券','株式','株主','切株','新株'],
		answer:['かぶか','かぶけん','かぶしき','かぶぬし','きりかぶ','しんかぶ']
	},
	{
		pronunciation:[['カン'],['ほす','ひる']],
		question:['梅干','干支','干害','干潮','干満','十干','若干','干物'],
		kanji:['梅干','干支','干害','干潮','干満','十干','若干','干物'],
		answer:['うめぼし','えと','かんがい','かんちょう','かんまん','じっかん','じゃっかん','ひもの']
	},
	{
		pronunciation:[['カン'],['まく','まき']],
		question:['圧巻','新巻','一巻','絵巻','巻頭','巻末','下巻','逆巻','上巻','全巻','通巻','葉巻','別巻','巻紙','巻尺','巻物'],
		kanji:['圧巻','新巻','一巻','絵巻','巻頭','巻末','下巻','逆巻','上巻','全巻','通巻','葉巻','別巻','巻紙','巻尺','巻物'],
		answer:['あっかん','あらまき','いっかん','えまき','かんとう','かんまつ','げかん','さかま','じょうかん','ぜんかん','つうかん','はまき','べっかん','まきがみ','まきじゃく','まきもの']
	},
	{
		pronunciation:[['カン'],['']],
		question:['看過','看護','看取','看守','看板','看病','看取'],
		kanji:['看過','看護','看取','看守','看板','看病','看取'],
		answer:['かんか','かんご','かんしゅ','かんしゅ','かんばん','かんびょう','みと']
	},
	{
		pronunciation:[['カン'],['']],
		question:['簡易','簡潔','簡裁','簡素','簡単','簡便','簡明','簡約','簡略','貴簡','書簡','料簡'],
		kanji:['簡易','簡潔','簡裁','簡素','簡単','簡便','簡明','簡約','簡略','貴簡','書簡','料簡'],
		answer:['かんい','かんけつ','かんさい','かんそ','かんたん','かんべん','かんめい','かんやく','かんりゃく','きかん','しょかん','りょうけん']
	},
	{
		pronunciation:[['キ'],['あぶない','あやうい','あやぶむ']],
		question:['危害','危機','危険'],
		kanji:['危害','危機','危険'],
		answer:['きがい','きき','きけん']
	},
	{
		pronunciation:[['キ'],['つくえ']],
		question:['机上'],
		kanji:['机上'],
		answer:['きじょう']
	},
	{
		pronunciation:[['キ'],['']],
		question:['揮発','指揮','発揮'],
		kanji:['揮発','指揮','発揮'],
		answer:['きはつ','しき','はっき']
	},
	{
		pronunciation:[['キ'],['たっとい','とうとい','たっとぶ','とうとぶ']],
		question:['貴方','兄貴','貴意','貴下','貴簡','貴君','貴兄','貴校','貴国','貴様','貴誌','貴社','貴書','貴信','貴女','貴族','貴台','貴地','貴重','貴店','貴方','高貴','富貴'],
		kanji:['貴方','兄貴','貴意','貴下','貴簡','貴君','貴兄','貴校','貴国','貴様','貴誌','貴社','貴書','貴信','貴女','貴族','貴台','貴地','貴重','貴店','貴方','高貴','富貴'],
		answer:['あなた','あにき','きい','きか','きかん','きくん','きけい','きこう','きこく','きさま','きし','きしゃ','きしょ','きしん','きじょ','きぞく','きだい','きち','きちょう','きてん','きほう','こうき','ふうき']
	},
	{
		pronunciation:[['ギ'],['うたがう']],
		question:['疑義','疑心','疑似','疑念','疑問','質疑','容疑'],
		kanji:['疑義','疑心','疑似','疑念','疑問','質疑','容疑'],
		answer:['ぎぎ','ぎしん','ぎじ','ぎねん','ぎもん','しつぎ','ようぎ']
	},
	{
		pronunciation:[['キュウ'],['すう']],
		question:['吸引','吸気','吸血','吸収','吸水','吸着','吸入','呼吸'],
		kanji:['吸引','吸気','吸血','吸収','吸水','吸着','吸入','呼吸'],
		answer:['きゅういん','きゅうき','きゅうけつ','きゅうしゅう','きゅうすい','きゅうちゃく','きゅうにゅう','こきゅう']
	},
	{
		pronunciation:[['キョウ','ク'],['そなえる','とも']],
		question:['供応','供給','供血','供出','供述','供覧','供物','供養','子供','自供','提供','私供'],
		kanji:['供応','供給','供血','供出','供述','供覧','供物','供養','子供','自供','提供','私供'],
		answer:['きょうおう','きょうきゅう','きょうけつ','きょうしゅつ','きょうじゅつ','きょうらん','くもつ','くよう','こども','じきょう','ていきょう','わたしども']
	},
	{
		pronunciation:[['キョウ'],['むね','むな']],
		question:['胸囲','胸骨','胸式','胸像','胸中','胸部','度胸','胸毛'],
		kanji:['胸囲','胸骨','胸式','胸像','胸中','胸部','度胸','胸毛'],
		answer:['きょうい','きょうこつ','きょうしき','きょうぞう','きょうちゅう','きょうぶ','どきょう','むなげ']
	},
	{
		pronunciation:[['キョウ','ゴウ'],['']],
		question:['異郷','帰郷','郷土','郷里','故郷','在郷','他郷','同郷','望郷'],
		kanji:['異郷','帰郷','郷土','郷里','故郷','在郷','他郷','同郷','望郷'],
		answer:['いきょう','ききょう','きょうど','きょうり','こきょう','ざいごう','たきょう','どうきょう','ぼうきょう']
	},
	{
		pronunciation:[['キン','ゴン'],['つとまる','つとめる']],
		question:['外勤','勤続','勤勉','勤務','勤労','欠勤','勤行','在勤','出勤','常勤','精勤','忠勤','通勤','転勤','内勤','日勤','夜勤'],
		kanji:['外勤','勤続','勤勉','勤務','勤労','欠勤','勤行','在勤','出勤','常勤','精勤','忠勤','通勤','転勤','内勤','日勤','夜勤'],
		answer:['がいきん','きんぞく','きんべん','きんむ','きんろう','けっきん','ごんぎょう','ざいきん','しゅっきん','じょうきん','せいきん','ちゅうきん','つうきん','てんきん','ないきん','にっきん','やきん']
	},
	{
		pronunciation:[['キン'],['すじ']],
		question:['大筋','筋骨','筋肉','筋力','首筋','心筋','筋書','筋道','筋悪','背筋','血筋','鉄筋','中筋','背筋','一筋','腹筋','本筋','道筋'],
		kanji:['大筋','筋骨','筋肉','筋力','首筋','心筋','筋書','筋道','筋悪','背筋','血筋','鉄筋','中筋','背筋','一筋','腹筋','本筋','道筋'],
		answer:['おおすじ','きんこつ','きんにく','きんりょく','くびすじ','しんきん','すじがき','すじみち','すじわる','せすじ','ちすじ','てっきん','なかすじ','はいきん','ひとすじ','ふっきん','ほんすじ','みちすじ']
	},
	{
		pronunciation:[['ケイ'],['']],
		question:['家系','系図','系統','系列','体系','直系','同系','日系','文系','理系'],
		kanji:['家系','系図','系統','系列','体系','直系','同系','日系','文系','理系'],
		answer:['かけい','けいず','けいとう','けいれつ','たいけい','ちょっけい','どうけい','にっけい','ぶんけい','りけい']
	},
	{
		pronunciation:[['ケイ'],['うやまう']],
		question:['愛敬','敬愛','敬意','敬遠','敬具','敬語','敬服','敬礼','敬老','失敬','失敬','尊敬','表敬'],
		kanji:['愛敬','敬愛','敬意','敬遠','敬具','敬語','敬服','敬礼','敬老','失敬','失敬','尊敬','表敬'],
		answer:['あいきょう','けいあい','けいい','けいえん','けいぐ','けいご','けいふく','けいれい','けいろう','しっけい','しっけい','そんけい','ひょうけい']
	},
	{
		pronunciation:[['ケイ'],['']],
		question:['警官','警告','警護','警察','警視','警笛','警備','警部','警報','県警','婦警','夜警'],
		kanji:['警官','警告','警護','警察','警視','警笛','警備','警部','警報','県警','婦警','夜警'],
		answer:['けいかん','けいこく','けいご','けいさつ','けいし','けいてき','けいび','けいぶ','けいほう','けんけい','ふけい','やけい']
	},
	{
		pronunciation:[['ゲキ'],['']],
		question:['演劇','歌劇','観劇','楽劇','喜劇','京劇','劇画','劇場','劇団','劇的','劇薬','寸劇','悲劇'],
		kanji:['演劇','歌劇','観劇','楽劇','喜劇','京劇','劇画','劇場','劇団','劇的','劇薬','寸劇','悲劇'],
		answer:['えんげき','かげき','かんげき','がくげき','きげき','きょうげき','げきが','げきじょう','げきだん','げきてき','げきやく','すんげき','ひげき']
	},
	{
		pronunciation:[['ゲキ'],['はげしい']],
		question:['過激','感激','急激','激化','激減','激賛','激暑','激職','激情','激戦','激増','激痛','激動','激発','激変','激務','激流','激論'],
		kanji:['過激','感激','急激','激化','激減','激賛','激暑','激職','激情','激戦','激増','激痛','激動','激発','激変','激務','激流','激論'],
		answer:['かげき','かんげき','きゅうげき','げきか','げきげん','げきさん','げきしょ','げきしょく','げきじょう','げきせん','げきぞう','げきつう','げきどう','げきはつ','げきへん','げきむ','げきりゅう','げきろん']
	},
	{
		pronunciation:[['ケツ'],['あな']],
		question:['墓穴'],
		kanji:['墓穴'],
		answer:['ぼけつ']
	},
	{
		pronunciation:[['ケン'],['']],
		question:['金券','券種','証券','食券','発券','半券','馬券','旅券'],
		kanji:['金券','券種','証券','食券','発券','半券','馬券','旅券'],
		answer:['きんけん','けんしゅ','しょうけん','しょっけん','はっけん','はんけん','ばけん','りょけん']
	},
	{
		pronunciation:[['ケン'],['きぬ']],
		question:['絹糸','絹布'],
		kanji:['絹糸','絹布'],
		answer:['きぬいと','けんぷ']
	},
	{
		pronunciation:[['ケン','ゴン'],['']],
		question:['強権','金権','権限','権勢','権能','権利','権力','国権','権化','三権','質権','失権','集権','主権','職権','親権','実権','人権','政権','全権','特権','版権','復権','民権','利権'],
		kanji:['強権','金権','権限','権勢','権能','権利','権力','国権','権化','三権','質権','失権','集権','主権','職権','親権','実権','人権','政権','全権','特権','版権','復権','民権','利権'],
		answer:['きょうけん','きんけん','けんげん','けんせい','けんのう','けんり','けんりょく','こっけん','ごんげ','さんけん','しちけん','しっけん','しゅうけん','しゅけん','しょっけん','しんけん','じっけん','じんけん','せいけん','ぜんけん','とっけん','はんけん','ふっけん','みんけん','りけん']
	},
	{
		pronunciation:[['ケン'],['']],
		question:['改憲','憲章','憲兵','憲法','護憲','立憲'],
		kanji:['改憲','憲章','憲兵','憲法','護憲','立憲'],
		answer:['かいけん','けんしょう','けんぺい','けんぽう','ごけん','りっけん']
	},
	{
		pronunciation:[['ゲン'],['みなもと']],
		question:['起源','源氏','源泉','源流','光源','根源','語源','財源','資源','水源','税源','電源'],
		kanji:['起源','源氏','源泉','源流','光源','根源','語源','財源','資源','水源','税源','電源'],
		answer:['きげん','げんじ','げんせん','げんりゅう','こうげん','こんげん','ごげん','ざいげん','しげん','すいげん','ぜいげん','でんげん']
	},
	{
		pronunciation:[['ゲン','ゴン'],['きびしい','おごそか']],
		question:['厳格','厳寒','厳禁','厳守','厳重','厳正','厳選','厳然','厳達','厳冬','厳秘','厳父','厳密','厳命','尊厳'],
		kanji:['厳格','厳寒','厳禁','厳守','厳重','厳正','厳選','厳然','厳達','厳冬','厳秘','厳父','厳密','厳命','尊厳'],
		answer:['げんかく','げんかん','げんきん','げんしゅ','げんじゅう','げんせい','げんせん','げんぜん','げんたつ','げんとう','げんぴ','げんぷ','げんみつ','げんめい','そんげん']
	},
	{
		pronunciation:[['コ','キ'],['おのれ']],
		question:['自己','知己','利己'],
		kanji:['自己','知己','利己'],
		answer:['じこ','ちき','りこ']
	},
	{
		pronunciation:[['コ'],['よぶ']],
		question:['呼応','呼気','呼吸','点呼','呼出','連呼'],
		kanji:['呼応','呼気','呼吸','点呼','呼出','連呼'],
		answer:['こおう','こき','こきゅう','てんこ','よびだし','れんこ']
	},
	{
		pronunciation:[['ゴ'],['あやまる']],
		question:['誤解','誤記','誤差','誤射','誤植','誤信','誤字','誤想','誤認','誤聞','誤報','誤訳','誤用','正誤'],
		kanji:['誤解','誤記','誤差','誤射','誤植','誤信','誤字','誤想','誤認','誤聞','誤報','誤訳','誤用','正誤'],
		answer:['ごかい','ごき','ごさ','ごしゃ','ごしょく','ごしん','ごじ','ごそう','ごにん','ごぶん','ごほう','ごやく','ごよう','せいご']
	},
	{
		pronunciation:[['コウ'],['']],
		question:['皇后','午后'],
		kanji:['皇后','午后'],
		answer:['こうごう','ごご']
	},
	{
		pronunciation:[['コウ'],['']],
		question:['孝行','孝行','不孝'],
		kanji:['孝行','孝行','不孝'],
		answer:['こうこう','こうこう','ふこう']
	},
	{
		pronunciation:[['コウ','オウ'],['']],
		question:['皇居','皇宮','皇后','皇子','皇室','皇族','上皇','天皇','法皇'],
		kanji:['皇居','皇宮','皇后','皇子','皇室','皇族','上皇','天皇','法皇'],
		answer:['こうきょ','こうぐう','こうごう','こうし','こうしつ','こうぞく','じょうこう','てんのう','ほうおう']
	},
	{
		pronunciation:[['コウ','ク'],['べに','くれない']],
		question:['口紅','紅顔','紅茶','紅潮','紅白','紅梅','紅葉','真紅','紅葉'],
		kanji:['口紅','紅顔','紅茶','紅潮','紅白','紅梅','紅葉','真紅','紅葉'],
		answer:['くちべに','こうがん','こうちゃ','こうちょう','こうはく','こうばい','こうよう','しんく','もみじ']
	},
	{
		pronunciation:[['コウ'],['おりる','おろす','ふる']],
		question:['以降','下降','降雨','降下','降格','降参','降車','降水','降雪','降誕','降着','降臨','乗降','投降','来降'],
		kanji:['以降','下降','降雨','降下','降格','降参','降車','降水','降雪','降誕','降着','降臨','乗降','投降','来降'],
		answer:['いこう','かこう','こうう','こうか','こうかく','こうさん','こうしゃ','こうすい','こうせつ','こうたん','こうちゃく','こうりん','じょうこう','とうこう','らいごう']
	},
	{
		pronunciation:[['コウ'],['はがね']],
		question:['鋼管','鋼材','鋼鉄','精鋼','製鋼','鉄鋼'],
		kanji:['鋼管','鋼材','鋼鉄','精鋼','製鋼','鉄鋼'],
		answer:['こうかん','こうざい','こうてつ','せいこう','せいこう','てっこう']
	},
	{
		pronunciation:[['コク'],['きざむ']],
		question:['一刻','印刻','刻印','深刻','時刻','先刻','定刻','復刻','夕刻'],
		kanji:['一刻','印刻','刻印','深刻','時刻','先刻','定刻','復刻','夕刻'],
		answer:['いっこく','いんこく','こくいん','しんこく','じこく','せんこく','ていこく','ふっこく','ゆうこく']
	},
	{
		pronunciation:[['コク'],['']],
		question:['穀雨','穀物','穀類','五穀'],
		kanji:['穀雨','穀物','穀類','五穀'],
		answer:['こくう','こくもつ','こくるい','ごこく']
	},
	{
		pronunciation:[['コツ'],['ほね']],
		question:['遺骨','気骨','気骨','胸骨','筋骨','骨格','骨子','骨折','骨頂','骨片','骨肉','散骨','人骨','整骨','接骨','背骨','鉄骨','納骨','白骨','武骨','分骨','骨折','骨太','骨身'],
		kanji:['遺骨','気骨','気骨','胸骨','筋骨','骨格','骨子','骨折','骨頂','骨片','骨肉','散骨','人骨','整骨','接骨','背骨','鉄骨','納骨','白骨','武骨','分骨','骨折','骨太','骨身'],
		answer:['いこつ','きこつ','きぼね','きょうこつ','きんこつ','こっかく','こっし','こっせつ','こっちょう','こっぺん','こつにく','さんこつ','じんこつ','せいこつ','せっこつ','せぼね','てっこつ','のうこつ','はっこつ','ぶこつ','ぶんこつ','ほねお','ほねぶと','ほねみ']
	},
	{
		pronunciation:[['コン'],['こまる']],
		question:['困苦','困難','貧困'],
		kanji:['困苦','困難','貧困'],
		answer:['こんく','こんなん','ひんこん']
	},
	{
		pronunciation:[['サ','シャ'],['すな']],
		question:['黄砂','砂糖','砂防','砂利','砂川','砂地','砂場','砂山','高砂','土砂'],
		kanji:['黄砂','砂糖','砂防','砂利','砂川','砂地','砂場','砂山','高砂','土砂'],
		answer:['こうさ','さとう','さぼう','じゃり','すながわ','すなじ','すなば','すなやま','たかさご','どしゃ']
	},
	{
		pronunciation:[['ザ'],['すわる']],
		question:['居座','王座','上座','玉座','銀座','口座','講座','座高','座席','座像','座談','座長','座標','座薬','座右','下座','星座','正座','対座','中座','当座','連座'],
		kanji:['居座','王座','上座','玉座','銀座','口座','講座','座高','座席','座像','座談','座長','座標','座薬','座右','下座','星座','正座','対座','中座','当座','連座'],
		answer:['いすわ','おうざ','かみざ','ぎょくざ','ぎんざ','こうざ','こうざ','ざこう','ざせき','ざぞう','ざだん','ざちょう','ざひょう','ざやく','ざゆう','しもざ','せいざ','せいざ','たいざ','ちゅうざ','とうざ','れんざ']
	},
	{
		pronunciation:[['サイ'],['すむ','すます']],
		question:['完済','救済','共済','経済','決済','返済','弁済','未済'],
		kanji:['完済','救済','共済','経済','決済','返済','弁済','未済'],
		answer:['かんさい','きゅうさい','きょうさい','けいざい','けっさい','へんさい','べんさい','みさい']
	},
	{
		pronunciation:[['サイ'],['さばく','たつ']],
		question:['家裁','簡裁','決裁','高裁','裁可','裁決','裁断','裁定','裁判','裁量','制裁','総裁','断裁','地裁','仲裁','体裁','独裁','洋裁','和裁'],
		kanji:['家裁','簡裁','決裁','高裁','裁可','裁決','裁断','裁定','裁判','裁量','制裁','総裁','断裁','地裁','仲裁','体裁','独裁','洋裁','和裁'],
		answer:['かさい','かんさい','けっさい','こうさい','さいか','さいけつ','さいだん','さいてい','さいばん','さいりょう','せいさい','そうさい','だんさい','ちさい','ちゅうさい','ていさい','どくさい','ようさい','わさい']
	},
	{
		pronunciation:[['サク'],['']],
		question:['画策','金策','国策','策士','策定','策動','策略','散策','失策','政策','対策','得策','方策','良策'],
		kanji:['画策','金策','国策','策士','策定','策動','策略','散策','失策','政策','対策','得策','方策','良策'],
		answer:['かくさく','きんさく','こくさく','さくし','さくてい','さくどう','さくりゃく','さんさく','しっさく','せいさく','たいさく','とくさく','ほうさく','りょうさく']
	},
	{
		pronunciation:[['サツ','サク'],['']],
		question:['冊子','冊数','短冊','分冊','別冊'],
		kanji:['冊子','冊数','短冊','分冊','別冊'],
		answer:['さっし','さっすう','たんざく','ぶんさつ','べっさつ']
	},
	{
		pronunciation:[['サン'],['かいこ']],
		question:['蚕糸','蚕食','養蚕'],
		kanji:['蚕糸','蚕食','養蚕'],
		answer:['さんし','さんしょく','ようさん']
	},
	{
		pronunciation:[['シ'],['いたる']],
		question:['夏至','至急','至急','至近','至言','至高','至極','至上','至適','至難','至福','至便','至宝','冬至','必至'],
		kanji:['夏至','至急','至急','至近','至言','至高','至極','至上','至適','至難','至福','至便','至宝','冬至','必至'],
		answer:['げし','しきゅう','しきゅう','しきん','しげん','しこう','しごく','しじょう','してき','しなん','しふく','しべん','しほう','とうじ','ひっし']
	},
	{
		pronunciation:[['シ'],['わたくし','わたし']],
		question:['公私','私案','私意','私営','私益','私学','私見','私語','私財','私信','私心','私事','私情','私製','私設','私大','私的','私鉄','私道','私服','私腹','私物','私有','私用','私欲','私利','私立','私論','私事','私達','私立','私達','私供'],
		kanji:['公私','私案','私意','私営','私益','私学','私見','私語','私財','私信','私心','私事','私情','私製','私設','私大','私的','私鉄','私道','私服','私腹','私物','私有','私用','私欲','私利','私立','私論','私事','私達','私立','私達','私供'],
		answer:['こうし','しあん','しい','しえい','しえき','しがく','しけん','しご','しざい','ししん','ししん','しじ','しじょう','しせい','しせつ','しだい','してき','してつ','しどう','しふく','しふく','しぶつ','しゆう','しよう','しよく','しり','しりつ','しろん','わたくしごと','わたくしたち','わたくしりつ','わたしたち','わたしども']
	},
	{
		pronunciation:[['シ'],['すがた']],
		question:['姿勢','姿態','容姿'],
		kanji:['姿勢','姿態','容姿'],
		answer:['しせい','したい','ようし']
	},
	{
		pronunciation:[['シ'],['']],
		question:['暗視','遠視','可視','近視','警視','軽視','検視','視界','視覚','視察','視線','視程','視点','視認','視野','視力','実視','弱視','重視','正視','側視','注視','直視','敵視','無視','目視','乱視'],
		kanji:['暗視','遠視','可視','近視','警視','軽視','検視','視界','視覚','視察','視線','視程','視点','視認','視野','視力','実視','弱視','重視','正視','側視','注視','直視','敵視','無視','目視','乱視'],
		answer:['あんし','えんし','かし','きんし','けいし','けいし','けんし','しかい','しかく','しさつ','しせん','してい','してん','しにん','しや','しりょく','じっし','じゃくし','じゅうし','せいし','そくし','ちゅうし','ちょくし','てきし','むし','もくし','らんし']
	},
	{
		pronunciation:[['シ'],['']],
		question:['歌詞','作詞','助詞','数詞','台詞','動詞','祝詞','品詞','副詞','分詞','名詞'],
		kanji:['歌詞','作詞','助詞','数詞','台詞','動詞','祝詞','品詞','副詞','分詞','名詞'],
		answer:['かし','さくし','じょし','すうし','せりふ','どうし','のりと','ひんし','ふくし','ぶんし','めいし']
	},
	{
		pronunciation:[['シ'],['']],
		question:['会誌','貴誌','雑誌','誌上','誌面','他誌','日誌','本誌'],
		kanji:['会誌','貴誌','雑誌','誌上','誌面','他誌','日誌','本誌'],
		answer:['かいし','きし','ざっし','しじょう','しめん','たし','にっし','ほんし']
	},
	{
		pronunciation:[['ジ'],['']],
		question:['磁器','磁気','磁極','磁石','磁針','磁力','青磁','電磁','白磁','防磁'],
		kanji:['磁器','磁気','磁極','磁石','磁針','磁力','青磁','電磁','白磁','防磁'],
		answer:['じき','じき','じきょく','じしゃく','じしん','じりょく','せいじ','でんじ','はくじ','ぼうじ']
	},
	{
		pronunciation:[['シャ'],['いる']],
		question:['射手','誤射','試射','射殺','射出','射精','射程','射的','照射','注射','直射','投射','日射','発射','反射','日射','陽射','放射','乱射','連射'],
		kanji:['射手','誤射','試射','射殺','射出','射精','射程','射的','照射','注射','直射','投射','日射','発射','反射','日射','陽射','放射','乱射','連射'],
		answer:['いて','ごしゃ','ししゃ','しゃさつ','しゃしゅつ','しゃせい','しゃてい','しゃてき','しょうしゃ','ちゅうしゃ','ちょくしゃ','とうしゃ','にっしゃ','はっしゃ','はんしゃ','ひざし','ひざし','ほうしゃ','らんしゃ','れんしゃ']
	},
	{
		pronunciation:[['シャ'],['すてる']],
		question:['捨象','取捨'],
		kanji:['捨象','取捨'],
		answer:['しゃしょう','しゅしゃ']
	},
	{
		pronunciation:[['シャク'],['']],
		question:['曲尺','尺度','尺八','縮尺','同尺','巻尺','間尺'],
		kanji:['曲尺','尺度','尺八','縮尺','同尺','巻尺','間尺'],
		answer:['かねじゃく','しゃくど','しゃくはち','しゅくしゃく','どうしゃく','まきじゃく','ましゃく']
	},
	{
		pronunciation:[['ジャク','ニャク'],['わかい']],
		question:['自若','若年','若干','老若','若返','若草','若手','若葉','若松','若布','若者','若人'],
		kanji:['自若','若年','若干','老若','若返','若草','若手','若葉','若松','若布','若者','若人'],
		answer:['じじゃく','じゃくねん','じゃっかん','ろうにゃく','わかがえ','わかくさ','わかて','わかば','わかまつ','わかめ','わかもの','わこうど']
	},
	{
		pronunciation:[['ジュ'],['']],
		question:['果樹','古樹','植樹','樹海','樹皮','樹氷','樹木','樹立','大樹'],
		kanji:['果樹','古樹','植樹','樹海','樹皮','樹氷','樹木','樹立','大樹'],
		answer:['かじゅ','こじゅ','しょくじゅ','じゅかい','じゅひ','じゅひょう','じゅもく','じゅりつ','たいじゅ']
	},
	{
		pronunciation:[['シュウ'],['おさめる','おさまる']],
		question:['回収','吸収','検収','月収','減収','査収','収益','収支','収拾','収集','収縮','収束','収得','収入','収納','収容','収用','収量','収録','所収','実収','接収','税収','増収','年収','買収','未収','領収'],
		kanji:['回収','吸収','検収','月収','減収','査収','収益','収支','収拾','収集','収縮','収束','収得','収入','収納','収容','収用','収量','収録','所収','実収','接収','税収','増収','年収','買収','未収','領収'],
		answer:['かいしゅう','きゅうしゅう','けんしゅう','げっしゅう','げんしゅう','さしゅう','しゅうえき','しゅうし','しゅうしゅう','しゅうしゅう','しゅうしゅく','しゅうそく','しゅうとく','しゅうにゅう','しゅうのう','しゅうよう','しゅうよう','しゅうりょう','しゅうろく','しょしゅう','じっしゅう','せっしゅう','ぜいしゅう','ぞうしゅう','ねんしゅう','ばいしゅう','みしゅう','りょうしゅう']
	},
	{
		pronunciation:[['シュウ','ソウ'],['']],
		question:['宗教','宗派','宗家'],
		kanji:['宗教','宗派','宗家'],
		answer:['しゅうきょう','しゅうは','そうけ']
	},
	{
		pronunciation:[['シュウ','ジュ'],['つく','つける']],
		question:['去就','就役','就学','就業','就航','就職','就任','就労','成就'],
		kanji:['去就','就役','就学','就業','就航','就職','就任','就労','成就'],
		answer:['きょしゅう','しゅうえき','しゅうがく','しゅうぎょう','しゅうこう','しゅうしょく','しゅうにん','しゅうろう','じょうじゅ']
	},
	{
		pronunciation:[['シュウ','シュ'],['']],
		question:['観衆','群衆','公衆','衆院','衆参','衆人','衆望','衆目','衆生','大衆','民衆'],
		kanji:['観衆','群衆','公衆','衆院','衆参','衆人','衆望','衆目','衆生','大衆','民衆'],
		answer:['かんしゅう','ぐんしゅう','こうしゅう','しゅういん','しゅうさん','しゅうじん','しゅうぼう','しゅうもく','しゅじょう','たいしゅう','みんしゅう']
	},
	{
		pronunciation:[['ジュウ','ショウ','ジュ'],['したがう','したがえる']],
		question:['主従','従事','従順','従前','従属','従来','専従','追従','追従','服従'],
		kanji:['主従','従事','従順','従前','従属','従来','専従','追従','追従','服従'],
		answer:['しゅじゅう','じゅうじ','じゅうじゅん','じゅうぜん','じゅうぞく','じゅうらい','せんじゅう','ついしょう','ついじゅう','ふくじゅう']
	},
	{
		pronunciation:[['ジュウ'],['たて']],
		question:['縦横','縦走','縦断','縦覧','縦列','操縦','縦長','放縦'],
		kanji:['縦横','縦走','縦断','縦覧','縦列','操縦','縦長','放縦'],
		answer:['じゅうおう','じゅうそう','じゅうだん','じゅうらん','じゅうれつ','そうじゅう','たてなが','ほうじゅう']
	},
	{
		pronunciation:[['シュク'],['ちぢむ','ちぢまる','ちぢめる','ちぢれる']],
		question:['圧縮','軍縮','収縮','縮刷','縮写','縮尺','縮小','縮図','縮退','縮約','短縮'],
		kanji:['圧縮','軍縮','収縮','縮刷','縮写','縮尺','縮小','縮図','縮退','縮約','短縮'],
		answer:['あっしゅく','ぐんしゅく','しゅうしゅく','しゅくさつ','しゅくしゃ','しゅくしゃく','しゅくしょう','しゅくず','しゅくたい','しゅくやく','たんしゅく']
	},
	{
		pronunciation:[['ジュク'],['うれる']],
		question:['円熟','完熟','習熟','熟考','熟語','熟成','熟達','熟知','熟読','熟年','熟練','成熟','早熟','半熟','晩熟','豊熟','未熟','老熟'],
		kanji:['円熟','完熟','習熟','熟考','熟語','熟成','熟達','熟知','熟読','熟年','熟練','成熟','早熟','半熟','晩熟','豊熟','未熟','老熟'],
		answer:['えんじゅく','かんじゅく','しゅうじゅく','じゅくこう','じゅくご','じゅくせい','じゅくたつ','じゅくち','じゅくどく','じゅくねん','じゅくれん','せいじゅく','そうじゅく','はんじゅく','ばんじゅく','ほうじゅく','みじゅく','ろうじゅく']
	},
	{
		pronunciation:[['ジュン'],['']],
		question:['純愛','純一','純益','純化','純金','純潔','純血','純色','純真','純情','純正','純増','純度','純白','純米','純利','純良','清純','単純','不純'],
		kanji:['純愛','純一','純益','純化','純金','純潔','純血','純色','純真','純情','純正','純増','純度','純白','純米','純利','純良','清純','単純','不純'],
		answer:['じゅんあい','じゅんいつ','じゅんえき','じゅんか','じゅんきん','じゅんけつ','じゅんけつ','じゅんしょく','じゅんしん','じゅんじょう','じゅんせい','じゅんぞう','じゅんど','じゅんぱく','じゅんまい','じゅんり','じゅんりょう','せいじゅん','たんじゅん','ふじゅん']
	},
	{
		pronunciation:[['ショ'],['']],
		question:['在処','出処','処暑','諸処','処女','処世','処置','処分','処方','処理','住処','善処','対処','何処','目処'],
		kanji:['在処','出処','処暑','諸処','処女','処世','処置','処分','処方','処理','住処','善処','対処','何処','目処'],
		answer:['ありか','しゅっしょ','しょしょ','しょしょ','しょじょ','しょせい','しょち','しょぶん','しょほう','しょり','すみか','ぜんしょ','たいしょ','どこ','めど']
	},
	{
		pronunciation:[['ショ'],['']],
		question:['各署','支署','署員','署長','署名','自署','部署','本署','連署'],
		kanji:['各署','支署','署員','署長','署名','自署','部署','本署','連署'],
		answer:['かくしょ','ししょ','しょいん','しょちょう','しょめい','じしょ','ぶしょ','ほんしょ','れんしょ']
	},
	{
		pronunciation:[['ショ'],['']],
		question:['諸悪','諸行','諸口','諸君','諸兄','諸元','諸国','諸氏','諸式','諸処','諸事','諸説','諸税','諸相','諸島','諸表','諸方'],
		kanji:['諸悪','諸行','諸口','諸君','諸兄','諸元','諸国','諸氏','諸式','諸処','諸事','諸説','諸税','諸相','諸島','諸表','諸方'],
		answer:['しょあく','しょぎょう','しょくち','しょくん','しょけい','しょげん','しょこく','しょし','しょしき','しょしょ','しょじ','しょせつ','しょぜい','しょそう','しょとう','しょひょう','しょほう']
	},
	{
		pronunciation:[['ジョ','ジ'],['のぞく']],
		question:['解除','加除','乗除','除外','除去','除光','除算','除算','除雪','除草','除隊','除名','除夜','整除','切除'],
		kanji:['解除','加除','乗除','除外','除去','除光','除算','除算','除雪','除草','除隊','除名','除夜','整除','切除'],
		answer:['かいじょ','かじょ','じょうじょ','じょがい','じょきょ','じょこう','じょさん','じょざん','じょせつ','じょそう','じょたい','じょめい','じょや','せいじょ','せつじょ']
	},
	{
		pronunciation:[['ショウ'],['うけたまわる']],
		question:['承知','伝承'],
		kanji:['承知','伝承'],
		answer:['しょうち','でんしょう']
	},
	{
		pronunciation:[['ショウ'],['']],
		question:['王将','主将','将官','将軍','将校','少将','将兵','将来','大将','中将','副将','武将'],
		kanji:['王将','主将','将官','将軍','将校','少将','将兵','将来','大将','中将','副将','武将'],
		answer:['おうしょう','しゅしょう','しょうかん','しょうぐん','しょうこう','しょうしょう','しょうへい','しょうらい','たいしょう','ちゅうじょう','ふくしょう','ぶしょう']
	},
	{
		pronunciation:[['ショウ'],['きず','いたむ','いためる']],
		question:['打傷','感傷','外傷','傷口','切傷','軽傷','殺傷','死傷','傷害','傷心','傷病','食傷','重傷','損傷','中傷','負傷','無傷','火傷'],
		kanji:['打傷','感傷','外傷','傷口','切傷','軽傷','殺傷','死傷','傷害','傷心','傷病','食傷','重傷','損傷','中傷','負傷','無傷','火傷'],
		answer:['うちきず','かんしょう','がいしょう','きずぐち','きりきず','けいしょう','さっしょう','ししょう','しょうがい','しょうしん','しょうびょう','しょくしょう','じゅうしょう','そんしょう','ちゅうしょう','ふしょう','むきず','やけど']
	},
	{
		pronunciation:[['ショウ'],['さわる']],
		question:['気障','故障','支障','障害','障子','万障','保障'],
		kanji:['気障','故障','支障','障害','障子','万障','保障'],
		answer:['きざ','こしょう','ししょう','しょうがい','しょうじ','ばんしょう','ほしょう']
	},
	{
		pronunciation:[['ジョウ'],['むす','むれる','むらす']],
		question:['酒蒸','蒸気','蒸散','蒸着','蒸発','蒸留'],
		kanji:['酒蒸','蒸気','蒸散','蒸着','蒸発','蒸留'],
		answer:['さかむし','じょうき','じょうさん','じょうちゃく','じょうはつ','じょうりゅう']
	},
	{
		pronunciation:[['シン'],['はり']],
		question:['運針','検針','指針','磁針','短針','長針','長針','針金','秒針','方針','待針'],
		kanji:['運針','検針','指針','磁針','短針','長針','長針','針金','秒針','方針','待針'],
		answer:['うんしん','けんしん','ししん','じしん','たんしん','ちょうしん','ながばり','はりがね','びょうしん','ほうしん','まちばり']
	},
	{
		pronunciation:[['ジン','ニ'],['']],
		question:['仁義','仁王'],
		kanji:['仁義','仁王'],
		answer:['じんぎ','におう']
	},
	{
		pronunciation:[['スイ'],['たれる','たらす']],
		question:['下垂','垂下','垂心','垂線','垂直','虫垂'],
		kanji:['下垂','垂下','垂心','垂線','垂直','虫垂'],
		answer:['かすい','すいか','すいしん','すいせん','すいちょく','ちゅうすい']
	},
	{
		pronunciation:[['スイ'],['おす']],
		question:['推移','推挙','推計','推考','推察','推算','推賞','推進','推測','推定','推理','推量','推力','推論','類推'],
		kanji:['推移','推挙','推計','推考','推察','推算','推賞','推進','推測','推定','推理','推量','推力','推論','類推'],
		answer:['すいい','すいきょ','すいけい','すいこう','すいさつ','すいさん','すいしょう','すいしん','すいそく','すいてい','すいり','すいりょう','すいりょく','すいろん','るいすい']
	},
	{
		pronunciation:[['スン'],['']],
		question:['原寸','採寸','寸劇','寸志','寸時','寸前','寸断','寸鉄','寸評','寸分','寸法','寸話'],
		kanji:['原寸','採寸','寸劇','寸志','寸時','寸前','寸断','寸鉄','寸評','寸分','寸法','寸話'],
		answer:['げんすん','さいすん','すんげき','すんし','すんじ','すんぜん','すんだん','すんてつ','すんぴょう','すんぶん','すんぽう','すんわ']
	},
	{
		pronunciation:[['セイ','ジョウ'],['もる','さかる','さかん']],
		question:['盛運','盛夏','盛会','盛挙','盛業','盛装','盛大','盛典','全盛','目盛'],
		kanji:['盛運','盛夏','盛会','盛挙','盛業','盛装','盛大','盛典','全盛','目盛'],
		answer:['せいうん','せいか','せいかい','せいきょ','せいぎょう','せいそう','せいだい','せいてん','ぜんせい','めもり']
	},
	{
		pronunciation:[['セイ'],['']],
		question:['神聖','聖歌','聖火','聖書','聖職','聖者','聖水','聖地','聖典','聖堂'],
		kanji:['神聖','聖歌','聖火','聖書','聖職','聖者','聖水','聖地','聖典','聖堂'],
		answer:['しんせい','せいか','せいか','せいしょ','せいしょく','せいじゃ','せいすい','せいち','せいてん','せいどう']
	},
	{
		pronunciation:[['セイ'],['まこと']],
		question:['誠意','誠心','誠実','忠誠'],
		kanji:['誠意','誠心','誠実','忠誠'],
		answer:['せいい','せいしん','せいじつ','ちゅうせい']
	},
	{
		pronunciation:[['ゼツ'],['した']],
		question:['筆舌','百舌'],
		kanji:['筆舌','百舌'],
		answer:['ひつぜつ','もず']
	},
	{
		pronunciation:[['セン'],['']],
		question:['宣言','宣告','宣戦','宣伝'],
		kanji:['宣言','宣告','宣戦','宣伝'],
		answer:['せんげん','せんこく','せんせん','せんでん']
	},
	{
		pronunciation:[['セン'],['もっぱら']],
		question:['高専','専横','専科','専業','専守','専修','専心','専従','専属','専任','専念','専売','専務','専門','専有','専用'],
		kanji:['高専','専横','専科','専業','専守','専修','専心','専従','専属','専任','専念','専売','専務','専門','専有','専用'],
		answer:['こうせん','せんおう','せんか','せんぎょう','せんしゅ','せんしゅう','せんしん','せんじゅう','せんぞく','せんにん','せんねん','せんばい','せんむ','せんもん','せんゆう','せんよう']
	},
	{
		pronunciation:[['セン'],['いずみ']],
		question:['源泉','鉱泉','名泉'],
		kanji:['源泉','鉱泉','名泉'],
		answer:['げんせん','こうせん','めいせん']
	},
	{
		pronunciation:[['セン'],['あらう']],
		question:['水洗','洗顔','洗脳','洗面','洗礼','洗練'],
		kanji:['水洗','洗顔','洗脳','洗面','洗礼','洗練'],
		answer:['すいせん','せんがん','せんのう','せんめん','せんれい','せんれん']
	},
	{
		pronunciation:[['セン'],['そめる','そまる','しみる','しみ']],
		question:['感染','京染','染織','染色','染料','染物','伝染'],
		kanji:['感染','京染','染織','染色','染料','染物','伝染'],
		answer:['かんせん','きょうぞめ','せんしょく','せんしょく','せんりょう','そめもの','でんせん']
	},
	{
		pronunciation:[['セン'],['ぜに']],
		question:['悪銭','金銭','古銭','小銭','銭湯','日銭','無銭'],
		kanji:['悪銭','金銭','古銭','小銭','銭湯','日銭','無銭'],
		answer:['あくせん','きんせん','こせん','こぜに','せんとう','ひぜに','むせん']
	},
	{
		pronunciation:[['ゼン'],['よい']],
		question:['改善','最善','親善','次善','善悪','善意','善行','善処','善玉','善導','善人','善用','善良'],
		kanji:['改善','最善','親善','次善','善悪','善意','善行','善処','善玉','善導','善人','善用','善良'],
		answer:['かいぜん','さいぜん','しんぜん','じぜん','ぜんあく','ぜんい','ぜんこう','ぜんしょ','ぜんだま','ぜんどう','ぜんにん','ぜんよう','ぜんりょう']
	},
	{
		pronunciation:[['ソウ'],['かなでる']],
		question:['演奏','合奏','重奏','前奏','奏者','通奏','独奏','変奏'],
		kanji:['演奏','合奏','重奏','前奏','奏者','通奏','独奏','変奏'],
		answer:['えんそう','がっそう','じゅうそう','ぜんそう','そうしゃ','つうそう','どくそう','へんそう']
	},
	{
		pronunciation:[['ソウ'],['まど']],
		question:['学窓','車窓','深窓','同窓','窓側','窓際','窓口','窓辺'],
		kanji:['学窓','車窓','深窓','同窓','窓側','窓際','窓口','窓辺'],
		answer:['がくそう','しゃそう','しんそう','どうそう','まどがわ','まどぎわ','まどぐち','まどべ']
	},
	{
		pronunciation:[['ソウ'],['つくる']],
		question:['創意','創刊','創業','創元','創作','創始','創製','創設','創造','創立','独創'],
		kanji:['創意','創刊','創業','創元','創作','創始','創製','創設','創造','創立','独創'],
		answer:['そうい','そうかん','そうぎょう','そうげん','そうさく','そうし','そうせい','そうせつ','そうぞう','そうりつ','どくそう']
	},
	{
		pronunciation:[['ソウ','ショウ'],['よそおう']],
		question:['衣装','改装','仮装','軽装','装束','実装','女装','正装','盛装','装身','装置','装着','装丁','装備','装用','内装','服装','武装','変装','包装','略装'],
		kanji:['衣装','改装','仮装','軽装','装束','実装','女装','正装','盛装','装身','装置','装着','装丁','装備','装用','内装','服装','武装','変装','包装','略装'],
		answer:['いしょう','かいそう','かそう','けいそう','しょうぞく','じっそう','じょそう','せいそう','せいそう','そうしん','そうち','そうちゃく','そうてい','そうび','そうよう','ないそう','ふくそう','ぶそう','へんそう','ほうそう','りゃくそう']
	},
	{
		pronunciation:[['ソウ'],['']],
		question:['一層','階層','各層','下層','外層','高層','深層','上層','層間','大層','断層','地層','内層','表層'],
		kanji:['一層','階層','各層','下層','外層','高層','深層','上層','層間','大層','断層','地層','内層','表層'],
		answer:['いっそう','かいそう','かくそう','かそう','がいそう','こうそう','しんそう','じょうそう','そうかん','たいそう','だんそう','ちそう','ないそう','ひょうそう']
	},
	{
		pronunciation:[['ソウ'],['あやつる']],
		question:['情操','節操','操業','操行','操作','操車','操縦','体操'],
		kanji:['情操','節操','操業','操行','操作','操車','操縦','体操'],
		answer:['じょうそう','せっそう','そうぎょう','そうこう','そうさ','そうしゃ','そうじゅう','たいそう']
	},
	{
		pronunciation:[['ゾウ'],['くら']],
		question:['大蔵','家蔵','死蔵','所蔵','地蔵','蔵書','蔵相','退蔵','貯蔵','土蔵','内蔵','秘蔵','武蔵','冷蔵'],
		kanji:['大蔵','家蔵','死蔵','所蔵','地蔵','蔵書','蔵相','退蔵','貯蔵','土蔵','内蔵','秘蔵','武蔵','冷蔵'],
		answer:['おおくら','かぞう','しぞう','しょぞう','じぞう','ぞうしょ','ぞうしょう','たいぞう','ちょぞう','どぞう','ないぞう','ひぞう','むさし','れいぞう']
	},
	{
		pronunciation:[['ゾウ'],['']],
		question:['心臓','臓器','内臓'],
		kanji:['心臓','臓器','内臓'],
		answer:['しんぞう','ぞうき','ないぞう']
	},
	{
		pronunciation:[['ソン','ゾン'],['']],
		question:['異存','一存','温存','共存','共存','現存','現存','残存','残存','所存','自存','実存','生存','存在','存続','存置','存亡','存立','存外','存分','存命','保存'],
		kanji:['異存','一存','温存','共存','共存','現存','現存','残存','残存','所存','自存','実存','生存','存在','存続','存置','存亡','存立','存外','存分','存命','保存'],
		answer:['いぞん','いちぞん','おんぞん','きょうそん','きょうぞん','げんそん','げんぞん','ざんそん','ざんぞん','しょぞん','じそん','じつぞん','せいぞん','そんざい','そんぞく','そんち','そんぼう','そんりつ','ぞんがい','ぞんぶん','ぞんめい','ほぞん']
	},
	{
		pronunciation:[['ソン'],['たっとい','とうとい','たっとぶ','とうとぶ']],
		question:['自尊','尊敬','尊厳','尊属','尊大','尊重','不尊','本尊'],
		kanji:['自尊','尊敬','尊厳','尊属','尊大','尊重','不尊','本尊'],
		answer:['じそん','そんけい','そんげん','そんぞく','そんだい','そんちょう','ふそん','ほんぞん']
	},
	{
		pronunciation:[['タイ'],['しりぞく','しりぞける']],
		question:['引退','減退','後退','進退','辞退','早退','退位','退院','退役','退化','退会','退官','退学','退去','退行','退散','退社','退出','退職','退治','退場','退席','退団','退任','退歩','中退','敗退'],
		kanji:['引退','減退','後退','進退','辞退','早退','退位','退院','退役','退化','退会','退官','退学','退去','退行','退散','退社','退出','退職','退治','退場','退席','退団','退任','退歩','中退','敗退'],
		answer:['いんたい','げんたい','こうたい','しんたい','じたい','そうたい','たいい','たいいん','たいえき','たいか','たいかい','たいかん','たいがく','たいきょ','たいこう','たいさん','たいしゃ','たいしゅつ','たいしょく','たいじ','たいじょう','たいせき','たいだん','たいにん','たいほ','ちゅうたい','はいたい']
	},
	{
		pronunciation:[['タク'],['']],
		question:['家宅','帰宅','居宅','在宅','社宅','自宅','住宅','宅地','宅配','別宅','本宅','来宅'],
		kanji:['家宅','帰宅','居宅','在宅','社宅','自宅','住宅','宅地','宅配','別宅','本宅','来宅'],
		answer:['かたく','きたく','きょたく','ざいたく','しゃたく','じたく','じゅうたく','たくち','たくはい','べったく','ほんたく','らいたく']
	},
	{
		pronunciation:[['タン'],['かつぐ','になう']],
		question:['加担','荷担','担当','担任','担保','負担','分担'],
		kanji:['加担','荷担','担当','担任','担保','負担','分担'],
		answer:['かたん','かたん','たんとう','たんにん','たんぽ','ふたん','ぶんたん']
	},
	{
		pronunciation:[['タン'],['さがす','さぐる']],
		question:['探求','探究','探検','探険','探査','探勝','探知','探訪'],
		kanji:['探求','探究','探検','探険','探査','探勝','探知','探訪'],
		answer:['たんきゅう','たんきゅう','たんけん','たんけん','たんさ','たんしょう','たんち','たんぼう']
	},
	{
		pronunciation:[['タン'],['']],
		question:['降誕','誕生'],
		kanji:['降誕','誕生'],
		answer:['こうたん','たんじょう']
	},
	{
		pronunciation:[['ダン'],['']],
		question:['一段','階段','格段','下段','後段','算段','手段','初段','次段','上段','段階','段差','段落','値段','別段'],
		kanji:['一段','階段','格段','下段','後段','算段','手段','初段','次段','上段','段階','段差','段落','値段','別段'],
		answer:['いちだん','かいだん','かくだん','げだん','こうだん','さんだん','しゅだん','しょだん','じだん','じょうだん','だんかい','だんさ','だんらく','ねだん','べつだん']
	},
	{
		pronunciation:[['ダン'],['あたたか','あたたかい','あたたまる','あたためる']],
		question:['温暖','寒暖','春暖','暖気','暖冬','暖流'],
		kanji:['温暖','寒暖','春暖','暖気','暖冬','暖流'],
		answer:['おんだん','かんだん','しゅんだん','だんき','だんとう','だんりゅう']
	},
	{
		pronunciation:[['チ'],['ね','あたい']],
		question:['売値','買値','価値','下値','数値','底値','高値','多値','同値','中値','値切','値段','値札','半値','元値','安値'],
		kanji:['売値','買値','価値','下値','数値','底値','高値','多値','同値','中値','値切','値段','値札','半値','元値','安値'],
		answer:['うりね','かいね','かち','したね','すうち','そこね','たかね','たち','どうち','なかね','ねぎ','ねだん','ねふだ','はんね','もとね','やすね']
	},
	{
		pronunciation:[['チュウ'],['']],
		question:['宇宙'],
		kanji:['宇宙'],
		answer:['うちゅう']
	},
	{
		pronunciation:[['チュウ'],['']],
		question:['忠勤','忠義','忠告','忠臣','忠実','忠誠'],
		kanji:['忠勤','忠義','忠告','忠臣','忠実','忠誠'],
		answer:['ちゅうきん','ちゅうぎ','ちゅうこく','ちゅうしん','ちゅうじつ','ちゅうせい']
	},
	{
		pronunciation:[['チョ'],['あらわす','いちじるしい']],
		question:['遺著','共著','近著','原著','小著','前著','大著','著作','著者','著書','著述','著名','著明','名著'],
		kanji:['遺著','共著','近著','原著','小著','前著','大著','著作','著者','著書','著述','著名','著明','名著'],
		answer:['いちょ','きょうちょ','きんちょ','げんちょ','しょうちょ','ぜんちょ','たいちょ','ちょさく','ちょしゃ','ちょしょ','ちょじゅつ','ちょめい','ちょめい','めいちょ']
	},
	{
		pronunciation:[['チョウ'],['']],
		question:['官庁','県庁','支庁','省庁','庁舎','都庁','道庁','府庁','閉庁','本庁'],
		kanji:['官庁','県庁','支庁','省庁','庁舎','都庁','道庁','府庁','閉庁','本庁'],
		answer:['かんちょう','けんちょう','しちょう','しょうちょう','ちょうしゃ','とちょう','どうちょう','ふちょう','へいちょう','ほんちょう']
	},
	{
		pronunciation:[['チョウ'],['いただき','いただく']],
		question:['骨頂','山頂','絶頂','頂上','頂点','天頂','登頂'],
		kanji:['骨頂','山頂','絶頂','頂上','頂点','天頂','登頂'],
		answer:['こっちょう','さんちょう','ぜっちょう','ちょうじょう','ちょうてん','てんちょう','とうちょう']
	},
	{
		pronunciation:[['チョウ'],['']],
		question:['胃腸','小腸','大腸','羊腸'],
		kanji:['胃腸','小腸','大腸','羊腸'],
		answer:['いちょう','しょうちょう','だいちょう','ようちょう']
	},
	{
		pronunciation:[['チョウ'],['しお']],
		question:['赤潮','上潮','干潮','黒潮','紅潮','高潮','思潮','主潮','初潮','高潮','血潮','潮流','潮力','風潮','満潮'],
		kanji:['赤潮','上潮','干潮','黒潮','紅潮','高潮','思潮','主潮','初潮','高潮','血潮','潮流','潮力','風潮','満潮'],
		answer:['あかしお','あげしお','かんちょう','くろしお','こうちょう','こうちょう','しちょう','しゅちょう','しょちょう','たかしお','ちしお','ちょうりゅう','ちょうりょく','ふうちょう','まんちょう']
	},
	{
		pronunciation:[['チン'],['']],
		question:['運賃','貸賃','工賃','賃金','賃借','賃貸','無賃','家賃','労賃'],
		kanji:['運賃','貸賃','工賃','賃金','賃借','賃貸','無賃','家賃','労賃'],
		answer:['うんちん','かしちん','こうちん','ちんぎん','ちんしゃく','ちんたい','むちん','やちん','ろうちん']
	},
	{
		pronunciation:[['ツウ'],['いたい','いたむ','いためる']],
		question:['痛手','胃痛','苦痛','激痛','止痛','心痛','頭痛','痛快','痛覚','痛感','痛切','痛点','悲痛','腹痛','無痛'],
		kanji:['痛手','胃痛','苦痛','激痛','止痛','心痛','頭痛','痛快','痛覚','痛感','痛切','痛点','悲痛','腹痛','無痛'],
		answer:['いたで','いつう','くつう','げきつう','しつう','しんつう','ずつう','つうかい','つうかく','つうかん','つうせつ','つうてん','ひつう','ふくつう','むつう']
	},
	{
		pronunciation:[['テキ'],['かたき']],
		question:['外敵','強敵','宿敵','素敵','政敵','大敵','敵意','敵対','敵地','敵機','天敵','不敵','無敵'],
		kanji:['外敵','強敵','宿敵','素敵','政敵','大敵','敵意','敵対','敵地','敵機','天敵','不敵','無敵'],
		answer:['がいてき','きょうてき','しゅくてき','すてき','せいてき','たいてき','てきい','てきたい','てきち','てっき','てんてき','ふてき','むてき']
	},
	{
		pronunciation:[['テン'],['']],
		question:['個展','出展','親展','進展','展開','展示','展性','展望','展覧','発展'],
		kanji:['個展','出展','親展','進展','展開','展示','展性','展望','展覧','発展'],
		answer:['こてん','しゅってん','しんてん','しんてん','てんかい','てんじ','てんせい','てんぼう','てんらん','はってん']
	},
	{
		pronunciation:[['トウ'],['うつ']],
		question:['検討','討議','討論'],
		kanji:['検討','討議','討論'],
		answer:['けんとう','とうぎ','とうろん']
	},
	{
		pronunciation:[['トウ'],['']],
		question:['各党','挙党','結党','新党','政党','党員','党首','党争','党内','党派','徒党','入党','野党'],
		kanji:['各党','挙党','結党','新党','政党','党員','党首','党争','党内','党派','徒党','入党','野党'],
		answer:['かくとう','きょとう','けっとう','しんとう','せいとう','とういん','とうしゅ','とうそう','とうない','とうは','ととう','にゅうとう','やとう']
	},
	{
		pronunciation:[['トウ'],['']],
		question:['加糖','果糖','血糖','砂糖','製糖','糖衣','糖分'],
		kanji:['加糖','果糖','血糖','砂糖','製糖','糖衣','糖分'],
		answer:['かとう','かとう','けっとう','さとう','せいとう','とうい','とうぶん']
	},
	{
		pronunciation:[[''],['とどける','とどく']],
		question:['届出'],
		kanji:['届出'],
		answer:['とどけで']
	},
	{
		pronunciation:[['ナン'],['むずかしい','かたい']],
		question:['有難','海難','苦難','険難','困難','災難','七難','至難','受難','水難','多難','難易','難解','難関','難局','難行','難航','難所','難色','難事','難題','難点','難破','難病','難民','難問','非難','無難','論難'],
		kanji:['有難','海難','苦難','険難','困難','災難','七難','至難','受難','水難','多難','難易','難解','難関','難局','難行','難航','難所','難色','難事','難題','難点','難破','難病','難民','難問','非難','無難','論難'],
		answer:['ありがた','かいなん','くなん','けんなん','こんなん','さいなん','しちなん','しなん','じゅなん','すいなん','たなん','なんい','なんかい','なんかん','なんきょく','なんぎょう','なんこう','なんしょ','なんしょく','なんじ','なんだい','なんてん','なんぱ','なんびょう','なんみん','なんもん','ひなん','ぶなん','ろんなん']
	},
	{
		pronunciation:[['ニュウ'],['ちち','ち']],
		question:['乳母','牛乳','授乳','乳液','乳化','乳業','乳酸','乳歯','乳児','粉乳','母乳'],
		kanji:['乳母','牛乳','授乳','乳液','乳化','乳業','乳酸','乳歯','乳児','粉乳','母乳'],
		answer:['うば','ぎゅうにゅう','じゅにゅう','にゅうえき','にゅうか','にゅうぎょう','にゅうさん','にゅうし','にゅうじ','ふんにゅう','ぼにゅう']
	},
	{
		pronunciation:[['ニン'],['みとめる']],
		question:['確認','公認','誤認','視認','承認','自認','追認','認可','認識','認証','認知','認定','認否','否認','認印','容認'],
		kanji:['確認','公認','誤認','視認','承認','自認','追認','認可','認識','認証','認知','認定','認否','否認','認印','容認'],
		answer:['かくにん','こうにん','ごにん','しにん','しょうにん','じにん','ついにん','にんか','にんしき','にんしょう','にんち','にんてい','にんぴ','ひにん','みとめいん','ようにん']
	},
	{
		pronunciation:[['ノウ','ナッ','ナ','ナン','トウ'],['おさめる','おさまる']],
		question:['格納','完納','帰納','収納','笑納','受納','上納','出納','前納','代納','納豆','納得','納戸','納会','納期','納金','納骨','納車','納税','納入','納品','納付','分納','返納','別納','未納','結納'],
		kanji:['格納','完納','帰納','収納','笑納','受納','上納','出納','前納','代納','納豆','納得','納戸','納会','納期','納金','納骨','納車','納税','納入','納品','納付','分納','返納','別納','未納','結納'],
		answer:['かくのう','かんのう','きのう','しゅうのう','しょうのう','じゅのう','じょうのう','すいとう','ぜんのう','だいのう','なっとう','なっとく','なんど','のうかい','のうき','のうきん','のうこつ','のうしゃ','のうぜい','のうにゅう','のうひん','のうふ','ぶんのう','へんのう','べつのう','みのう','ゆいのう']
	},
	{
		pronunciation:[['ノウ'],['']],
		question:['首脳','頭脳','洗脳','大脳','脳死','脳波','脳裏'],
		kanji:['首脳','頭脳','洗脳','大脳','脳死','脳波','脳裏'],
		answer:['しゅのう','ずのう','せんのう','だいのう','のうし','のうは','のうり']
	},
	{
		pronunciation:[['ハ'],['']],
		question:['一派','右派','各派','急派','左派','宗派','新派','党派','特派','派出','派生','派手','派兵','分派','立派','流派','両派'],
		kanji:['一派','右派','各派','急派','左派','宗派','新派','党派','特派','派出','派生','派手','派兵','分派','立派','流派','両派'],
		answer:['いっぱ','うは','かくは','きゅうは','さは','しゅうは','しんぱ','とうは','とくは','はしゅつ','はせい','はで','はへい','ぶんぱ','りっぱ','りゅうは','りょうは']
	},
	{
		pronunciation:[['ハイ'],['おがむ']],
		question:['参拝','拝観','拝見','拝借','拝復','礼拝'],
		kanji:['参拝','拝観','拝見','拝借','拝復','礼拝'],
		answer:['さんぱい','はいかん','はいけん','はいしゃく','はいふく','らいはい']
	},
	{
		pronunciation:[['ハイ'],['せ','せい','そむく','そむける']],
		question:['紙背','背負','背筋','背中','背広','背骨','背泳','背筋','背景','背後','背信','背任','背任','背反','背面'],
		kanji:['紙背','背負','背筋','背中','背広','背骨','背泳','背筋','背景','背後','背信','背任','背任','背反','背面'],
		answer:['しはい','せお','せすじ','せなか','せびろ','せぼね','はいえい','はいきん','はいけい','はいご','はいしん','はいにん','はいにん','はいはん','はいめん']
	},
	{
		pronunciation:[['ハイ'],['']],
		question:['肺'],
		kanji:['肺'],
		answer:['はい']
	},
	{
		pronunciation:[['ハイ'],['']],
		question:['雑俳','俳句','俳人','俳優'],
		kanji:['雑俳','俳句','俳人','俳優'],
		answer:['ざっぱい','はいく','はいじん','はいゆう']
	},
	{
		pronunciation:[['ハン'],['']],
		question:['首班','班長'],
		kanji:['首班','班長'],
		answer:['しゅはん','はんちょう']
	},
	{
		pronunciation:[['バン'],['']],
		question:['朝晩','今晩','昨晩','早晩','晩夏','晩秋','晩春','晩熟','晩成','晩年','一晩','毎晩','明晩'],
		kanji:['朝晩','今晩','昨晩','早晩','晩夏','晩秋','晩春','晩熟','晩成','晩年','一晩','毎晩','明晩'],
		answer:['あさばん','こんばん','さくばん','そうばん','ばんか','ばんしゅう','ばんしゅん','ばんじゅく','ばんせい','ばんねん','ひとばん','まいばん','みょうばん']
	},
	{
		pronunciation:[['ヒ'],['']],
		question:['安否','否応','可否','合否','採否','賛否','真否','成否','正否','適否','当否','認否','否決','否定','否認','良否'],
		kanji:['安否','否応','可否','合否','採否','賛否','真否','成否','正否','適否','当否','認否','否決','否定','否認','良否'],
		answer:['あんぴ','いやおう','かひ','ごうひ','さいひ','さんぴ','しんぴ','せいひ','せいひ','てきひ','とうひ','にんぴ','ひけつ','ひてい','ひにん','りょうひ']
	},
	{
		pronunciation:[['ヒ'],['']],
		question:['批判','批評'],
		kanji:['批判','批評'],
		answer:['ひはん','ひひょう']
	},
	{
		pronunciation:[['ヒ'],['ひめる']],
		question:['厳秘','極秘','守秘','神秘','秘境','秘技','秘書','秘術','秘蔵','秘中','秘伝','秘湯','秘宝','秘法','秘密','秘話','便秘'],
		kanji:['厳秘','極秘','守秘','神秘','秘境','秘技','秘書','秘術','秘蔵','秘中','秘伝','秘湯','秘宝','秘法','秘密','秘話','便秘'],
		answer:['げんぴ','ごくひ','しゅひ','しんぴ','ひきょう','ひぎ','ひしょ','ひじゅつ','ひぞう','ひちゅう','ひでん','ひとう','ひほう','ひほう','ひみつ','ひわ','べんぴ']
	},
	{
		pronunciation:[['ヒョウ'],['たわら']],
		question:['土俵'],
		kanji:['土俵'],
		answer:['どひょう']
	},
	{
		pronunciation:[['フク'],['はら']],
		question:['裏腹','割腹','空腹','業腹','山腹','私腹','空腹','切腹','中腹','腹黒','腹黒','腹式','腹心','腹痛','腹筋','立腹'],
		kanji:['裏腹','割腹','空腹','業腹','山腹','私腹','空腹','切腹','中腹','腹黒','腹黒','腹式','腹心','腹痛','腹筋','立腹'],
		answer:['うらはら','かっぷく','くうふく','ごうはら','さんぷく','しふく','すきばら','せっぷく','ちゅうふく','はらぐろ','はらぐろ','ふくしき','ふくしん','ふくつう','ふっきん','りっぷく']
	},
	{
		pronunciation:[['フン'],['ふるう']],
		question:['興奮','発奮','奮起','奮然','奮発'],
		kanji:['興奮','発奮','奮起','奮然','奮発'],
		answer:['こうふん','はっぷん','ふんき','ふんぜん','ふんぱつ']
	},
	{
		pronunciation:[['ヘイ'],['なみ','ならべる','ならぶ','ならびに']],
		question:['居並','毛並','並足','並木','人並','並行','並進','並置','並立','並列'],
		kanji:['居並','毛並','並足','並木','人並','並行','並進','並置','並立','並列'],
		answer:['いなら','けなみ','なみあし','なみき','ひとなみ','へいこう','へいしん','へいち','へいりつ','へいれつ']
	},
	{
		pronunciation:[['ヘイ'],['']],
		question:['陛下'],
		kanji:['陛下'],
		answer:['へいか']
	},
	{
		pronunciation:[['ヘイ'],['とざす','とじる','しまる','しめる']],
		question:['開閉','閉会','閉館','閉経','閉口','閉校','閉山','閉所','閉場','閉庁','閉店','閉幕','閉門','閉路','密閉'],
		kanji:['開閉','閉会','閉館','閉経','閉口','閉校','閉山','閉所','閉場','閉庁','閉店','閉幕','閉門','閉路','密閉'],
		answer:['かいへい','へいかい','へいかん','へいけい','へいこう','へいこう','へいざん','へいしょ','へいじょう','へいちょう','へいてん','へいまく','へいもん','へいろ','みっぺい']
	},
	{
		pronunciation:[['ヘン'],['かた']],
		question:['片足','片側','片言','片付','片手','片時','片方','片身','片道','片目','片面','骨片','断片','破片'],
		kanji:['片足','片側','片言','片付','片手','片時','片方','片身','片道','片目','片面','骨片','断片','破片'],
		answer:['かたあし','かたがわ','かたこと','かたづ','かたて','かたとき','かたほう','かたみ','かたみち','かため','かためん','こっぺん','だんぺん','はへん']
	},
	{
		pronunciation:[['ホ'],['おぎなう']],
		question:['候補','相補','増補','補遺','補完','補間','補記','補給','補強','補欠','補語','補作','補修','補習','補色','補助','補整','補正','補則','補足','補題','補注','補導','補筆'],
		kanji:['候補','相補','増補','補遺','補完','補間','補記','補給','補強','補欠','補語','補作','補修','補習','補色','補助','補整','補正','補則','補足','補題','補注','補導','補筆'],
		answer:['こうほ','そうほ','ぞうほ','ほい','ほかん','ほかん','ほき','ほきゅう','ほきょう','ほけつ','ほご','ほさく','ほしゅう','ほしゅう','ほしょく','ほじょ','ほせい','ほせい','ほそく','ほそく','ほだい','ほちゅう','ほどう','ほひつ']
	},
	{
		pronunciation:[['ボ'],['くれる','くらす']],
		question:['野暮'],
		kanji:['野暮'],
		answer:['やぼ']
	},
	{
		pronunciation:[['ホウ'],['たから']],
		question:['家宝','国宝','財宝','至宝','宝島','宝物','重宝','重宝','秘宝','宝庫','宝石','宝刀','宝物'],
		kanji:['家宝','国宝','財宝','至宝','宝島','宝物','重宝','重宝','秘宝','宝庫','宝石','宝刀','宝物'],
		answer:['かほう','こくほう','ざいほう','しほう','たからじま','たからもの','ちょうほう','ちょうほう','ひほう','ほうこ','ほうせき','ほうとう','ほうもつ']
	},
	{
		pronunciation:[['ホウ'],['たずねる','おとずれる']],
		question:['探訪','訪中','訪日','訪米','訪問','来訪','歴訪'],
		kanji:['探訪','訪中','訪日','訪米','訪問','来訪','歴訪'],
		answer:['たんぼう','ほうちゅう','ほうにち','ほうべい','ほうもん','らいほう','れきほう']
	},
	{
		pronunciation:[['ボウ','モウ'],['ない']],
		question:['興亡','死亡','焼亡','存亡','亡命','亡者'],
		kanji:['興亡','死亡','焼亡','存亡','亡命','亡者'],
		answer:['こうぼう','しぼう','しょうぼう','そんぼう','ぼうめい','もうじゃ']
	},
	{
		pronunciation:[['ボウ'],['わすれる']],
		question:['忘我'],
		kanji:['忘我'],
		answer:['ぼうが']
	},
	{
		pronunciation:[['ボウ'],['']],
		question:['心棒','鉄棒','棒状'],
		kanji:['心棒','鉄棒','棒状'],
		answer:['しんぼう','てつぼう','ぼうじょう']
	},
	{
		pronunciation:[['マイ'],['']],
		question:['大枚','枚挙','枚数'],
		kanji:['大枚','枚挙','枚数'],
		answer:['たいまい','まいきょ','まいすう']
	},
	{
		pronunciation:[['マク','バク'],['']],
		question:['内幕','開幕','銀幕','黒幕','終幕','字幕','序幕','天幕','幕府','幕末','一幕','閉幕','幕内','幕下'],
		kanji:['内幕','開幕','銀幕','黒幕','終幕','字幕','序幕','天幕','幕府','幕末','一幕','閉幕','幕内','幕下'],
		answer:['うちまく','かいまく','ぎんまく','くろまく','しゅうまく','じまく','じょまく','てんまく','ばくふ','ばくまつ','ひとまく','へいまく','まくうち','まくした']
	},
	{
		pronunciation:[['ミツ'],['ひそか','ひそかに','こまかい']],
		question:['過密','機密','厳密','高密','細密','親密','精密','内密','秘密','密会','密教','密航','密告','密使','密室','密集','密接','密接','密着','密閉','密造','密談','密度','密売','密輸','密漁','密林','綿密'],
		kanji:['過密','機密','厳密','高密','細密','親密','精密','内密','秘密','密会','密教','密航','密告','密使','密室','密集','密接','密接','密着','密閉','密造','密談','密度','密売','密輸','密漁','密林','綿密'],
		answer:['かみつ','きみつ','げんみつ','こうみつ','さいみつ','しんみつ','せいみつ','ないみつ','ひみつ','みっかい','みっきょう','みっこう','みっこく','みっし','みっしつ','みっしゅう','みっせつ','みっせつ','みっちゃく','みっぺい','みつぞう','みつだん','みつど','みつばい','みつゆ','みつりょう','みつりん','めんみつ']
	},
	{
		pronunciation:[['メイ'],['']],
		question:['加盟','結盟','同盟','連盟'],
		kanji:['加盟','結盟','同盟','連盟'],
		answer:['かめい','けつめい','どうめい','れんめい']
	},
	{
		pronunciation:[['モ','ボ'],['']],
		question:['規模','大規模','模型','模式','模写','模造','模様'],
		kanji:['規模','大規模','模型','模式','模写','模造','模様'],
		answer:['きぼ','だいきぼ','もけい','もしき','もしゃ','もぞう','もよう']
	},
	{
		pronunciation:[['ヤク'],['わけ']],
		question:['意訳','内訳','英訳','改訳','完訳','誤訳','仕訳','全訳','対訳','直訳','通訳','訳語','訳者','訳出','訳読','訳文','和訳'],
		kanji:['意訳','内訳','英訳','改訳','完訳','誤訳','仕訳','全訳','対訳','直訳','通訳','訳語','訳者','訳出','訳読','訳文','和訳'],
		answer:['いやく','うちわけ','えいやく','かいやく','かんやく','ごやく','しわけ','ぜんやく','たいやく','ちょくやく','つうやく','やくご','やくしゃ','やくしゅつ','やくどく','やくぶん','わやく']
	},
	{
		pronunciation:[['ユウ'],['']],
		question:['郵船','郵送','郵貯','郵便'],
		kanji:['郵船','郵送','郵貯','郵便'],
		answer:['ゆうせん','ゆうそう','ゆうちょ','ゆうびん']
	},
	{
		pronunciation:[['ユウ'],['やさしい','すぐれる']],
		question:['女優','声優','男優','俳優','優位','優勝','優勢','優性','優生','優先','優待','優等','優美','優良'],
		kanji:['女優','声優','男優','俳優','優位','優勝','優勢','優性','優生','優先','優待','優等','優美','優良'],
		answer:['じょゆう','せいゆう','だんゆう','はいゆう','ゆうい','ゆうしょう','ゆうせい','ゆうせい','ゆうせい','ゆうせん','ゆうたい','ゆうとう','ゆうび','ゆうりょう']
	},
	{
		pronunciation:[['ヨ'],['あずける','あずかる']],
		question:['預金','預言'],
		kanji:['預金','預言'],
		answer:['よきん','よげん']
	},
	{
		pronunciation:[['ヨウ'],['おさない']],
		question:['幼子','幼少','幼児','幼女','幼虫','幼年'],
		kanji:['幼子','幼少','幼児','幼女','幼虫','幼年'],
		answer:['おさなご','ようしょう','ようじ','ようじょ','ようちゅう','ようねん']
	},
	{
		pronunciation:[['ヨク'],['ほしい','ほっする']],
		question:['意欲','我欲','禁欲','金欲','強欲','食欲','私欲','情欲','性欲','無欲','欲得','欲張','欲望','欲求'],
		kanji:['意欲','我欲','禁欲','金欲','強欲','食欲','私欲','情欲','性欲','無欲','欲得','欲張','欲望','欲求'],
		answer:['いよく','がよく','きんよく','きんよく','ごうよく','しょくよく','しよく','じょうよく','せいよく','むよく','よくとく','よくば','よくぼう','よっきゅう']
	},
	{
		pronunciation:[['ヨク'],['']],
		question:['翌月','翌週','翌日','翌朝','翌年','翌年'],
		kanji:['翌月','翌週','翌日','翌朝','翌年','翌年'],
		answer:['よくげつ','よくしゅう','よくじつ','よくちょう','よくとし','よくねん']
	},
	{
		pronunciation:[['ラン'],['みだれる','みだす']],
		question:['外乱','混乱','散乱','酒乱','動乱','内乱','波乱','反乱','不乱','乱行','乱交','乱雑','乱視','乱射','乱数','乱戦','乱丁','乱調','乱読','乱入','乱発','乱費','乱暴','乱暴','乱脈','乱用','乱立'],
		kanji:['外乱','混乱','散乱','酒乱','動乱','内乱','波乱','反乱','不乱','乱行','乱交','乱雑','乱視','乱射','乱数','乱戦','乱丁','乱調','乱読','乱入','乱発','乱費','乱暴','乱暴','乱脈','乱用','乱立'],
		answer:['がいらん','こんらん','さんらん','しゅらん','どうらん','ないらん','はらん','はんらん','ふらん','らんぎょう','らんこう','らんざつ','らんし','らんしゃ','らんすう','らんせん','らんちょう','らんちょう','らんどく','らんにゅう','らんぱつ','らんぴ','らんぼう','らんぼう','らんみゃく','らんよう','らんりつ']
	},
	{
		pronunciation:[['ラン'],['たまご']],
		question:['産卵','卵黄','卵子','卵巣','卵白'],
		kanji:['産卵','卵黄','卵子','卵巣','卵白'],
		answer:['さんらん','らんおう','らんし','らんそう','らんぱく']
	},
	{
		pronunciation:[['ラン'],['']],
		question:['一覧','回覧','観覧','供覧','高覧','照覧','笑覧','縦覧','上覧','総覧','展覧','便覧','便覧','遊覧','要覧'],
		kanji:['一覧','回覧','観覧','供覧','高覧','照覧','笑覧','縦覧','上覧','総覧','展覧','便覧','便覧','遊覧','要覧'],
		answer:['いちらん','かいらん','かんらん','きょうらん','こうらん','しょうらん','しょうらん','じゅうらん','じょうらん','そうらん','てんらん','びんらん','べんらん','ゆうらん','ようらん']
	},
	{
		pronunciation:[['リ'],['うら']],
		question:['裏表','裏方','裏返','裏返','裏書','裏金','裏側','裏切','裏口','裏作','裏地','裏手','裏庭','裏腹','裏町','裏道','裏目','裏山','内裏','脳裏','表裏','裏面'],
		kanji:['裏表','裏方','裏返','裏返','裏書','裏金','裏側','裏切','裏口','裏作','裏地','裏手','裏庭','裏腹','裏町','裏道','裏目','裏山','内裏','脳裏','表裏','裏面'],
		answer:['うらおもて','うらかた','うらがえ','うらがえ','うらがき','うらがね','うらがわ','うらぎ','うらぐち','うらさく','うらじ','うらて','うらにわ','うらはら','うらまち','うらみち','うらめ','うらやま','だいり','のうり','ひょうり','りめん']
	},
	{
		pronunciation:[['リツ','リチ'],['']],
		question:['一律','規律','自律','調律','法律','律義','律速','律動'],
		kanji:['一律','規律','自律','調律','法律','律義','律速','律動'],
		answer:['いちりつ','きりつ','じりつ','ちょうりつ','ほうりつ','りちぎ','りっそく','りつどう']
	},
	{
		pronunciation:[['リン'],['のぞむ']],
		question:['君臨','降臨','臨海','臨界','臨空','臨検','臨月','臨時','臨終','臨場','臨席'],
		kanji:['君臨','降臨','臨海','臨界','臨空','臨検','臨月','臨時','臨終','臨場','臨席'],
		answer:['くんりん','こうりん','りんかい','りんかい','りんくう','りんけん','りんげつ','りんじ','りんじゅう','りんじょう','りんせき']
	},
	{
		pronunciation:[['ロウ'],['ほがらか']],
		question:['明朗','朗読','朗報'],
		kanji:['明朗','朗読','朗報'],
		answer:['めいろう','ろうどく','ろうほう']
	},
	{
		pronunciation:[['ロン'],['']],
		question:['異論','各論','極論','議論','空論','結論','激論','原論','言論','公論','口論','国論','修論','史論','私論','序論','持論','推論','正論','世論','総論','卒論','討論','博論','反論','評論','弁論','暴論','無論','目論','世論','立論','両論','理論','論外','論究','論議','論考','論告','論語','論者','論証','論者','論述','論説','論争','論題','論調','論敵','論点','論難','論評','論文','論法','論理'],
		kanji:['異論','各論','極論','議論','空論','結論','激論','原論','言論','公論','口論','国論','修論','史論','私論','序論','持論','推論','正論','世論','総論','卒論','討論','博論','反論','評論','弁論','暴論','無論','目論','世論','立論','両論','理論','論外','論究','論議','論考','論告','論語','論者','論証','論者','論述','論説','論争','論題','論調','論敵','論点','論難','論評','論文','論法','論理'],
		answer:['いろん','かくろん','きょくろん','ぎろん','くうろん','けつろん','げきろん','げんろん','げんろん','こうろん','こうろん','こくろん','しゅうろん','しろん','しろん','じょろん','じろん','すいろん','せいろん','せろん','そうろん','そつろん','とうろん','はくろん','はんろん','ひょうろん','べんろん','ぼうろん','むろん','もくろ','よろん','りつろん','りょうろん','りろん','ろんがい','ろんきゅう','ろんぎ','ろんこう','ろんこく','ろんご','ろんしゃ','ろんしょう','ろんじゃ','ろんじゅつ','ろんせつ','ろんそう','ろんだい','ろんちょう','ろんてき','ろんてん','ろんなん','ろんぴょう','ろんぶん','ろんぽう','ろんり']
	}
];

const kanjiList = [
    ['一','右','雨','円','王','音','下','火','花','貝','学','気','九','休','玉','金','空','月','犬','見','五','口','校','左','三','山','子','四','糸','字','耳','七','車','手','十','出','女','小','上','森','人','水','正','生','青','夕','石','赤','千','川','先','早','草','足','村','大','男','竹','中','虫','町','天','田','土','二','日','入','年','白','八','百','文','木','本','名','目','立','力','林','六'],
    ['引','羽','雲','園','遠','何','科','夏','家','歌','画','回','会','海','絵','外','角','楽','活','間','丸','岩','顔','汽','記','帰','弓','牛','魚','京','強','教','近','兄','形','計','元','言','原','戸','古','午','後','語','工','公','広','交','光','考','行','高','黄','合','谷','国','黒','今','才','細','作','算','止','市','矢','姉','思','紙','寺','自','時','室','社','弱','首','秋','週','春','書','少','場','色','食','心','新','親','図','数','西','声','星','晴','切','雪','船','線','前','組','走','多','太','体','台','地','池','知','茶','昼','長','鳥','朝','直','通','弟','店','点','電','刀','冬','当','東','答','頭','同','道','読','内','南','肉','馬','売','買','麦','半','番','父','風','分','聞','米','歩','母','方','北','毎','妹','万','明','鳴','毛','門','夜','野','友','用','曜','来','里','理','話'],
    ['悪','安','暗','医','委','意','育','員','院','飲','運','泳','駅','央','横','屋','温','化','荷','界','開','階','寒','感','漢','館','岸','起','期','客','究','急','級','宮','球','去','橋','業','曲','局','銀','区','苦','具','君','係','軽','血','決','研','県','庫','湖','向','幸','港','号','根','祭','皿','仕','死','使','始','指','歯','詩','次','事','持','式','実','写','者','主','守','取','酒','受','州','拾','終','習','集','住','重','宿','所','暑','助','昭','消','商','章','勝','乗','植','申','身','神','真','深','進','世','整','昔','全','相','送','想','息','速','族','他','打','対','待','代','第','題','炭','短','談','着','注','柱','丁','帳','調','追','定','庭','笛','鉄','転','都','度','投','豆','島','湯','登','等','動','童','農','波','配','倍','箱','畑','発','反','坂','板','皮','悲','美','鼻','筆','氷','表','秒','病','品','負','部','服','福','物','平','返','勉','放','味','命','面','問','役','薬','由','油','有','遊','予','羊','洋','葉','陽','様','落','流','旅','両','緑','礼','列','練','路','和'],
    ['愛','案','以','衣','位','茨','印','英','栄','媛','塩','岡','億','加','果','貨','課','芽','賀','改','械','害','街','各','覚','潟','完','官','管','関','観','願','岐','希','季','旗','器','機','議','求','泣','給','挙','漁','共','協','鏡','競','極','熊','訓','軍','郡','群','径','景','芸','欠','結','建','健','験','固','功','好','香','候','康','佐','差','菜','最','埼','材','崎','昨','札','刷','察','参','産','散','残','氏','司','試','児','治','滋','辞','鹿','失','借','種','周','祝','順','初','松','笑','唱','焼','照','城','縄','臣','信','井','成','省','清','静','席','積','折','節','説','浅','戦','選','然','争','倉','巣','束','側','続','卒','孫','帯','隊','達','単','置','仲','沖','兆','低','底','的','典','伝','徒','努','灯','働','特','徳','栃','奈','梨','熱','念','敗','梅','博','阪','飯','飛','必','票','標','不','夫','付','府','阜','富','副','兵','別','辺','変','便','包','法','望','牧','末','満','未','民','無','約','勇','要','養','浴','利','陸','良','料','量','輪','類','令','冷','例','連','老','労','録'],
    ['圧','囲','移','因','永','営','衛','易','益','液','演','応','往','桜','可','仮','価','河','過','快','解','格','確','額','刊','幹','慣','眼','紀','基','寄','規','喜','技','義','逆','久','旧','救','居','許','境','均','禁','句','型','経','潔','件','険','検','限','現','減','故','個','護','効','厚','耕','航','鉱','構','興','講','告','混','査','再','災','妻','採','際','在','財','罪','殺','雑','酸','賛','士','支','史','志','枝','師','資','飼','示','似','識','質','舎','謝','授','修','述','術','準','序','招','証','象','賞','条','状','常','情','織','職','制','性','政','勢','精','製','税','責','績','接','設','絶','祖','素','総','造','像','増','則','測','属','率','損','貸','態','団','断','築','貯','張','停','提','程','適','統','堂','銅','導','得','毒','独','任','燃','能','破','犯','判','版','比','肥','非','費','備','評','貧','布','婦','武','復','複','仏','粉','編','弁','保','墓','報','豊','防','貿','暴','脈','務','夢','迷','綿','輸','余','容','略','留','領','歴'],
    ['胃','異','遺','域','宇','映','延','沿','恩','我','灰','拡','革','閣','割','株','干','巻','看','簡','危','机','揮','貴','疑','吸','供','胸','郷','勤','筋','系','敬','警','劇','激','穴','券','絹','権','憲','源','厳','己','呼','誤','后','孝','皇','紅','降','鋼','刻','穀','骨','困','砂','座','済','裁','策','冊','蚕','至','私','姿','視','詞','誌','磁','射','捨','尺','若','樹','収','宗','就','衆','従','縦','縮','熟','純','処','署','諸','除','承','将','傷','障','蒸','針','仁','垂','推','寸','盛','聖','誠','舌','宣','専','泉','洗','染','銭','善','奏','窓','創','装','層','操','蔵','臓','存','尊','退','宅','担','探','誕','段','暖','値','宙','忠','著','庁','頂','腸','潮','賃','痛','敵','展','討','党','糖','届','難','乳','認','納','脳','派','拝','背','肺','俳','班','晩','否','批','秘','俵','腹','奮','並','陛','閉','片','補','暮','宝','訪','亡','忘','棒','枚','幕','密','盟','模','訳','郵','優','預','幼','欲','翌','乱','卵','覧','裏','律','臨','朗','論']
];


window.onload = function () {

    if (window.name != "any") {
        location.reload();
        window.name = "any";
    } else {
        window.name = "";
    }

}

let kanjiGrade = 5;
let kanjiNumber = 0;
let passData = 0;
const quizLength = quiz.length;



//漢字の読みクイズのセットアップ
const setUpQuiz = (kanjiNumber, quiz) => {
	
	//指定学年に合わせて漢字ボタンを作成
	let kanjiCloneCounter = 0;
	while(kanjiCloneCounter < kanjiList[kanjiGrade].length-1){
		let kanjiClone = document.getElementsByClassName('kanjis');
		let cloneElement = kanjiClone[kanjiCloneCounter].cloneNode(true);
		kanjiClone[kanjiCloneCounter].after(cloneElement);
		kanjiCloneCounter++;
	}
	setKanji(kanjiGrade);
	
	//漢字の読みクイズをあるだけ作成
	let cloneCounter = 0;
		while(cloneCounter < quiz[kanjiNumber].question.length-1){
		let quizClone = document.getElementsByClassName('quiz_clone');
		let cloneElement = quizClone[cloneCounter].cloneNode(true);
		quizClone[cloneCounter].after(cloneElement);
		cloneCounter++;
	}

	const $question = document.getElementsByClassName('kanji-question');
	const $how_to_read = document.getElementsByClassName('how_to_read');
	
	//クイズ作成
	let inputCounter = 0;
	while(inputCounter < quiz[kanjiNumber].question.length){
		let inputToSplit = quiz[kanjiNumber].question[inputCounter].split(quiz[kanjiNumber].kanji[inputCounter]);
		$question[inputCounter].textContent = String(inputCounter+1) + '、 ' + inputToSplit[0] + ' [ ' + quiz[kanjiNumber].kanji[inputCounter] + ' ] ' + inputToSplit[1];
		$how_to_read[inputCounter].value = '';
		inputCounter++;
	}
	document.getElementById('correct_message').textContent = '';
	goToQuestion(kanjiGrade);
	hiddenRegisterBtn();
	setKanjiColor(kanjiGrade);
	changePassKanjiColor();
}
setUpQuiz(kanjiNumber, quiz);
document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];



//漢字の読みクイズの合否判定
function judge() {
	let score = 0;
	let quizLength = quiz[kanjiNumber].question.length;

	let answerToShow = document.getElementsByClassName('kanji-answer');

	for(let i = 0; i < quizLength; i++){
		let $answer = document.getElementsByClassName('how_to_read')[i].value;
		answerToShow[i].textContent = quiz[kanjiNumber].answer[i];
		if ($answer == quiz[kanjiNumber].answer[i]){
			score++;
		}
	}
	setTimeout(removeAnswer,3000);

	if (score == quizLength){
		document.getElementById('correct_message').textContent = '全問正解です！！（' + score + '点/' + quizLength + '点中）';
		$targetPassKanji = document.getElementById('kanji');
		passNumber = kanjiList[kanjiGrade].indexOf($targetPassKanji.textContent);
		passData = passNumber;

		$('#congratulations').css('visibility','visible');
		$('#registerButton').css('visibility','visible');
		openPopup(kanjiGrade, kanjiNumber);
	} else {
		document.getElementById('correct_message').textContent = '残念！もう一度やってみよう！！';
	}

}


//答えを消す
function removeAnswer(){
	let quizLength = quiz[kanjiNumber].question.length;
	let answerToShow = document.getElementsByClassName('kanji-answer');
	for(let i = 0; i < quizLength; i++){
		answerToShow[i].textContent = '';
	}
}


//各学年の漢字に色をつける
function setKanjiColor(kanjiGrade){
	let colorList = ['#ffdbdb','#ffdbed','#eddbff','#dbdbff','#dbedff','#ffeddb'];
	if(kanjiGrade == 0){
		changeColor(colorList[0]);
	}else if(kanjiGrade == 1){
		changeColor(colorList[1]);
	}else if(kanjiGrade == 2){
		changeColor(colorList[2]);
	}else if(kanjiGrade == 3){
		changeColor(colorList[3]);
	}else if(kanjiGrade == 4){
		changeColor(colorList[4]);
	}else if(kanjiGrade == 5){
		changeColor(colorList[5]);
	}
}

//色変え
function changeColor(color){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].style.backgroundColor = color;
	}
	setHover(color);
}

function setHover(color){
	let $mouseover = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $mouseover.length; i++){
		$mouseover[i].addEventListener('mouseover', function() {
			$mouseover[i].style.backgroundColor = 'white';
		});
		$mouseover[i].addEventListener('mouseleave', function() {
			$mouseover[i].style.backgroundColor = color;
		});
	}
}





//指定された学年の漢字をボタンに書き込む
function setKanji(kanjiGrade){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].textContent = kanjiList[kanjiGrade][i];
	}
	//漢字ボタンのクリック機能(漢字大きく表示)をオンにする
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].addEventListener('click', showKanji, false);
	}

}





//前回のクイズ削除
function removeQuiz(){
	removeAnswer();
	let cloneRemoveCounter = quiz[kanjiNumber].question.length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('quiz_clone');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
}





//前回の学年の漢字削除
function removeKanji(){
	let cloneRemoveCounter = kanjiList[kanjiGrade].length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('kanjis');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
	document.getElementsByClassName('kanjis')[0].textContent = kanjiList[kanjiGrade][0];
}




//漢字ボタンを押すと、その漢字を大きく表示
function showKanji(e){
	removeQuiz();
	removeKanji();

	$targetKanji = document.getElementById('kanji');
	$targetKanji.textContent = e.target.textContent;
	kanjiNumber = kanjiList[kanjiGrade].indexOf($targetKanji.textContent);

	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	document.getElementsByClassName('how_to_read')[0].value = '';
	
	setUpQuiz(kanjiNumber, quiz);
}




//学年変更
function changeGrade(grade){
	removeQuiz();
	removeKanji();

	kanjiGrade = grade;
	kanjiNumber = 0;

	if(grade == 1){
		quiz = quiz2;
		document.getElementById('grade').textContent = '小学校２年生の漢字';
	} else if(grade == 2){
		quiz = quiz3;
		document.getElementById('grade').textContent = '小学校３年生の漢字';
	} else if(grade == 3){
		quiz = quiz4;
		document.getElementById('grade').textContent = '小学校４年生の漢字';
	} else if(grade == 4){
		quiz = quiz5;
		document.getElementById('grade').textContent = '小学校５年生の漢字';
	} else if(grade == 5){
		quiz = quiz6;
		document.getElementById('grade').textContent = '小学校６年生の漢字';
	} else {
		quiz = quiz1;
		document.getElementById('grade').textContent = '小学校1年生の漢字';
	}
	
	setUpQuiz(kanjiNumber, quiz);
	document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	location.href = '#';
}





function hiddenRegisterBtn() {
    $('#congratulations').css('visibility','hidden');
	$('#registerButton').css('visibility','hidden');
}




//答え合わせボタンでjudge()発動
document.addEventListener('DOMContentLoaded', () => {
    const answerButton = document.getElementById("answerButton");
    answerButton.addEventListener("click", () => { judge() });
});

//学年変更ボタンでchangeGrade()発動
document.addEventListener('DOMContentLoaded', () => {
	const changeGradeButton = document.getElementsByClassName("changeGradeButton");
	for(let i = 0; i < changeGradeButton.length; i++){
    	changeGradeButton[i].addEventListener("click", () => { changeGrade(i) });
	}
});


//railsに正解した漢字のデータをpost
function postData(){

	$.ajax({
		url: '/kanji_quiz/update',
		type: 'GET',
		dataType: 'text',
		async: true,
		data: {
			grade: String(kanjiGrade),
			passData: String(passData),
		},
	});
}


//図鑑に登録ボタンでpostData()発動
let login_checker = document.getElementById('login_checker');
if(login_checker.textContent == 'true'){
	document.addEventListener('DOMContentLoaded', () => {
		const registerButton = document.getElementById("registerButton");
		registerButton.addEventListener("click", () => { postData() });
	});
}



//合格時のアニメーション
function openPopup(grade, num){
	let img = document.getElementById('image_file');
	let imgName = '/image' + grade + '_' + num + '.jpg';
	if(num > 8){
		imgName = '/dummy.jpg';
	}
	if(grade > 0){
		imgName = '/dummy.jpg';
	}
	img.src = imgName;
	document.querySelector('#image_file').animate(
		[
			{ transform: 'scale(0)' },
			{ transform: 'scale(2)' },
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(0, 0)'}
		],
		{
		  duration: 3000,
		  iterations: 1,
		  direction: 'normal'
		}
	);
	let popup = document.getElementById('js-popup');
	popup.classList.add('is-show');
	let passMessage = document.getElementById('pass_message');
	passMessage.style.visibility = 'visible';
}

function closePopUp() {
	let popup = document.getElementById('js-popup');
	let blackBg = document.getElementById('js-black-bg');
	let closeBtn = document.getElementById('js-close-btn');
	let img = document.getElementById('image_file');
	blackBg.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
	closeBtn.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
}
closePopUp();


let pageTop = document.getElementById('page_top');
pageTop.addEventListener('click', function() {
	$('html, body').animate({scrollTop:0},400);
});

function goToQuestion(kanjiGrade){
	let $goToQues = document.getElementsByClassName('kanjis');
	let $target = document.getElementById('hidden_block');
	for(let i = 0; i < kanjiList[kanjiGrade].length; i++){
		$goToQues[i].addEventListener('click', function() {
			$target.scrollIntoView({
				behavior: "smooth",
				block: "start",
				inline: "nearest"
			  });
		});
	}
}


//合格漢字の色を変える
function changePassKanjiColor(){
	//forで正解配列作る処理
	let login_checker = document.getElementById('login_checker');
	if(login_checker.textContent == 'true'){
		let $dummy = document.getElementsByClassName('dummy_data');
		let correctList = [];
		for(let i = 1; i < $dummy.length; i++){
			let splitData = $dummy[i].textContent.trim();
			splitData = splitData.slice(0,-1);
			let splitList = splitData.split(',');
			correctList.push(splitList);
		}
		

		let newColorList = ['#ff7f7f', '#ff7fbf', '#bf7fff', '#7f7fff', '#7fbfff', '#ffbf7f'];
		const $kanjiList = document.getElementsByClassName('kanjis');
		for(let i = 0; i < correctList[kanjiGrade].length; i++){
			let num = correctList[kanjiGrade][i];
			if(num != ''){
				$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];
				$kanjiList[num].addEventListener('mouseleave', function() {
					$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];	
				});
			}
		}
	}
	
}