const quiz = [
	{
		pronunciation:[['アイ'],['']],
		question:['愛犬','愛好','愛国','愛唱','愛児','愛人','愛想','愛着','愛鳥','愛読','愛用','求愛','最愛','親愛','自愛','相愛','他愛','博愛'],
		kanji:['愛犬','愛好','愛国','愛唱','愛児','愛人','愛想','愛着','愛鳥','愛読','愛用','求愛','最愛','親愛','自愛','相愛','他愛','博愛'],
		answer:['あいけん','あいこう','あいこく','あいしょう','あいじ','あいじん','あいそ','あいちゃく','あいちょう','あいどく','あいよう','きゅうあい','さいあい','しんあい','じあい','そうあい','たあい','はくあい']
	},
	{
		pronunciation:[['アン'],['']],
		question:['案外','案出','案内','起案','議案','原案','考案','思案','新案','図案','成案','草案','対案','代案','答案','法案','本案','名案','立案'],
		kanji:['案外','案出','案内','起案','議案','原案','考案','思案','新案','図案','成案','草案','対案','代案','答案','法案','本案','名案','立案'],
		answer:['あんがい','あんしゅつ','あんない','きあん','ぎあん','げんあん','こうあん','しあん','しんあん','ずあん','せいあん','そうあん','たいあん','だいあん','とうあん','ほうあん','ほんあん','めいあん','りつあん']
	},
	{
		pronunciation:[['イ'],['']],
		question:['以下','以外','以後','以上','以前','以内','以来','以来'],
		kanji:['以下','以外','以後','以上','以前','以内','以来','以来'],
		answer:['いか','いがい','いご','いじょう','いぜん','いない','いらい','いらい']
	},
	{
		pronunciation:[['イ'],['ころも']],
		question:['衣食','衣服','衣料','衣類','地衣','着衣','白衣','浴衣'],
		kanji:['衣食','衣服','衣料','衣類','地衣','着衣','白衣','浴衣'],
		answer:['いしょく','いふく','いりょう','いるい','ちい','ちゃくい','はくい','ゆかた']
	},
	{
		pronunciation:[['イ'],['くらい']],
		question:['位相','位置','王位','下位','各位','学位','気位','空位','高位','三位','首位','順位','上位','水位','体位','単位','地位','定位','転位','電位','同位','配位','品位','変位','方位','本位'],
		kanji:['位相','位置','王位','下位','各位','学位','気位','空位','高位','三位','首位','順位','上位','水位','体位','単位','地位','定位','転位','電位','同位','配位','品位','変位','方位','本位'],
		answer:['いそう','いち','おうい','かい','かくい','がくい','きぐらい','くうい','こうい','さんみ','しゅい','じゅんい','じょうい','すいい','たいい','たんい','ちい','ていい','てんい','でんい','どうい','はいい','ひんい','へんい','ほうい','ほんい']
	},
	{
		pronunciation:[[''],['いばら']],
		question:['茨城'],
		kanji:['茨城'],
		answer:['いばらき']
	},
	{
		pronunciation:[['イン'],['しるし']],
		question:['印加','印刷','印紙','印章','印象','印字','改印','消印','公印','実印','調印','目印','矢印'],
		kanji:['印加','印刷','印紙','印章','印象','印字','改印','消印','公印','実印','調印','目印','矢印'],
		answer:['いんか','いんさつ','いんし','いんしょう','いんしょう','いんじ','かいいん','けしいん','こういん','じついん','ちょういん','めじるし','やじるし']
	},
	{
		pronunciation:[['エイ'],['']],
		question:['育英','英才','英字','英知','英文','英明','英和','和英'],
		kanji:['育英','英才','英字','英知','英文','英明','英和','和英'],
		answer:['いくえい','えいさい','えいじ','えいち','えいぶん','えいめい','えいわ','わえい']
	},
	{
		pronunciation:[['エイ'],['さかえる']],
		question:['栄光','栄進','栄達','栄転','栄養','共栄','光栄','清栄','見栄'],
		kanji:['栄光','栄進','栄達','栄転','栄養','共栄','光栄','清栄','見栄'],
		answer:['えいこう','えいしん','えいたつ','えいてん','えいよう','きょうえい','こうえい','せいえい','みえ']
	},
	{
		pronunciation:[['エン'],['ひめ']],
		question:['愛媛'],
		kanji:['愛媛'],
		answer:['えひめ']
	},
	{
		pronunciation:[['エン'],['しお']],
		question:['塩梅','塩化','塩分','岩塩','塩気','塩水','塩焼','食塩'],
		kanji:['塩梅','塩化','塩分','岩塩','塩気','塩水','塩焼','食塩'],
		answer:['あんばい','えんか','えんぶん','がんえん','しおけ','しおみず','しおやき','しょくえん']
	},
	{
		pronunciation:[[''],['おか']],
		question:['岡山'],
		kanji:['岡山'],
		answer:['おかやま']
	},
	{
		pronunciation:[['オク'],['']],
		question:['一億'],
		kanji:['一億'],
		answer:['いちおく']
	},
	{
		pronunciation:[['カ'],['くわえる','くわわる']],
		question:['印加','加害','加工','加算','加重','加速','加入','加熱','加筆','加味','参加','追加','倍加','付加'],
		kanji:['印加','加害','加工','加算','加重','加速','加入','加熱','加筆','加味','参加','追加','倍加','付加'],
		answer:['いんか','かがい','かこう','かさん','かじゅう','かそく','かにゅう','かねつ','かひつ','かみ','さんか','ついか','ばいか','ふか']
	},
	{
		pronunciation:[['カ'],['はたす','はてる','はて']],
		question:['果実','果肉','果物','結果','成果','青果','戦果'],
		kanji:['果実','果肉','果物','結果','成果','青果','戦果'],
		answer:['かじつ','かにく','くだもの','けっか','せいか','せいか','せんか']
	},
	{
		pronunciation:[['カ'],['']],
		question:['貨車','貨物','外貨','金貨','銀貨','通貨'],
		kanji:['貨車','貨物','外貨','金貨','銀貨','通貨'],
		answer:['かしゃ','かもつ','がいか','きんか','ぎんか','つうか']
	},
	{
		pronunciation:[['カ'],['']],
		question:['課外','課金','各課','課題','課長','課内','課目','学課','欠課','考課','正課','日課'],
		kanji:['課外','課金','各課','課題','課長','課内','課目','学課','欠課','考課','正課','日課'],
		answer:['かがい','かきん','かくか','かだい','かちょう','かない','かもく','がっか','けっか','こうか','せいか','にっか']
	},
	{
		pronunciation:[['ガ'],['め']],
		question:['新芽','発芽'],
		kanji:['新芽','発芽'],
		answer:['しんめ','はつが']
	},
	{
		pronunciation:[['ガ'],['']],
		question:['賀正','賀状','参賀','祝賀','年賀'],
		kanji:['賀正','賀状','参賀','祝賀','年賀'],
		answer:['がしょう','がじょう','さんが','しゅくが','ねんが']
	},
	{
		pronunciation:[['カイ'],['あらためる','あらたまる']],
		question:['改悪','改印','改行','改元','改作','改札','改心','改新','改正','改選','改組','改題','改定','改変','改名','改良'],
		kanji:['改悪','改印','改行','改元','改作','改札','改心','改新','改正','改選','改組','改題','改定','改変','改名','改良'],
		answer:['かいあく','かいいん','かいぎょう','かいげん','かいさく','かいさつ','かいしん','かいしん','かいせい','かいせん','かいそ','かいだい','かいてい','かいへん','かいめい','かいりょう']
	},
	{
		pronunciation:[['カイ'],['']],
		question:['器械','機械'],
		kanji:['器械','機械'],
		answer:['きかい','きかい']
	},
	{
		pronunciation:[['ガイ'],['']],
		question:['加害','寒害','害悪','害虫','害毒','公害','殺害','実害','水害','雪害','虫害','無害','薬害','有害','利害','冷害'],
		kanji:['加害','寒害','害悪','害虫','害毒','公害','殺害','実害','水害','雪害','虫害','無害','薬害','有害','利害','冷害'],
		answer:['かがい','かんがい','がいあく','がいちゅう','がいどく','こうがい','さつがい','じつがい','すいがい','せつがい','ちゅうがい','むがい','やくがい','ゆうがい','りがい','れいがい']
	},
	{
		pronunciation:[['ガイ','カイ'],['まち']],
		question:['街道','街灯','街頭','街路','市街','街角'],
		kanji:['街道','街灯','街頭','街路','市街','街角'],
		answer:['かいどう','がいとう','がいとう','がいろ','しがい','まちかど']
	},
	{
		pronunciation:[['カク'],['おのおの']],
		question:['各位','各員','各駅','各課','各階','各県','各校','各市','各紙','各室','各社','各種','各週','各所','各自','各人','各線','各地','各月','各店','各点','各部','各面','各回','各界','各局','各国'],
		kanji:['各位','各員','各駅','各課','各階','各県','各校','各市','各紙','各室','各社','各種','各週','各所','各自','各人','各線','各地','各月','各店','各点','各部','各面','各回','各界','各局','各国'],
		answer:['かくい','かくいん','かくえき','かくか','かくかい','かくけん','かくこう','かくし','かくし','かくしつ','かくしゃ','かくしゅ','かくしゅう','かくしょ','かくじ','かくじん','かくせん','かくち','かくつき','かくてん','かくてん','かくぶ','かくめん','かっかい','かっかい','かっきょく','かっこく']
	},
	{
		pronunciation:[['カク'],['おぼえる','さます','さめる']],
		question:['覚書','感覚','才覚','自覚','先覚','知覚','発覚','不覚','味覚'],
		kanji:['覚書','感覚','才覚','自覚','先覚','知覚','発覚','不覚','味覚'],
		answer:['おぼえがき','かんかく','さいかく','じかく','せんかく','ちかく','はっかく','ふかく','みかく']
	},
	{
		pronunciation:[[''],['かた']],
		question:['新潟'],
		kanji:['新潟'],
		answer:['にいがた']
	},
	{
		pronunciation:[['カン'],['']],
		question:['完結','完工','完成','完全','完走','完売','完敗','未完'],
		kanji:['完結','完工','完成','完全','完走','完売','完敗','未完'],
		answer:['かんけつ','かんこう','かんせい','かんぜん','かんそう','かんばい','かんぱい','みかん']
	},
	{
		pronunciation:[['カン'],['']],
		question:['係官','官界','官学','官業','官軍','官女','官民','器官','教官','高官','左官','仕官','士官','次官','上官','代官','長官','副官','文官'],
		kanji:['係官','官界','官学','官業','官軍','官女','官民','器官','教官','高官','左官','仕官','士官','次官','上官','代官','長官','副官','文官'],
		answer:['かかりかん','かんかい','かんがく','かんぎょう','かんぐん','かんじょ','かんみん','きかん','きょうかん','こうかん','さかん','しかん','しかん','じかん','じょうかん','だいかん','ちょうかん','ふくかん','ぶんかん']
	},
	{
		pronunciation:[['カン'],['くだ']],
		question:['管区','管長','管内','管理','気管','血管','所管','手管','鉄管','配管'],
		kanji:['管区','管長','管内','管理','気管','血管','所管','手管','鉄管','配管'],
		answer:['かんく','かんちょう','かんない','かんり','きかん','けっかん','しょかん','てくだ','てっかん','はいかん']
	},
	{
		pronunciation:[['カン'],['せき','かかわる']],
		question:['大関','関係','関心','関数','関節','関知','関白','関門','関連','機関','関取','相関','通関','連関'],
		kanji:['大関','関係','関心','関数','関節','関知','関白','関門','関連','機関','関取','相関','通関','連関'],
		answer:['おおぜき','かんけい','かんしん','かんすう','かんせつ','かんち','かんぱく','かんもん','かんれん','きかん','せきとり','そうかん','つうかん','れんかん']
	},
	{
		pronunciation:[['カン'],['']],
		question:['観客','観光','観察','観賞','観戦','観点','観念','観音','外観','客観','景観','参観','主観','静観','直観','悲観','美観','楽観'],
		kanji:['観客','観光','観察','観賞','観戦','観点','観念','観音','外観','客観','景観','参観','主観','静観','直観','悲観','美観','楽観'],
		answer:['かんきゃく','かんこう','かんさつ','かんしょう','かんせん','かんてん','かんねん','かんのん','がいかん','きゃっかん','けいかん','さんかん','しゅかん','せいかん','ちょっかん','ひかん','びかん','らっかん']
	},
	{
		pronunciation:[['ガン'],['ねがう','ねがい']],
		question:['願書','願望','宿願','出願','念願','悲願','本願','満願'],
		kanji:['願書','願望','宿願','出願','念願','悲願','本願','満願'],
		answer:['がんしょ','がんぼう','しゅくがん','しゅつがん','ねんがん','ひがん','ほんがん','まんがん']
	},
	{
		pronunciation:[['キ','ギ'],['']],
		question:['岐阜'],
		kanji:['岐阜'],
		answer:['ぎふ']
	},
	{
		pronunciation:[['キ'],['']],
		question:['希求','希少','希望','古希'],
		kanji:['希求','希少','希望','古希'],
		answer:['ききゅう','きしょう','きぼう','こき']
	},
	{
		pronunciation:[['キ'],['']],
		question:['雨季','夏季','季語','季節','四季','春季','冬季','年季','来季'],
		kanji:['雨季','夏季','季語','季節','四季','春季','冬季','年季','来季'],
		answer:['うき','かき','きご','きせつ','しき','しゅんき','とうき','ねんき','らいき']
	},
	{
		pronunciation:[['キ'],['はた']],
		question:['旗手','国旗','旗色','半旗'],
		kanji:['旗手','国旗','旗色','半旗'],
		answer:['きしゅ','こっき','はたいろ','はんき']
	},
	{
		pronunciation:[['キ'],['うつわ']],
		question:['花器','楽器','器械','器官','器楽','機器','器具','器用','器量','計器','食器','石器','茶器','鉄器','電器','土器','兵器','利器'],
		kanji:['花器','楽器','器械','器官','器楽','機器','器具','器用','器量','計器','食器','石器','茶器','鉄器','電器','土器','兵器','利器'],
		answer:['かき','がっき','きかい','きかん','きがく','きき','きぐ','きよう','きりょう','けいき','しょっき','せっき','ちゃき','てっき','でんき','どき','へいき','りき']
	},
	{
		pronunciation:[['キ'],['はた']],
		question:['機運','機会','機械','機関','機器','機具','機材','機種','機首','機上','機体','機知','機長','機転','機動','機内','好機','子機','心機','時機','実機','全機','待機','転機','電機','投機','当機','動機','無機','有機'],
		kanji:['機運','機会','機械','機関','機器','機具','機材','機種','機首','機上','機体','機知','機長','機転','機動','機内','好機','子機','心機','時機','実機','全機','待機','転機','電機','投機','当機','動機','無機','有機'],
		answer:['きうん','きかい','きかい','きかん','きき','きぐ','きざい','きしゅ','きしゅ','きじょう','きたい','きち','きちょう','きてん','きどう','きない','こうき','こき','しんき','じき','じっき','ぜんき','たいき','てんき','でんき','とうき','とうき','どうき','むき','ゆうき']
	},
	{
		pronunciation:[['ギ'],['']],
		question:['会議','協議','議案','議員','議院','議会','議決','議事','議場','議席','議題','議長','議定','決議','建議','県議','合議','市議','争議','談議','動議','付議','物議','和議'],
		kanji:['会議','協議','議案','議員','議院','議会','議決','議事','議場','議席','議題','議長','議定','決議','建議','県議','合議','市議','争議','談議','動議','付議','物議','和議'],
		answer:['かいぎ','きょうぎ','ぎあん','ぎいん','ぎいん','ぎかい','ぎけつ','ぎじ','ぎじょう','ぎせき','ぎだい','ぎちょう','ぎてい','けつぎ','けんぎ','けんぎ','ごうぎ','しぎ','そうぎ','だんぎ','どうぎ','ふぎ','ぶつぎ','わぎ']
	},
	{
		pronunciation:[['キュウ'],['もとめる']],
		question:['希求','求愛','求人','求積','追求','要求'],
		kanji:['希求','求愛','求人','求積','追求','要求'],
		answer:['ききゅう','きゅうあい','きゅうじん','きゅうせき','ついきゅう','ようきゅう']
	},
	{
		pronunciation:[['キュウ'],['なく']],
		question:['号泣'],
		kanji:['号泣'],
		answer:['ごうきゅう']
	},
	{
		pronunciation:[['キュウ'],['']],
		question:['給金','給食','給仕','給水','給電','給湯','給付','給油','給料','月給','高給','週給','時給','自給','受給','日給','配給','発給','本給','無給','有給'],
		kanji:['給金','給食','給仕','給水','給電','給湯','給付','給油','給料','月給','高給','週給','時給','自給','受給','日給','配給','発給','本給','無給','有給'],
		answer:['きゅうきん','きゅうしょく','きゅうじ','きゅうすい','きゅうでん','きゅうとう','きゅうふ','きゅうゆ','きゅうりょう','げっきゅう','こうきゅう','しゅうきゅう','じきゅう','じきゅう','じゅきゅう','にっきゅう','はいきゅう','はっきゅう','ほんきゅう','むきゅう','ゆうきゅう']
	},
	{
		pronunciation:[['キョ'],['あげる','あがる']],
		question:['挙足','一挙','挙行','挙止','挙式','挙手','挙動','選挙','大挙','列挙'],
		kanji:['挙足','一挙','挙行','挙止','挙式','挙手','挙動','選挙','大挙','列挙'],
		answer:['あげあし','いっきょ','きょこう','きょし','きょしき','きょしゅ','きょどう','せんきょ','たいきょ','れっきょ']
	},
	{
		pronunciation:[['ギョ','リョウ'],['']],
		question:['漁協','漁業','漁具','漁港','漁場','漁船','漁村','漁夫','漁民','出漁','不漁'],
		kanji:['漁協','漁業','漁具','漁港','漁場','漁船','漁村','漁夫','漁民','出漁','不漁'],
		answer:['ぎょきょう','ぎょぎょう','ぎょぐ','ぎょこう','ぎょじょう','ぎょせん','ぎょそん','ぎょふ','ぎょみん','しゅつりょう','ふりょう']
	},
	{
		pronunciation:[['キョウ'],['ともに']],
		question:['共栄','共感','共学','共産','共時','共生','共通','共通','共同','共鳴','共有','共用','共立','共和','公共'],
		kanji:['共栄','共感','共学','共産','共時','共生','共通','共通','共同','共鳴','共有','共用','共立','共和','公共'],
		answer:['きょうえい','きょうかん','きょうがく','きょうさん','きょうじ','きょうせい','きょうつう','きょうつう','きょうどう','きょうめい','きょうゆう','きょうよう','きょうりつ','きょうわ','こうきょう']
	},
	{
		pronunciation:[['キョウ'],['']],
		question:['協会','協議','協業','協調','協定','協同','協約','協力','協和','漁協','生協','農協'],
		kanji:['協会','協議','協業','協調','協定','協同','協約','協力','協和','漁協','生協','農協'],
		answer:['きょうかい','きょうぎ','きょうぎょう','きょうちょう','きょうてい','きょうどう','きょうやく','きょうりょく','きょうわ','ぎょきょう','せいきょう','のうきょう']
	},
	{
		pronunciation:[['キョウ'],['かがみ']],
		question:['鏡台','鏡面'],
		kanji:['鏡台','鏡面'],
		answer:['きょうだい','きょうめん']
	},
	{
		pronunciation:[['キョウ','ケイ'],['きそう','せる']],
		question:['競泳','競合','競作','競争','競走','競売','競歩','競馬','競売','競輪'],
		kanji:['競泳','競合','競作','競争','競走','競売','競歩','競馬','競売','競輪'],
		answer:['きょうえい','きょうごう','きょうさく','きょうそう','きょうそう','きょうばい','きょうほ','けいば','けいばい','けいりん']
	},
	{
		pronunciation:[['キョク','ゴク'],['きわめる','きわまる','きわみ']],
		question:['究極','極言','極小','極少','極大','極地','極点','極東','極度','極力','極悪','極意','極上','極楽','消極','積極','太極','対極','多極','電極','陽極','両極'],
		kanji:['究極','極言','極小','極少','極大','極地','極点','極東','極度','極力','極悪','極意','極上','極楽','消極','積極','太極','対極','多極','電極','陽極','両極'],
		answer:['きゅうきょく','きょくげん','きょくしょう','きょくしょう','きょくだい','きょくち','きょくてん','きょくとう','きょくど','きょくりょく','ごくあく','ごくい','ごくじょう','ごくらく','しょうきょく','せっきょく','たいきょく','たいきょく','たきょく','でんきょく','ようきょく','りょうきょく']
	},
	{
		pronunciation:[[''],['くま']],
		question:['熊本'],
		kanji:['熊本'],
		answer:['くまもと']
	},
	{
		pronunciation:[['クン'],['']],
		question:['教訓','訓育','訓告','訓令','訓練','訓話','特訓'],
		kanji:['教訓','訓育','訓告','訓令','訓練','訓話','特訓'],
		answer:['きょうくん','くんいく','くんこく','くんれい','くんれん','くんわ','とっくん']
	},
	{
		pronunciation:[['グン'],['']],
		question:['海軍','官軍','空軍','軍医','軍歌','軍功','軍港','軍国','軍神','軍事','軍人','軍隊','軍配','軍部','軍用','行軍','進軍','西軍','東軍','南軍','米軍','北軍','陸軍'],
		kanji:['海軍','官軍','空軍','軍医','軍歌','軍功','軍港','軍国','軍神','軍事','軍人','軍隊','軍配','軍部','軍用','行軍','進軍','西軍','東軍','南軍','米軍','北軍','陸軍'],
		answer:['かいぐん','かんぐん','くうぐん','ぐんい','ぐんか','ぐんこう','ぐんこう','ぐんこく','ぐんしん','ぐんじ','ぐんじん','ぐんたい','ぐんばい','ぐんぶ','ぐんよう','こうぐん','しんぐん','せいぐん','とうぐん','なんぐん','べいぐん','ほくぐん','りくぐん']
	},
	{
		pronunciation:[['グン'],['']],
		question:['郡部'],
		kanji:['郡部'],
		answer:['ぐんぶ']
	},
	{
		pronunciation:[['グン'],['むれる','むれ']],
		question:['魚群','群居','群集','群小','群生','群像','群島','群発','群落','大群'],
		kanji:['魚群','群居','群集','群小','群生','群像','群島','群発','群落','大群'],
		answer:['ぎょぐん','ぐんきょ','ぐんしゅう','ぐんしょう','ぐんせい','ぐんぞう','ぐんとう','ぐんぱつ','ぐんらく','たいぐん']
	},
	{
		pronunciation:[['ケイ'],['']],
		question:['口径','長径','直径','半径'],
		kanji:['口径','長径','直径','半径'],
		answer:['こうけい','ちょうけい','ちょっけい','はんけい']
	},
	{
		pronunciation:[['ケイ'],['']],
		question:['遠景','近景','景観','景気','景勝','景品','景色','光景','借景','全景','風景','夜景'],
		kanji:['遠景','近景','景観','景気','景勝','景品','景色','光景','借景','全景','風景','夜景'],
		answer:['えんけい','きんけい','けいかん','けいき','けいしょう','けいひん','けしき','こうけい','しゃっけい','ぜんけい','ふうけい','やけい']
	},
	{
		pronunciation:[['ゲイ'],['']],
		question:['園芸','学芸','曲芸','芸事','芸者','芸当','芸人','芸名','工芸','手芸','多芸','文芸','民芸','無芸'],
		kanji:['園芸','学芸','曲芸','芸事','芸者','芸当','芸人','芸名','工芸','手芸','多芸','文芸','民芸','無芸'],
		answer:['えんげい','がくげい','きょくげい','げいごと','げいしゃ','げいとう','げいにん','げいめい','こうげい','しゅげい','たげい','ぶんげい','みんげい','むげい']
	},
	{
		pronunciation:[['ケツ'],['かける','かく']],
		question:['間欠','欠課','欠航','欠食','欠席','欠点','欠員','欠場','欠番','欠落','欠礼','事欠','出欠','病欠','無欠'],
		kanji:['間欠','欠課','欠航','欠食','欠席','欠点','欠員','欠場','欠番','欠落','欠礼','事欠','出欠','病欠','無欠'],
		answer:['かんけつ','けっか','けっこう','けっしょく','けっせき','けってん','けついん','けつじょう','けつばん','けつらく','けつれい','ことか','しゅっけつ','びょうけつ','むけつ']
	},
	{
		pronunciation:[['ケツ'],['むすぶ','ゆう','ゆわえる']],
		question:['完結','帰結','結果','結界','結局','結社','結集','結成','結石','結線','結束','結言','結合','結実','結末','小結','終結','集結','焼結','直結','連結'],
		kanji:['完結','帰結','結果','結界','結局','結社','結集','結成','結石','結線','結束','結言','結合','結実','結末','小結','終結','集結','焼結','直結','連結'],
		answer:['かんけつ','きけつ','けっか','けっかい','けっきょく','けっしゃ','けっしゅう','けっせい','けっせき','けっせん','けっそく','けつげん','けつごう','けつじつ','けつまつ','こむすび','しゅうけつ','しゅうけつ','しょうけつ','ちょっけつ','れんけつ']
	},
	{
		pronunciation:[['ケン','コン'],['たてる','たつ']],
		question:['建議','建国','建材','建立','建前','建物','建屋','土建'],
		kanji:['建議','建国','建材','建立','建前','建物','建屋','土建'],
		answer:['けんぎ','けんこく','けんざい','こんりゅう','たてまえ','たてもの','たてや','どけん']
	},
	{
		pronunciation:[['ケン'],['すこやか']],
		question:['強健','健気','健康','健勝','健児','健全'],
		kanji:['強健','健気','健康','健勝','健児','健全'],
		answer:['きょうけん','けなげ','けんこう','けんしょう','けんじ','けんぜん']
	},
	{
		pronunciation:[['ケン','ゲン'],['']],
		question:['試験','実験','受験','体験'],
		kanji:['試験','実験','受験','体験'],
		answer:['しけん','じっけん','じゅけん','たいけん']
	},
	{
		pronunciation:[['コ'],['かためる','かたまる','かたい']],
		question:['強固','固化','固形','固守','固持','固辞','固体','固着','固定','固有'],
		kanji:['強固','固化','固形','固守','固持','固辞','固体','固着','固定','固有'],
		answer:['きょうこ','こか','こけい','こしゅ','こじ','こじ','こたい','こちゃく','こてい','こゆう']
	},
	{
		pronunciation:[['コウ','ク'],['']],
		question:['気功','軍功','功利','功労','成功','年功'],
		kanji:['気功','軍功','功利','功労','成功','年功'],
		answer:['きこう','ぐんこう','こうり','こうろう','せいこう','ねんこう']
	},
	{
		pronunciation:[['コウ'],['このむ','すく']],
		question:['愛好','好意','好運','好感','好機','好色','好調','好天','好転','好物','好例','親好','相好','同好','友好','良好'],
		kanji:['愛好','好意','好運','好感','好機','好色','好調','好天','好転','好物','好例','親好','相好','同好','友好','良好'],
		answer:['あいこう','こうい','こううん','こうかん','こうき','こうしょく','こうちょう','こうてん','こうてん','こうぶつ','こうれい','しんこう','そうごう','どうこう','ゆうこう','りょうこう']
	},
	{
		pronunciation:[['コウ','キョウ'],['か','かおり','かおる']],
		question:['香水','香川'],
		kanji:['香水','香川'],
		answer:['こうすい','かがわ']
	},
	{
		pronunciation:[['コウ'],['そうろう']],
		question:['気候','時候','候文','兆候','天候'],
		kanji:['気候','時候','候文','兆候','天候'],
		answer:['きこう','じこう','そうろうぶん','ちょうこう','てんこう']
	},
	{
		pronunciation:[['コウ'],['']],
		question:['健康','小康'],
		kanji:['健康','小康'],
		answer:['けんこう','しょうこう']
	},
	{
		pronunciation:[['サ'],['']],
		question:['佐賀'],
		kanji:['佐賀'],
		answer:['さが']
	},
	{
		pronunciation:[['サ'],['さす']],
		question:['階差','交差','公差','差金','差引','差引','差水','差配','差分','差別','小差','時差','大差','日差','落差'],
		kanji:['階差','交差','公差','差金','差引','差引','差水','差配','差分','差別','小差','時差','大差','日差','落差'],
		answer:['かいさ','こうさ','こうさ','さしがね','さしひ','さしひき','さしみず','さはい','さぶん','さべつ','しょうさ','じさ','たいさ','ひざし','らくさ']
	},
	{
		pronunciation:[['サイ'],['な']],
		question:['根菜','菜園','菜食','山菜','主菜','前菜','白菜','副菜','野菜'],
		kanji:['根菜','菜園','菜食','山菜','主菜','前菜','白菜','副菜','野菜'],
		answer:['こんさい','さいえん','さいしょく','さんさい','しゅさい','ぜんさい','はくさい','ふくさい','やさい']
	},
	{
		pronunciation:[['サイ'],['もっとも']],
		question:['最愛','最悪','最右','最下','最急','最強','最近','最古','最高','最期','最後','最終','最初','最小','最少','最新','最上','最上','最前','最多','最短','最大','最中','最長','最低','最良','最早'],
		kanji:['最愛','最悪','最右','最下','最急','最強','最近','最古','最高','最期','最後','最終','最初','最小','最少','最新','最上','最上','最前','最多','最短','最大','最中','最長','最低','最良','最早'],
		answer:['さいあい','さいあく','さいう','さいか','さいきゅう','さいきょう','さいきん','さいこ','さいこう','さいご','さいご','さいしゅう','さいしょ','さいしょう','さいしょう','さいしん','さいじょう','さいじょう','さいぜん','さいた','さいたん','さいだい','さいちゅう','さいちょう','さいてい','さいりょう','もはや']
	},
	{
		pronunciation:[[''],['さい']],
		question:['埼玉'],
		kanji:['埼玉'],
		answer:['さいたま']
	},
	{
		pronunciation:[['ザイ'],['']],
		question:['角材','外材','画材','機材','教材','建材','材木','材料','取材','人材','石材','題材','鉄材','木材'],
		kanji:['角材','外材','画材','機材','教材','建材','材木','材料','取材','人材','石材','題材','鉄材','木材'],
		answer:['かくざい','がいざい','がざい','きざい','きょうざい','けんざい','ざいもく','ざいりょう','しゅざい','じんざい','せきざい','だいざい','てつざい','もくざい']
	},
	{
		pronunciation:[[''],['さき']],
		question:['長崎'],
		kanji:['長崎'],
		answer:['ながさき']
	},
	{
		pronunciation:[['サク'],['']],
		question:['昨日','昨日','昨冬','昨年','昨夜','昨今','昨夜'],
		kanji:['昨日','昨日','昨冬','昨年','昨夜','昨今','昨夜'],
		answer:['きのう','さくじつ','さくとう','さくねん','さくや','さっこん','ゆうべ']
	},
	{
		pronunciation:[['サツ'],['ふだ']],
		question:['絵札','改札','切札','高札','正札','新札','手札','名札','荷札','入札','花札','表札','落札'],
		kanji:['絵札','改札','切札','高札','正札','新札','手札','名札','荷札','入札','花札','表札','落札'],
		answer:['えふだ','かいさつ','きりふだ','こうさつ','しょうふだ','しんさつ','てふだ','なふだ','にふだ','にゅうさつ','はなふだ','ひょうさつ','らくさつ']
	},
	{
		pronunciation:[['サツ'],['する']],
		question:['色刷','印刷','刷新','刷毛'],
		kanji:['色刷','印刷','刷新','刷毛'],
		answer:['いろずり','いんさつ','さっしん','はけ']
	},
	{
		pronunciation:[['サツ'],['']],
		question:['観察','考察','高察','察知'],
		kanji:['観察','考察','高察','察知'],
		answer:['かんさつ','こうさつ','こうさつ','さっち']
	},
	{
		pronunciation:[['サン'],['まいる']],
		question:['帰参','古参','参院','参加','参会','参画','参観','参宮','参考','参集','参照','参事','参上','参戦','参道','参入','参列','新参','直参','持参','日参','人参'],
		kanji:['帰参','古参','参院','参加','参会','参画','参観','参宮','参考','参集','参照','参事','参上','参戦','参道','参入','参列','新参','直参','持参','日参','人参'],
		answer:['きさん','こさん','さんいん','さんか','さんかい','さんかく','さんかん','さんぐう','さんこう','さんしゅう','さんしょう','さんじ','さんじょう','さんせん','さんどう','さんにゅう','さんれつ','しんざん','じきさん','じさん','にっさん','にんじん']
	},
	{
		pronunciation:[['サン'],['うむ','うまれる','うぶ']],
		question:['初産','産着','産毛','産声','産土','産湯','共産','月産','原産','国産','産院','産休','産業','産気','産後','産出','産児','産大','産地','産物','産油','出産','所産','水産','生産','通産','特産','動産','日産','年産','農産','物産','土産','無産','名産','流産','量産','林産'],
		kanji:['初産','産着','産毛','産声','産土','産湯','共産','月産','原産','国産','産院','産休','産業','産気','産後','産出','産児','産大','産地','産物','産油','出産','所産','水産','生産','通産','特産','動産','日産','年産','農産','物産','土産','無産','名産','流産','量産','林産'],
		answer:['ういざん','うぶぎ','うぶげ','うぶごえ','うぶすな','うぶゆ','きょうさん','げっさん','げんさん','こくさん','さんいん','さんきゅう','さんぎょう','さんけ','さんご','さんしゅつ','さんじ','さんだい','さんち','さんぶつ','さんゆ','しゅっさん','しょさん','すいさん','せいさん','つうさん','とくさん','どうさん','にっさん','ねんさん','のうさん','ぶっさん','みやげ','むさん','めいさん','りゅうざん','りょうさん','りんさん']
	},
	{
		pronunciation:[['サン'],['ちる','ちらす','ちらかす','ちらかる']],
		question:['雲散','散会','散見','散水','散発','散文','散歩','四散','集散','消散','発散','飛散','分散','放散'],
		kanji:['雲散','散会','散見','散水','散発','散文','散歩','四散','集散','消散','発散','飛散','分散','放散'],
		answer:['うんさん','さんかい','さんけん','さんすい','さんぱつ','さんぶん','さんぽ','しさん','しゅうさん','しょうさん','はっさん','ひさん','ぶんさん','ほうさん']
	},
	{
		pronunciation:[['ザン'],['のこる','のこす']],
		question:['残金','残業','残暑','残照','残雪','残高','残念','残飯','残品','残部','名残','無残'],
		kanji:['残金','残業','残暑','残照','残雪','残高','残念','残飯','残品','残部','名残','無残'],
		answer:['ざんきん','ざんぎょう','ざんしょ','ざんしょう','ざんせつ','ざんだか','ざんねん','ざんぱん','ざんぴん','ざんぶ','なごり','むざん']
	},
	{
		pronunciation:[['シ'],['うじ']],
		question:['氏神','氏族','氏名','同氏','両氏'],
		kanji:['氏神','氏族','氏名','同氏','両氏'],
		answer:['うじがみ','しぞく','しめい','どうし','りょうし']
	},
	{
		pronunciation:[['シ'],['']],
		question:['行司','宮司','公司','司会','司教','司祭','司書','司直','司法','司令','上司'],
		kanji:['行司','宮司','公司','司会','司教','司祭','司書','司直','司法','司令','上司'],
		answer:['ぎょうじ','ぐうじ','こうし','しかい','しきょう','しさい','ししょ','しちょく','しほう','しれい','じょうし']
	},
	{
		pronunciation:[['シ'],['こころみる','ためす']],
		question:['院試','試合','試飲','試験','試行','試作','試算','試算','試写','試食','試乗','試走','試問','試薬','試用','試料','試練','追試','入試'],
		kanji:['院試','試合','試飲','試験','試行','試作','試算','試算','試写','試食','試乗','試走','試問','試薬','試用','試料','試練','追試','入試'],
		answer:['いんし','しあい','しいん','しけん','しこう','しさく','しさん','しさん','ししゃ','ししょく','しじょう','しそう','しもん','しやく','しよう','しりょう','しれん','ついし','にゅうし']
	},
	{
		pronunciation:[['ジ','ニ'],['']],
		question:['愛児','育児','園児','健児','産児','小児','児童','女児','男児'],
		kanji:['愛児','育児','園児','健児','産児','小児','児童','女児','男児'],
		answer:['あいじ','いくじ','えんじ','けんじ','さんじ','しょうに','じどう','じょじ','だんじ']
	},
	{
		pronunciation:[['ジ','チ'],['おさめる','おさまる','なおる','なおす']],
		question:['根治','根治','自治','全治','治安','治水','湯治','不治','法治'],
		kanji:['根治','根治','自治','全治','治安','治水','湯治','不治','法治'],
		answer:['こんじ','こんち','じち','ぜんち','ちあん','ちすい','とうじ','ふじ','ほうち']
	},
	{
		pronunciation:[['ジ','シ'],['']],
		question:['滋賀'],
		kanji:['滋賀'],
		answer:['しが']
	},
	{
		pronunciation:[['ジ'],['やめる']],
		question:['固辞','式辞','祝辞','主辞','辞意','辞去','辞書','辞典','辞表','辞令','世辞','答辞'],
		kanji:['固辞','式辞','祝辞','主辞','辞意','辞去','辞書','辞典','辞表','辞令','世辞','答辞'],
		answer:['こじ','しきじ','しゅくじ','しゅじ','じい','じきょ','じしょ','じてん','じひょう','じれい','せじ','とうじ']
	},
	{
		pronunciation:[[''],['しか','か']],
		question:['鹿児島'],
		kanji:['鹿児島'],
		answer:['かごしま']
	},
	{
		pronunciation:[['シツ'],['うしなう','うせる']],
		question:['一失','失火','失笑','失神','失速','失調','失点','失敗','失意','失業','失言','失念','失望','失明','失礼','失礼','消失','焼失','自失','得失','見失','流失'],
		kanji:['一失','失火','失笑','失神','失速','失調','失点','失敗','失意','失業','失言','失念','失望','失明','失礼','失礼','消失','焼失','自失','得失','見失','流失'],
		answer:['いっしつ','しっか','しっしょう','しっしん','しっそく','しっちょう','しってん','しっぱい','しつい','しつぎょう','しつげん','しつねん','しつぼう','しつめい','しつれい','しつれい','しょうしつ','しょうしつ','じしつ','とくしつ','みうしな','りゅうしつ']
	},
	{
		pronunciation:[['シャク'],['かりる']],
		question:['借方','借地','借用','借金','借景'],
		kanji:['借方','借地','借用','借金','借景'],
		answer:['かりかた','しゃくち','しゃくよう','しゃっきん','しゃっけい']
	},
	{
		pronunciation:[['シュ'],['たね']],
		question:['育種','一種','各種','機種','金種','業種','原種','車種','種子','種族','種皮','種別','種目','種類','新種','字種','人種','他種','多種','同種','品種','別種'],
		kanji:['育種','一種','各種','機種','金種','業種','原種','車種','種子','種族','種皮','種別','種目','種類','新種','字種','人種','他種','多種','同種','品種','別種'],
		answer:['いくしゅ','いっしゅ','かくしゅ','きしゅ','きんしゅ','ぎょうしゅ','げんしゅ','しゃしゅ','しゅし','しゅぞく','しゅひ','しゅべつ','しゅもく','しゅるい','しんしゅ','じしゅ','じんしゅ','たしゅ','たしゅ','どうしゅ','ひんしゅ','べっしゅ']
	},
	{
		pronunciation:[['シュウ'],['まわり']],
		question:['一周','円周','外周','周囲','周回','周期','周航','周章','周知','周年','周波','周辺','周遊','半周'],
		kanji:['一周','円周','外周','周囲','周回','周期','周航','周章','周知','周年','周波','周辺','周遊','半周'],
		answer:['いっしゅう','えんしゅう','がいしゅう','しゅうい','しゅうかい','しゅうき','しゅうこう','しゅうしょう','しゅうち','しゅうねん','しゅうは','しゅうへん','しゅうゆう','はんしゅう']
	},
	{
		pronunciation:[['シュク','シュウ'],['いわう']],
		question:['内祝','祝言','祝意','祝勝','祝辞','祝日','祝典','祝電','祝福'],
		kanji:['内祝','祝言','祝意','祝勝','祝辞','祝日','祝典','祝電','祝福'],
		answer:['うちいわい','しゅうげん','しゅくい','しゅくしょう','しゅくじ','しゅくじつ','しゅくてん','しゅくでん','しゅくふく']
	},
	{
		pronunciation:[['ジュン'],['']],
		question:['温順','語順','耳順','順位','順化','順次','順調','順当','順番','順風','順法','順良','順路','打順','手順','筆順','不順','道順'],
		kanji:['温順','語順','耳順','順位','順化','順次','順調','順当','順番','順風','順法','順良','順路','打順','手順','筆順','不順','道順'],
		answer:['おんじゅん','ごじゅん','じじゅん','じゅんい','じゅんか','じゅんじ','じゅんちょう','じゅんとう','じゅんばん','じゅんぷう','じゅんぽう','じゅんりょう','じゅんろ','だじゅん','てじゅん','ひつじゅん','ふじゅん','みちじゅん']
	},
	{
		pronunciation:[['ショ'],['はじめ','はじめて','はつ','そめる','うい']],
		question:['初産','期初','原初','最初','初夏','初会','初回','初期','初級','初見','初校','初秋','初出','初春','初心','初速','初代','初手','初冬','初等','初頭','初日','初歩','初老','当初','初荷','初耳','初雪'],
		kanji:['初産','期初','原初','最初','初夏','初会','初回','初期','初級','初見','初校','初秋','初出','初春','初心','初速','初代','初手','初冬','初等','初頭','初日','初歩','初老','当初','初荷','初耳','初雪'],
		answer:['ういざん','きしょ','げんしょ','さいしょ','しょか','しょかい','しょかい','しょき','しょきゅう','しょけん','しょこう','しょしゅう','しょしゅつ','しょしゅん','しょしん','しょそく','しょだい','しょて','しょとう','しょとう','しょとう','しょにち','しょほ','しょろう','とうしょ','はつに','はつみみ','はつゆき']
	},
	{
		pronunciation:[['ショウ'],['まつ']],
		question:['赤松','市松','門松','小松','松原','松山'],
		kanji:['赤松','市松','門松','小松','松原','松山'],
		answer:['あかまつ','いちまつ','かどまつ','こまつ','まつばら','まつやま']
	},
	{
		pronunciation:[['ショウ'],['わらう','えむ']],
		question:['笑顔','苦笑','失笑','笑止','談笑','冷笑'],
		kanji:['笑顔','苦笑','失笑','笑止','談笑','冷笑'],
		answer:['えがお','くしょう','しっしょう','しょうし','だんしょう','れいしょう']
	},
	{
		pronunciation:[['ショウ'],['となえる']],
		question:['愛唱','暗唱','歌唱','合唱','三唱','主唱','唱和','重唱','熱唱','輪唱'],
		kanji:['愛唱','暗唱','歌唱','合唱','三唱','主唱','唱和','重唱','熱唱','輪唱'],
		answer:['あいしょう','あんしょう','かしょう','がっしょう','さんしょう','しゅしょう','しょうわ','じゅうしょう','ねっしょう','りんしょう']
	},
	{
		pronunciation:[['ショウ'],['やく','やける']],
		question:['塩焼','焼売','焼結','焼死','焼失','焼身','全焼','半焼','焼肉','焼物','類焼'],
		kanji:['塩焼','焼売','焼結','焼死','焼失','焼身','全焼','半焼','焼肉','焼物','類焼'],
		answer:['しおやき','しゅうまい','しょうけつ','しょうし','しょうしつ','しょうしん','ぜんしょう','はんしょう','やきにく','やきもの','るいしょう']
	},
	{
		pronunciation:[['ショウ'],['てる','てらす','てれる']],
		question:['参照','残照','照会','照合','照度','照明','対照','日照','火照'],
		kanji:['参照','残照','照会','照合','照度','照明','対照','日照','火照'],
		answer:['さんしょう','ざんしょう','しょうかい','しょうごう','しょうど','しょうめい','たいしょう','にっしょう','ほて']
	},
	{
		pronunciation:[['ジョウ'],['しろ']],
		question:['宮城','古城','城山','城主','城内','築城'],
		kanji:['宮城','古城','城山','城主','城内','築城'],
		answer:['きゅうじょう','こじょう','しろやま','じょうしゅ','じょうない','ちくじょう']
	},
	{
		pronunciation:[['ジョウ'],['なわ']],
		question:['沖縄'],
		kanji:['沖縄'],
		answer:['おきなわ']
	},
	{
		pronunciation:[['シン','ジン'],['']],
		question:['家臣','臣下','大臣'],
		kanji:['家臣','臣下','大臣'],
		answer:['かしん','しんか','だいじん']
	},
	{
		pronunciation:[['シン'],['']],
		question:['音信','外信','交信','所信','書信','信教','信金','信号','信者','信心','信念','信望','信用','自信','受信','送信','通信','電信','発信','不信','返信','来信'],
		kanji:['音信','外信','交信','所信','書信','信教','信金','信号','信者','信心','信念','信望','信用','自信','受信','送信','通信','電信','発信','不信','返信','来信'],
		answer:['おんしん','がいしん','こうしん','しょしん','しょしん','しんきょう','しんきん','しんごう','しんじゃ','しんじん','しんねん','しんぼう','しんよう','じしん','じゅしん','そうしん','つうしん','でんしん','はっしん','ふしん','へんしん','らいしん']
	},
	{
		pronunciation:[['セイ','ショウ'],['い']],
		question:['福井'],
		kanji:['福井'],
		answer:['ふくい']
	},
	{
		pronunciation:[['セイ','ジョウ'],['なる','なす']],
		question:['育成','化成','完成','形成','結成','合成','作成','集成','助成','成案','成育','成員','成果','成業','成形','成功','成語','成算','成人','生成','成虫','成長','成年','成敗','成分','成約','成立','組成','大成','達成','転成','成金','変成','養成','落成','連成'],
		kanji:['育成','化成','完成','形成','結成','合成','作成','集成','助成','成案','成育','成員','成果','成業','成形','成功','成語','成算','成人','生成','成虫','成長','成年','成敗','成分','成約','成立','組成','大成','達成','転成','成金','変成','養成','落成','連成'],
		answer:['いくせい','かせい','かんせい','けいせい','けっせい','ごうせい','さくせい','しゅうせい','じょせい','せいあん','せいいく','せいいん','せいか','せいぎょう','せいけい','せいこう','せいご','せいさん','せいじん','せいせい','せいちゅう','せいちょう','せいねん','せいばい','せいぶん','せいやく','せいりつ','そせい','たいせい','たっせい','てんせい','なりきん','へんせい','ようせい','らくせい','れんせい']
	},
	{
		pronunciation:[['セイ','ショウ'],['かえりみる','はぶく']],
		question:['帰省','省力','省令','内省','反省','不省','本省'],
		kanji:['帰省','省力','省令','内省','反省','不省','本省'],
		answer:['きせい','しょうりょく','しょうれい','ないせい','はんせい','ふせい','ほんしょう']
	},
	{
		pronunciation:[['セイ','ショウ'],['きよい','きよまる','きよめる']],
		question:['血清','清水','清栄','清音','清算','清酒','清書','清勝','清明','清流'],
		kanji:['血清','清水','清栄','清音','清算','清酒','清書','清勝','清明','清流'],
		answer:['けっせい','しみず','せいえい','せいおん','せいさん','せいしゅ','せいしょ','せいしょう','せいめい','せいりゅう']
	},
	{
		pronunciation:[['セイ','ジョウ'],['しず','しずか','しずまる','しずめる']],
		question:['安静','静脈','静観','静止','静的','静物','静養','動静','平静','冷静'],
		kanji:['安静','静脈','静観','静止','静的','静物','静養','動静','平静','冷静'],
		answer:['あんせい','じょうみゃく','せいかん','せいし','せいてき','せいぶつ','せいよう','どうせい','へいせい','れいせい']
	},
	{
		pronunciation:[['セキ'],['']],
		question:['会席','客席','議席','空席','欠席','主席','首席','出席','次席','自席','上席','席上','全席','打席','着席','同席','末席','満席','列席'],
		kanji:['会席','客席','議席','空席','欠席','主席','首席','出席','次席','自席','上席','席上','全席','打席','着席','同席','末席','満席','列席'],
		answer:['かいせき','きゃくせき','ぎせき','くうせき','けっせき','しゅせき','しゅせき','しゅっせき','じせき','じせき','じょうせき','せきじょう','ぜんせき','だせき','ちゃくせき','どうせき','まっせき','まんせき','れっせき']
	},
	{
		pronunciation:[['セキ'],['つむ','つもる']],
		question:['外積','求積','山積','集積','積算','積雪','積年','積分','積和','積極','体積','積木','積荷','内積','面積'],
		kanji:['外積','求積','山積','集積','積算','積雪','積年','積分','積和','積極','体積','積木','積荷','内積','面積'],
		answer:['がいせき','きゅうせき','さんせき','しゅうせき','せきさん','せきせつ','せきねん','せきぶん','せきわ','せっきょく','たいせき','つみき','つみに','ないせき','めんせき']
	},
	{
		pronunciation:[['セツ'],['おる','おり','おれる']],
		question:['右折','曲折','左折','折角','折半','時折'],
		kanji:['右折','曲折','左折','折角','折半','時折'],
		answer:['うせつ','きょくせつ','させつ','せっかく','せっぱん','ときおり']
	},
	{
		pronunciation:[['セツ','セチ'],['ふし']],
		question:['音節','関節','季節','苦節','小節','使節','小節','章節','時節','節気','節食','節水','節足','節電','節度','節分','節約','調節','節目','分節','文節'],
		kanji:['音節','関節','季節','苦節','小節','使節','小節','章節','時節','節気','節食','節水','節足','節電','節度','節分','節約','調節','節目','分節','文節'],
		answer:['おんせつ','かんせつ','きせつ','くせつ','こぶし','しせつ','しょうせつ','しょうせつ','じせつ','せっき','せっしょく','せっすい','せっそく','せつでん','せつど','せつぶん','せつやく','ちょうせつ','ふしめ','ぶんせつ','ぶんせつ']
	},
	{
		pronunciation:[['セツ','ゼイ'],['とく']],
		question:['一説','学説','口説','言説','社説','小説','新説','自説','説教','説得','説法','説明','説話','通説','定説','伝説','遊説','力説'],
		kanji:['一説','学説','口説','言説','社説','小説','新説','自説','説教','説得','説法','説明','説話','通説','定説','伝説','遊説','力説'],
		answer:['いっせつ','がくせつ','くど','げんせつ','しゃせつ','しょうせつ','しんせつ','じせつ','せっきょう','せっとく','せっぽう','せつめい','せつわ','つうせつ','ていせつ','でんせつ','ゆうぜい','りきせつ']
	},
	{
		pronunciation:[['セン'],['あさい']],
		question:['浅黒','浅学','遠浅'],
		kanji:['浅黒','浅学','遠浅'],
		answer:['あさぐろ','せんがく','とおあさ']
	},
	{
		pronunciation:[['セン'],['いくさ','たたかう']],
		question:['悪戦','会戦','開戦','合戦','観戦','休戦','苦戦','決戦','交戦','作戦','参戦','終戦','実戦','戦意','戦役','戦果','戦火','戦記','戦局','戦後','戦国','戦士','戦死','戦車','戦時','戦場','戦線','戦前','戦争','戦地','戦費','戦法','戦友','戦利','戦力','対戦','大戦','停戦','内戦','熱戦','敗戦','不戦','夜戦','力戦','冷戦','連戦','和戦'],
		kanji:['悪戦','会戦','開戦','合戦','観戦','休戦','苦戦','決戦','交戦','作戦','参戦','終戦','実戦','戦意','戦役','戦果','戦火','戦記','戦局','戦後','戦国','戦士','戦死','戦車','戦時','戦場','戦線','戦前','戦争','戦地','戦費','戦法','戦友','戦利','戦力','対戦','大戦','停戦','内戦','熱戦','敗戦','不戦','夜戦','力戦','冷戦','連戦','和戦'],
		answer:['あくせん','かいせん','かいせん','かっせん','かんせん','きゅうせん','くせん','けっせん','こうせん','さくせん','さんせん','しゅうせん','じっせん','せんい','せんえき','せんか','せんか','せんき','せんきょく','せんご','せんごく','せんし','せんし','せんしゃ','せんじ','せんじょう','せんせん','せんぜん','せんそう','せんち','せんぴ','せんぽう','せんゆう','せんり','せんりょく','たいせん','たいせん','ていせん','ないせん','ねっせん','はいせん','ふせん','やせん','りきせん','れいせん','れんせん','わせん']
	},
	{
		pronunciation:[['セン'],['えらぶ']],
		question:['改選','公選','国選','自選','人選','選外','選挙','選曲','選言','選考','選手','選集','選出','選者','選定','選別','選民','当選','特選','入選','本選','予選','落選'],
		kanji:['改選','公選','国選','自選','人選','選外','選挙','選曲','選言','選考','選手','選集','選出','選者','選定','選別','選民','当選','特選','入選','本選','予選','落選'],
		answer:['かいせん','こうせん','こくせん','じせん','じんせん','せんがい','せんきょ','せんきょく','せんげん','せんこう','せんしゅ','せんしゅう','せんしゅつ','せんじゃ','せんてい','せんべつ','せんみん','とうせん','とくせん','にゅうせん','ほんせん','よせん','らくせん']
	},
	{
		pronunciation:[['ゼン','ネン'],['']],
		question:['画然','公然','自然','整然','全然','天然','当然','当然','同然','必然','平然','未然','歴然'],
		kanji:['画然','公然','自然','整然','全然','天然','当然','当然','同然','必然','平然','未然','歴然'],
		answer:['かくぜん','こうぜん','しぜん','せいぜん','ぜんぜん','てんねん','とうぜん','とうぜん','どうぜん','ひつぜん','へいぜん','みぜん','れきぜん']
	},
	{
		pronunciation:[['ソウ'],['あらそう']],
		question:['競争','係争','戦争','争議','争点'],
		kanji:['競争','係争','戦争','争議','争点'],
		answer:['きょうそう','けいそう','せんそう','そうぎ','そうてん']
	},
	{
		pronunciation:[['ソウ'],['くら']],
		question:['校倉','小倉','倉庫'],
		kanji:['校倉','小倉','倉庫'],
		answer:['あぜくら','おぐら','そうこ']
	},
	{
		pronunciation:[['ソウ'],['す']],
		question:['空巣','巣食','巣立','巣箱','病巣','古巣'],
		kanji:['空巣','巣食','巣立','巣箱','病巣','古巣'],
		answer:['あきす','すく','すだ','すばこ','びょうそう','ふるす']
	},
	{
		pronunciation:[['ソク'],['たば']],
		question:['結束','集束','束帯','花束','不束','約束'],
		kanji:['結束','集束','束帯','花束','不束','約束'],
		answer:['けっそく','しゅうそく','そくたい','はなたば','ふつつか','やくそく']
	},
	{
		pronunciation:[['ソク'],['がわ','かたわら','そば']],
		question:['右側','内側','上側','表側','北側','側面','側近','外側','体側','西側','東側','左側','前側','右側','南側','山側','両側'],
		kanji:['右側','内側','上側','表側','北側','側面','側近','外側','体側','西側','東側','左側','前側','右側','南側','山側','両側'],
		answer:['うそく','うちがわ','うわがわ','おもてがわ','きたがわ','そくめん','そっきん','そとがわ','たいそく','にしがわ','ひがしがわ','ひだりがわ','まえがわ','みぎがわ','みなみがわ','やまがわ','りょうがわ']
	},
	{
		pronunciation:[['ゾク'],['つづく','つづける']],
		question:['後続','持続','相続','続出','続投','続発','続落','続行','手続','連続'],
		kanji:['後続','持続','相続','続出','続投','続発','続落','続行','手続','連続'],
		answer:['こうぞく','じぞく','そうぞく','ぞくしゅつ','ぞくとう','ぞくはつ','ぞくらく','ぞっこう','てつづき','れんぞく']
	},
	{
		pronunciation:[['ソツ'],['']],
		question:['学卒','高卒','新卒','卒中','卒業','中卒','何卒'],
		kanji:['学卒','高卒','新卒','卒中','卒業','中卒','何卒'],
		answer:['がくそつ','こうそつ','しんそつ','そっちゅう','そつぎょう','ちゅうそつ','なにとぞ']
	},
	{
		pronunciation:[['ソン'],['まご']],
		question:['子孫','長孫'],
		kanji:['子孫','長孫'],
		answer:['しそん','ちょうそん']
	},
	{
		pronunciation:[['タイ'],['おびる','おび']],
		question:['一帯','温帯','寒帯','所帯','声帯','世帯','束帯','帯電','帯刀','地帯','熱帯','付帯','包帯','連帯'],
		kanji:['一帯','温帯','寒帯','所帯','声帯','世帯','束帯','帯電','帯刀','地帯','熱帯','付帯','包帯','連帯'],
		answer:['いったい','おんたい','かんたい','しょたい','せいたい','せたい','そくたい','たいでん','たいとう','ちたい','ねったい','ふたい','ほうたい','れんたい']
	},
	{
		pronunciation:[['タイ'],['']],
		question:['楽隊','軍隊','小隊','隊員','隊長','大隊','中隊','入隊','部隊','分隊','兵隊','連隊'],
		kanji:['楽隊','軍隊','小隊','隊員','隊長','大隊','中隊','入隊','部隊','分隊','兵隊','連隊'],
		answer:['がくたい','ぐんたい','しょうたい','たいいん','たいちょう','だいたい','ちゅうたい','にゅうたい','ぶたい','ぶんたい','へいたい','れんたい']
	},
	{
		pronunciation:[['タツ'],['とおる']],
		question:['栄達','君達','上達','送達','速達','達者','達成','達筆','達人','達文','調達','通達','伝達','友達','配達','発達','人達','練達'],
		kanji:['栄達','君達','上達','送達','速達','達者','達成','達筆','達人','達文','調達','通達','伝達','友達','配達','発達','人達','練達'],
		answer:['えいたつ','きみたち','じょうたつ','そうたつ','そくたつ','たっしゃ','たっせい','たっぴつ','たつじん','たつぶん','ちょうたつ','つうたつ','でんたつ','ともだち','はいたつ','はったつ','ひとたち','れんたつ']
	},
	{
		pronunciation:[['タン'],['']],
		question:['単位','単一','単元','単行','単語','単車','単身','単数','単線','単体','単調','単品','単文'],
		kanji:['単位','単一','単元','単行','単語','単車','単身','単数','単線','単体','単調','単品','単文'],
		answer:['たんい','たんいつ','たんげん','たんこう','たんご','たんしゃ','たんしん','たんすう','たんせん','たんたい','たんちょう','たんぴん','たんぶん']
	},
	{
		pronunciation:[['チ'],['おく']],
		question:['安置','位置','置場','置物','書置','対置','定置','転置','配置','付置','分置','放置','物置'],
		kanji:['安置','位置','置場','置物','書置','対置','定置','転置','配置','付置','分置','放置','物置'],
		answer:['あんち','いち','おきば','おきもの','かきおき','たいち','ていち','てんち','はいち','ふち','ぶんち','ほうち','ものおき']
	},
	{
		pronunciation:[['チュウ'],['なか']],
		question:['仲秋','仲買','仲仕','仲間','仲良','仲人'],
		kanji:['仲秋','仲買','仲仕','仲間','仲良','仲人'],
		answer:['ちゅうしゅう','なかがい','なかし','なかま','なかよ','なこうど']
	},
	{
		pronunciation:[['チュウ'],['おき']],
		question:['沖縄'],
		kanji:['沖縄'],
		answer:['おきなわ']
	},
	{
		pronunciation:[['チョウ'],['きざす','きざし']],
		question:['前兆','兆候','予兆'],
		kanji:['前兆','兆候','予兆'],
		answer:['ぜんちょう','ちょうこう','よちょう']
	},
	{
		pronunciation:[['テイ'],['ひくい','ひくめる','ひくまる']],
		question:['高低','最低','低温','低音','低下','低級','低空','低速','低地','低調','低頭','低落','低利'],
		kanji:['高低','最低','低温','低音','低下','低級','低空','低速','低地','低調','低頭','低落','低利'],
		answer:['こうてい','さいてい','ていおん','ていおん','ていか','ていきゅう','ていくう','ていそく','ていち','ていちょう','ていとう','ていらく','ていり']
	},
	{
		pronunciation:[['テイ'],['そこ']],
		question:['糸底','海底','川底','根底','心底','水底','底力','地底','底辺','底面','底流','平底','船底','丸底'],
		kanji:['糸底','海底','川底','根底','心底','水底','底力','地底','底辺','底面','底流','平底','船底','丸底'],
		answer:['いとぞこ','かいてい','かわぞこ','こんてい','しんそこ','すいてい','そこぢから','ちてい','ていへん','ていめん','ていりゅう','ひらぞこ','ふなぞこ','まるぞこ']
	},
	{
		pronunciation:[['テキ'],['まと']],
		question:['外的','学的','公的','史的','詩的','心的','人的','静的','知的','的中','動的','内的','標的','美的','病的','物的','法的','目的','量的'],
		kanji:['外的','学的','公的','史的','詩的','心的','人的','静的','知的','的中','動的','内的','標的','美的','病的','物的','法的','目的','量的'],
		answer:['がいてき','がくてき','こうてき','してき','してき','しんてき','じんてき','せいてき','ちてき','てきちゅう','どうてき','ないてき','ひょうてき','びてき','びょうてき','ぶってき','ほうてき','もくてき','りょうてき']
	},
	{
		pronunciation:[['テン'],['']],
		question:['原典','古典','祭典','式典','祝典','出典','事典','辞典','典型','特典'],
		kanji:['原典','古典','祭典','式典','祝典','出典','事典','辞典','典型','特典'],
		answer:['げんてん','こてん','さいてん','しきてん','しゅくてん','しゅってん','じてん','じてん','てんけい','とくてん']
	},
	{
		pronunciation:[['デン'],['つたわる','つたえる','つたう','つたえ']],
		question:['駅伝','家伝','外伝','自伝','伝手','手伝','伝言','伝説','伝送','伝達','伝熱','伝票','伝聞','伝来','伝令','列伝'],
		kanji:['駅伝','家伝','外伝','自伝','伝手','手伝','伝言','伝説','伝送','伝達','伝熱','伝票','伝聞','伝来','伝令','列伝'],
		answer:['えきでん','かでん','がいでん','じでん','つて','てつだ','でんごん','でんせつ','でんそう','でんたつ','でんねつ','でんぴょう','でんぶん','でんらい','でんれい','れつでん']
	},
	{
		pronunciation:[['ト'],['']],
		question:['徒花','教徒','使徒','生徒','徒弟','徒歩','徒労'],
		kanji:['徒花','教徒','使徒','生徒','徒弟','徒歩','徒労'],
		answer:['あだばな','きょうと','しと','せいと','とてい','とほ','とろう']
	},
	{
		pronunciation:[['ド'],['つとめる']],
		question:['努力'],
		kanji:['努力'],
		answer:['どりょく']
	},
	{
		pronunciation:[['トウ'],['ひ']],
		question:['外灯','街灯','消灯','点灯','電灯','灯火','灯台','灯明','灯油','灯火','門灯'],
		kanji:['外灯','街灯','消灯','点灯','電灯','灯火','灯台','灯明','灯油','灯火','門灯'],
		answer:['がいとう','がいとう','しょうとう','てんとう','でんとう','とうか','とうだい','とうみょう','とうゆ','ともしび','もんとう']
	},
	{
		pronunciation:[['ドウ'],['はたらく']],
		question:['実働','労働'],
		kanji:['実働','労働'],
		answer:['じつどう','ろうどう']
	},
	{
		pronunciation:[['トク'],['']],
		question:['特産','特使','特集','特賞','特色','特進','特選','特大','特注','特長','特定','特典','特等','特売','特筆','特別','特別','特命','特約','特有','特例','特化','特急','特訓','特高'],
		kanji:['特産','特使','特集','特賞','特色','特進','特選','特大','特注','特長','特定','特典','特等','特売','特筆','特別','特別','特命','特約','特有','特例','特化','特急','特訓','特高'],
		answer:['とくさん','とくし','とくしゅう','とくしょう','とくしょく','とくしん','とくせん','とくだい','とくちゅう','とくちょう','とくてい','とくてん','とくとう','とくばい','とくひつ','とくべつ','とくべつ','とくめい','とくやく','とくゆう','とくれい','とっか','とっきゅう','とっくん','とっこう']
	},
	{
		pronunciation:[['トク'],['']],
		question:['悪徳','公徳','人徳','徳川','徳川','徳用','徳利','道徳','美徳','不徳'],
		kanji:['悪徳','公徳','人徳','徳川','徳川','徳用','徳利','道徳','美徳','不徳'],
		answer:['あくとく','こうとく','じんとく','とくがわ','とくがわ','とくよう','とっくり','どうとく','びとく','ふとく']
	},
	{
		pronunciation:[[''],['とち']],
		question:['栃木'],
		kanji:['栃木'],
		answer:['とちぎ']
	},
	{
		pronunciation:[['ナ'],['']],
		question:['奈良'],
		kanji:['奈良'],
		answer:['なら']
	},
	{
		pronunciation:[[''],['なし']],
		question:['山梨'],
		kanji:['山梨'],
		answer:['やまなし']
	},
	{
		pronunciation:[['ネツ'],['あつい']],
		question:['温熱','加熱','急熱','光熱','高熱','地熱','赤熱','地熱','伝熱','電熱','熱気','熱唱','熱心','熱戦','熱帯','熱中','熱湯','熱波','熱風','熱意','熱望','熱量','白熱','発熱','平熱','冷熱'],
		kanji:['温熱','加熱','急熱','光熱','高熱','地熱','赤熱','地熱','伝熱','電熱','熱気','熱唱','熱心','熱戦','熱帯','熱中','熱湯','熱波','熱風','熱意','熱望','熱量','白熱','発熱','平熱','冷熱'],
		answer:['おんねつ','かねつ','きゅうねつ','こうねつ','こうねつ','じねつ','せきねつ','ちねつ','でんねつ','でんねつ','ねっき','ねっしょう','ねっしん','ねっせん','ねったい','ねっちゅう','ねっとう','ねっぱ','ねっぷう','ねつい','ねつぼう','ねつりょう','はくねつ','はつねつ','へいねつ','れいねつ']
	},
	{
		pronunciation:[['ネン'],['']],
		question:['一念','観念','記念','残念','失念','思念','信念','想念','通念','入念','念願','念書','念頭','念力','放念','無念','理念'],
		kanji:['一念','観念','記念','残念','失念','思念','信念','想念','通念','入念','念願','念書','念頭','念力','放念','無念','理念'],
		answer:['いちねん','かんねん','きねん','ざんねん','しつねん','しねん','しんねん','そうねん','つうねん','にゅうねん','ねんがん','ねんしょ','ねんとう','ねんりき','ほうねん','むねん','りねん']
	},
	{
		pronunciation:[['ハイ'],['やぶれる']],
		question:['完敗','失敗','勝敗','成敗','全敗','敗者','敗戦','敗北','不敗','無敗','連敗'],
		kanji:['完敗','失敗','勝敗','成敗','全敗','敗者','敗戦','敗北','不敗','無敗','連敗'],
		answer:['かんぱい','しっぱい','しょうはい','せいばい','ぜんぱい','はいしゃ','はいせん','はいぼく','ふはい','むはい','れんぱい']
	},
	{
		pronunciation:[['バイ'],['うめ']],
		question:['塩梅','梅酒','梅見','寒梅','梅雨','入梅','白梅','梅雨'],
		kanji:['塩梅','梅酒','梅見','寒梅','梅雨','入梅','白梅','梅雨'],
		answer:['あんばい','うめしゅ','うめみ','かんばい','つゆ','にゅうばい','はくばい','ばいう']
	},
	{
		pronunciation:[['ハク','バク'],['']],
		question:['博士','博愛','博学','博士','博物','博才','博打','万博'],
		kanji:['博士','博愛','博学','博士','博物','博才','博打','万博'],
		answer:['はかせ','はくあい','はくがく','はくし','はくぶつ','ばくさい','ばくち','ばんぱく']
	},
	{
		pronunciation:[['ハン'],['さか']],
		question:['大阪'],
		kanji:['大阪'],
		answer:['おおさか']
	},
	{
		pronunciation:[['ハン'],['めし']],
		question:['朝飯','残飯','赤飯','飯場','昼飯','米飯','夕飯','夕飯'],
		kanji:['朝飯','残飯','赤飯','飯場','昼飯','米飯','夕飯','夕飯'],
		answer:['あさめし','ざんぱん','せきはん','はんば','ひるめし','べいはん','ゆうはん','ゆうめし']
	},
	{
		pronunciation:[['ヒ'],['とぶ','とばす']],
		question:['飛行','飛散','飛車'],
		kanji:['飛行','飛散','飛車'],
		answer:['ひこう','ひさん','ひしゃ']
	},
	{
		pronunciation:[['ヒツ'],['かならず']],
		question:['必見','必殺','必死','必勝','必着','必中','必定','必然','必読','必要','未必'],
		kanji:['必見','必殺','必死','必勝','必着','必中','必定','必然','必読','必要','未必'],
		answer:['ひっけん','ひっさつ','ひっし','ひっしょう','ひっちゃく','ひっちゅう','ひつじょう','ひつぜん','ひつどく','ひつよう','みひつ']
	},
	{
		pronunciation:[['ヒョウ'],['']],
		question:['開票','起票','帳票','伝票','投票','票決','票田'],
		kanji:['開票','起票','帳票','伝票','投票','票決','票田'],
		answer:['かいひょう','きひょう','ちょうひょう','でんぴょう','とうひょう','ひょうけつ','ひょうでん']
	},
	{
		pronunciation:[['ヒョウ'],['']],
		question:['指標','商標','道標','標記','標高','標語','標定','標的','標本','道標','目標','門標'],
		kanji:['指標','商標','道標','標記','標高','標語','標定','標的','標本','道標','目標','門標'],
		answer:['しひょう','しょうひょう','どうひょう','ひょうき','ひょうこう','ひょうご','ひょうてい','ひょうてき','ひょうほん','みちしるべ','もくひょう','もんぴょう']
	},
	{
		pronunciation:[['フ','ブ'],['']],
		question:['不安','不意','不運','不覚','不休','不幸','不作','不出','不信','不時','不治','不順','不省','不整','不正','不戦','不全','不足','不調','不通','不束','不定','不当','不等','不動','不同','不敗','不発','不服','不平','不変','不便','不法','不満','不明','不毛','不問','不用','不要','不利','不漁','不良','不労','不老','不和','不様','不足','不足','不味'],
		kanji:['不安','不意','不運','不覚','不休','不幸','不作','不出','不信','不時','不治','不順','不省','不整','不正','不戦','不全','不足','不調','不通','不束','不定','不当','不等','不動','不同','不敗','不発','不服','不平','不変','不便','不法','不満','不明','不毛','不問','不用','不要','不利','不漁','不良','不労','不老','不和','不様','不足','不足','不味'],
		answer:['ふあん','ふい','ふうん','ふかく','ふきゅう','ふこう','ふさく','ふしゅつ','ふしん','ふじ','ふじ','ふじゅん','ふせい','ふせい','ふせい','ふせん','ふぜん','ふそく','ふちょう','ふつう','ふつつか','ふてい','ふとう','ふとう','ふどう','ふどう','ふはい','ふはつ','ふふく','ふへい','ふへん','ふべん','ふほう','ふまん','ふめい','ふもう','ふもん','ふよう','ふよう','ふり','ふりょう','ふりょう','ふろう','ふろう','ふわ','ぶざま','ぶそく','ぶそく','まず']
	},
	{
		pronunciation:[['フ','フウ'],['おっと']],
		question:['漁夫','工夫','主夫','水夫','人夫','農夫','夫人','老夫'],
		kanji:['漁夫','工夫','主夫','水夫','人夫','農夫','夫人','老夫'],
		answer:['ぎょふ','くふう','しゅふ','すいふ','にんぷ','のうふ','ふじん','ろうふ']
	},
	{
		pronunciation:[['フ'],['つける','つく','あたえる']],
		question:['受付','回付','下付','感付','気付','気付','給付','原付','交付','作付','送付','近付','取付','根付','配付','日付','付加','付記','付近','付議','付言','付図','付帯','付置','付着','付表','付録','返付'],
		kanji:['受付','回付','下付','感付','気付','気付','給付','原付','交付','作付','送付','近付','取付','根付','配付','日付','付加','付記','付近','付議','付言','付図','付帯','付置','付着','付表','付録','返付'],
		answer:['うけつけ','かいふ','かふ','かんづ','きづ','きづけ','きゅうふ','げんつき','こうふ','さくつけ','そうふ','ちかづ','とりつけ','ねづ','はいふ','ひづけ','ふか','ふき','ふきん','ふぎ','ふげん','ふず','ふたい','ふち','ふちゃく','ふひょう','ふろく','へんぷ']
	},
	{
		pronunciation:[['フ'],['']],
		question:['首府','府下','府県','府内','府立'],
		kanji:['首府','府下','府県','府内','府立'],
		answer:['しゅふ','ふか','ふけん','ふない','ふりつ']
	},
	{
		pronunciation:[['フ'],['']],
		question:['岐阜'],
		kanji:['岐阜'],
		answer:['ぎふ']
	},
	{
		pronunciation:[['フ','フウ'],['とむ','とみ']],
		question:['貧富','富者','豊富'],
		kanji:['貧富','富者','豊富'],
		answer:['ひんぷ','ふしゃ','ほうふ']
	},
	{
		pronunciation:[['フク'],['']],
		question:['副官','副業','副菜','副賞','副食','副次','副題','副読','副本'],
		kanji:['副官','副業','副菜','副賞','副食','副次','副題','副読','副本'],
		answer:['ふくかん','ふくぎょう','ふくさい','ふくしょう','ふくしょく','ふくじ','ふくだい','ふくどく','ふくほん']
	},
	{
		pronunciation:[['ヘイ','ヒョウ'],['']],
		question:['番兵','歩兵','兵役','兵器','兵士','兵隊','兵法','兵力','歩兵','用兵'],
		kanji:['番兵','歩兵','兵役','兵器','兵士','兵隊','兵法','兵力','歩兵','用兵'],
		answer:['ばんぺい','ふひょう','へいえき','へいき','へいし','へいたい','へいほう','へいりょく','ほへい','ようへい']
	},
	{
		pronunciation:[['ベツ'],['わかれる']],
		question:['区別','決別','告別','戸別','差別','死別','種別','選別','送別','大別','月別','特別','特別','年別','分別','分別','別館','別記','別紙','別室','別種','別送','別注','別表','別口','別人','別売','別便','別名','別物','類別'],
		kanji:['区別','決別','告別','戸別','差別','死別','種別','選別','送別','大別','月別','特別','特別','年別','分別','分別','別館','別記','別紙','別室','別種','別送','別注','別表','別口','別人','別売','別便','別名','別物','類別'],
		answer:['くべつ','けつべつ','こくべつ','こべつ','さべつ','しべつ','しゅべつ','せんべつ','そうべつ','たいべつ','つきべつ','とくべつ','とくべつ','ねんべつ','ふんべつ','ぶんべつ','べっかん','べっき','べっし','べっしつ','べっしゅ','べっそう','べっちゅう','べっぴょう','べつくち','べつじん','べつばい','べつびん','べつめい','べつもの','るいべつ']
	},
	{
		pronunciation:[['ヘン'],['あたり','べ']],
		question:['一辺','右辺','海辺','上辺','岸辺','近辺','左辺','周辺','身辺','短辺','長辺','底辺','天辺','野辺','辺地','水辺'],
		kanji:['一辺','右辺','海辺','上辺','岸辺','近辺','左辺','周辺','身辺','短辺','長辺','底辺','天辺','野辺','辺地','水辺'],
		answer:['いっぺん','うへん','うみべ','うわべ','きしべ','きんぺん','さへん','しゅうへん','しんぺん','たんぺん','ちょうへん','ていへん','てっぺん','のべ','へんち','みずべ']
	},
	{
		pronunciation:[['ヘン'],['かわる','かえる']],
		question:['一変','黄変','改変','急変','事変','大変','大変','地変','転変','不変','変位','変化','変型','変形','変化','変死','変色','変身','変人','変成','変声','変速','変体','変調','変転','変動'],
		kanji:['一変','黄変','改変','急変','事変','大変','大変','地変','転変','不変','変位','変化','変型','変形','変化','変死','変色','変身','変人','変成','変声','変速','変体','変調','変転','変動'],
		answer:['いっぺん','おうへん','かいへん','きゅうへん','じへん','たいへん','たいへん','ちへん','てんぺん','ふへん','へんい','へんか','へんけい','へんけい','へんげ','へんし','へんしょく','へんしん','へんじん','へんせい','へんせい','へんそく','へんたい','へんちょう','へんてん','へんどう']
	},
	{
		pronunciation:[['ベン','ビン'],['たより']],
		question:['音便','軽便','小便','小便','船便','前便','全便','大便','便乗','船便','不便','別便','便所','便法','便利','方便','利便'],
		kanji:['音便','軽便','小便','小便','船便','前便','全便','大便','便乗','船便','不便','別便','便所','便法','便利','方便','利便'],
		answer:['おんびん','けいべん','しょうべん','しょんべん','せんびん','ぜんびん','ぜんびん','だいべん','びんじょう','ふなびん','ふべん','べつびん','べんじょ','べんぽう','べんり','ほうべん','りべん']
	},
	{
		pronunciation:[['ホウ'],['つつむ']],
		question:['小包','内包','包囲','包帯','包丁'],
		kanji:['小包','内包','包囲','包帯','包丁'],
		answer:['こづつみ','ないほう','ほうい','ほうたい','ほうちょう']
	},
	{
		pronunciation:[['ホウ','ハッ','ホッ'],['']],
		question:['記法','工法','航法','合法','作法','司法','手法','商法','新法','順法','図法','説法','戦法','法度','不法','文法','兵法','便法','法案','法王','法科','法外','法学','法事','法人','法線','法治','法定','法的','方法','法要','法令','民法','無法','用法','立法','礼法','六法','話法'],
		kanji:['記法','工法','航法','合法','作法','司法','手法','商法','新法','順法','図法','説法','戦法','法度','不法','文法','兵法','便法','法案','法王','法科','法外','法学','法事','法人','法線','法治','法定','法的','方法','法要','法令','民法','無法','用法','立法','礼法','六法','話法'],
		answer:['きほう','こうほう','こうほう','ごうほう','さほう','しほう','しゅほう','しょうほう','しんぽう','じゅんぽう','ずほう','せっぽう','せんぽう','はっと','ふほう','ぶんぽう','へいほう','べんぽう','ほうあん','ほうおう','ほうか','ほうがい','ほうがく','ほうじ','ほうじん','ほうせん','ほうち','ほうてい','ほうてき','ほうほう','ほうよう','ほうれい','みんぽう','むほう','ようほう','りっぽう','れいほう','ろっぽう','わほう']
	},
	{
		pronunciation:[['ボウ','モウ'],['のぞむ']],
		question:['一望','願望','希望','失望','宿望','所望','信望','人望','声望','切望','待望','大望','熱望','本望','望遠','望遠','望外','名望','望月','野望','有望','要望'],
		kanji:['一望','願望','希望','失望','宿望','所望','信望','人望','声望','切望','待望','大望','熱望','本望','望遠','望遠','望外','名望','望月','野望','有望','要望'],
		answer:['いちぼう','がんぼう','きぼう','しつぼう','しゅくぼう','しょもう','しんぼう','じんぼう','せいぼう','せつぼう','たいぼう','たいぼう','ねつぼう','ほんもう','ぼうえん','ぼうえん','ぼうがい','めいぼう','もちづき','やぼう','ゆうぼう','ようぼう']
	},
	{
		pronunciation:[['ボク'],['まき']],
		question:['放牧','牧場','牧草','牧童','牧場','遊牧'],
		kanji:['放牧','牧場','牧草','牧童','牧場','遊牧'],
		answer:['ほうぼく','ぼくじょう','ぼくそう','ぼくどう','まきば','ゆうぼく']
	},
	{
		pronunciation:[['マツ','バツ'],['すえ']],
		question:['期末','行末','結末','月末','語末','始末','終末','週末','末長','末広','年末','場末','粉末','文末','末期','末世','末席','末筆','末期','末日','末代','末路'],
		kanji:['期末','行末','結末','月末','語末','始末','終末','週末','末長','末広','年末','場末','粉末','文末','末期','末世','末席','末筆','末期','末日','末代','末路'],
		answer:['きまつ','ぎょうまつ','けつまつ','げつまつ','ごまつ','しまつ','しゅうまつ','しゅうまつ','すえなが','すえひろ','ねんまつ','ばすえ','ふんまつ','ぶんまつ','まっき','まっせ','まっせき','まっぴつ','まつご','まつじつ','まつだい','まつろ']
	},
	{
		pronunciation:[['マン'],['みちる','みたす']],
		question:['円満','小満','不満','満員','満開','満願','満期','満月','満室','満車','満身','満場','満水','満席','満足','満足','満点','満面','未満','役満'],
		kanji:['円満','小満','不満','満員','満開','満願','満期','満月','満室','満車','満身','満場','満水','満席','満足','満足','満点','満面','未満','役満'],
		answer:['えんまん','しょうまん','ふまん','まんいん','まんかい','まんがん','まんき','まんげつ','まんしつ','まんしゃ','まんしん','まんじょう','まんすい','まんせき','まんぞく','まんぞく','まんてん','まんめん','みまん','やくまん']
	},
	{
		pronunciation:[['ミ'],['いまだ']],
		question:['未年','未開','未完','未決','未然','未知','未着','未定','未読','未必','未満','未明','未聞','未来','未練'],
		kanji:['未年','未開','未完','未決','未然','未知','未着','未定','未読','未必','未満','未明','未聞','未来','未練'],
		answer:['ひつじどし','みかい','みかん','みけつ','みぜん','みち','みちゃく','みてい','みどく','みひつ','みまん','みめい','みもん','みらい','みれん']
	},
	{
		pronunciation:[['ミン'],['たみ']],
		question:['官民','漁民','区民','県民','公民','国民','細民','市民','住民','人民','選民','村民','町民','島民','都民','農民','万民','文民','平民','民意','民家','民間','民芸','民主','民宿','民事','民生','民族','民放','民法','民有','民話','遊民'],
		kanji:['官民','漁民','区民','県民','公民','国民','細民','市民','住民','人民','選民','村民','町民','島民','都民','農民','万民','文民','平民','民意','民家','民間','民芸','民主','民宿','民事','民生','民族','民放','民法','民有','民話','遊民'],
		answer:['かんみん','ぎょみん','くみん','けんみん','こうみん','こくみん','さいみん','しみん','じゅうみん','じんみん','せんみん','そんみん','ちょうみん','とうみん','とみん','のうみん','ばんみん','ぶんみん','へいみん','みんい','みんか','みんかん','みんげい','みんしゅ','みんしゅく','みんじ','みんせい','みんぞく','みんぽう','みんぽう','みんゆう','みんわ','ゆうみん']
	},
	{
		pronunciation:[['ム','ブ'],['ない']],
		question:['有無','心無','南無','無事','無礼','無音','無害','無学','無期','無機','無休','無給','無口','無形','無欠','無芸','無根','無言','無産','無残','無色','無心','無心','無地','無実','無人','無数','無声','無線','無知','無茶','無茶','無電','無毒','無二','無念','無敗','無病','無風','無法','無味','無名','無用','無理','無料','無量','無力','無類'],
		kanji:['有無','心無','南無','無事','無礼','無音','無害','無学','無期','無機','無休','無給','無口','無形','無欠','無芸','無根','無言','無産','無残','無色','無心','無心','無地','無実','無人','無数','無声','無線','無知','無茶','無茶','無電','無毒','無二','無念','無敗','無病','無風','無法','無味','無名','無用','無理','無料','無量','無力','無類'],
		answer:['うむ','こころな','なむ','ぶじ','ぶれい','むおん','むがい','むがく','むき','むき','むきゅう','むきゅう','むくち','むけい','むけつ','むげい','むこん','むごん','むさん','むざん','むしょく','むしん','むしん','むじ','むじつ','むじん','むすう','むせい','むせん','むち','むちゃ','むちゃ','むでん','むどく','むに','むねん','むはい','むびょう','むふう','むほう','むみ','むめい','むよう','むり','むりょう','むりょう','むりょく','むるい']
	},
	{
		pronunciation:[['ヤク'],['']],
		question:['協約','公約','口約','集約','成約','節約','先約','特約','内約','売約','約定','約定','約数','約束','約分','要約','予約'],
		kanji:['協約','公約','口約','集約','成約','節約','先約','特約','内約','売約','約定','約定','約数','約束','約分','要約','予約'],
		answer:['きょうやく','こうやく','こうやく','しゅうやく','せいやく','せつやく','せんやく','とくやく','ないやく','ばいやく','やくじょう','やくじょう','やくすう','やくそく','やくぶん','ようやく','よやく']
	},
	{
		pronunciation:[['ユウ'],['いさむ']],
		question:['勇気'],
		kanji:['勇気'],
		answer:['ゆうき']
	},
	{
		pronunciation:[['ヨウ'],['いる','かなめ']],
		question:['強要','主要','所要','重要','大要','必要','不要','法要','要員','要求','要所','要人','要点','要望','要約','要録'],
		kanji:['強要','主要','所要','重要','大要','必要','不要','法要','要員','要求','要所','要人','要点','要望','要約','要録'],
		answer:['きょうよう','しゅよう','しょよう','じゅうよう','たいよう','ひつよう','ふよう','ほうよう','よういん','ようきゅう','ようしょ','ようじん','ようてん','ようぼう','ようやく','ようろく']
	},
	{
		pronunciation:[['ヨウ'],['やしなう']],
		question:['栄養','休養','教養','静養','養育','養子','養女','養生','養成','養父','養分','養老'],
		kanji:['栄養','休養','教養','静養','養育','養子','養女','養生','養成','養父','養分','養老'],
		answer:['えいよう','きゅうよう','きょうよう','せいよう','よういく','ようし','ようじょ','ようじょう','ようせい','ようふ','ようぶん','ようろう']
	},
	{
		pronunciation:[['ヨク'],['あびる','あびせる']],
		question:['温浴','入浴','浴衣','湯浴','浴室','浴場','浴用'],
		kanji:['温浴','入浴','浴衣','湯浴','浴室','浴場','浴用'],
		answer:['おんよく','にゅうよく','ゆかた','ゆよく','よくしつ','よくじょう','よくよう']
	},
	{
		pronunciation:[['リ'],['きく']],
		question:['元利','金利','月利','功利','高利','勝利','実利','戦利','低利','年利','福利','不利','便利','有利','利害','利器','利子','利息','利他','利点','利得','利発','利便','利用'],
		kanji:['元利','金利','月利','功利','高利','勝利','実利','戦利','低利','年利','福利','不利','便利','有利','利害','利器','利子','利息','利他','利点','利得','利発','利便','利用'],
		answer:['がんり','きんり','げつり','こうり','こうり','しょうり','じつり','せんり','ていり','ねんり','ふくり','ふり','べんり','ゆうり','りがい','りき','りし','りそく','りた','りてん','りとく','りはつ','りべん','りよう']
	},
	{
		pronunciation:[['リク'],['']],
		question:['海陸','上陸','大陸','着陸','内陸','北陸','陸運','陸軍','陸上','陸地','陸路','陸橋'],
		kanji:['海陸','上陸','大陸','着陸','内陸','北陸','陸運','陸軍','陸上','陸地','陸路','陸橋'],
		answer:['かいりく','じょうりく','たいりく','ちゃくりく','ないりく','ほくりく','りくうん','りくぐん','りくじょう','りくち','りくろ','りっきょう']
	},
	{
		pronunciation:[['リョウ'],['よい']],
		question:['改良','最良','順良','仲良','野良','不良','良好','良心','良人'],
		kanji:['改良','最良','順良','仲良','野良','不良','良好','良心','良人'],
		answer:['かいりょう','さいりょう','じゅんりょう','なかよ','のら','ふりょう','りょうこう','りょうしん','りょうじん']
	},
	{
		pronunciation:[['リョウ'],['']],
		question:['衣料','飲料','科料','顔料','給料','見料','原料','材料','食料','史料','試料','送料','無料','有料','料金','料理'],
		kanji:['衣料','飲料','科料','顔料','給料','見料','原料','材料','食料','史料','試料','送料','無料','有料','料金','料理'],
		answer:['いりょう','いんりょう','かりょう','がんりょう','きゅうりょう','けんりょう','げんりょう','ざいりょう','しょくりょう','しりょう','しりょう','そうりょう','むりょう','ゆうりょう','りょうきん','りょうり']
	},
	{
		pronunciation:[['リョウ'],['はかる']],
		question:['雨量','雲量','音量','器量','計量','小量','少量','思量','重量','水量','数量','声量','線量','大量','多量','定量','等量','度量','熱量','半量','物量','分量','無量','力量','流量','量感','量産','量子','量的'],
		kanji:['雨量','雲量','音量','器量','計量','小量','少量','思量','重量','水量','数量','声量','線量','大量','多量','定量','等量','度量','熱量','半量','物量','分量','無量','力量','流量','量感','量産','量子','量的'],
		answer:['うりょう','うんりょう','おんりょう','きりょう','けいりょう','しょうりょう','しょうりょう','しりょう','じゅうりょう','すいりょう','すうりょう','せいりょう','せんりょう','たいりょう','たりょう','ていりょう','とうりょう','どりょう','ねつりょう','はんりょう','ぶつりょう','ぶんりょう','むりょう','りきりょう','りゅうりょう','りょうかん','りょうさん','りょうし','りょうてき']
	},
	{
		pronunciation:[['リン'],['わ']],
		question:['内輪','外輪','首輪','競輪','五輪','車輪','大輪','二輪','年輪','指輪','輪唱','輪転'],
		kanji:['内輪','外輪','首輪','競輪','五輪','車輪','大輪','二輪','年輪','指輪','輪唱','輪転'],
		answer:['うちわ','がいりん','くびわ','けいりん','ごりん','しゃりん','たいりん','にりん','ねんりん','ゆびわ','りんしょう','りんてん']
	},
	{
		pronunciation:[['ルイ'],['']],
		question:['衣類','魚類','種類','書類','親類','人類','同類','部類','分類','無類','類語','類書','類焼','類字','類同','類別'],
		kanji:['衣類','魚類','種類','書類','親類','人類','同類','部類','分類','無類','類語','類書','類焼','類字','類同','類別'],
		answer:['いるい','ぎょるい','しゅるい','しょるい','しんるい','じんるい','どうるい','ぶるい','ぶんるい','むるい','るいご','るいしょ','るいしょう','るいじ','るいどう','るいべつ']
	},
	{
		pronunciation:[['レイ'],['']],
		question:['訓令','号令','省令','司令','指令','辞令','伝令','発令','法令','命令','令息'],
		kanji:['訓令','号令','省令','司令','指令','辞令','伝令','発令','法令','命令','令息'],
		answer:['くんれい','ごうれい','しょうれい','しれい','しれい','じれい','でんれい','はつれい','ほうれい','めいれい','れいそく']
	},
	{
		pronunciation:[['レイ'],['つめたい','ひえる','ひや','ひやす','ひやかす','さめる','さます']],
		question:['寒冷','急冷','強冷','空冷','秋冷','冷麦','冷夏','冷害','冷気','冷血','冷笑','冷水','冷静','冷戦','冷熱','冷風'],
		kanji:['寒冷','急冷','強冷','空冷','秋冷','冷麦','冷夏','冷害','冷気','冷血','冷笑','冷水','冷静','冷戦','冷熱','冷風'],
		answer:['かんれい','きゅうれい','きょうれい','くうれい','しゅうれい','ひやむぎ','れいか','れいがい','れいき','れいけつ','れいしょう','れいすい','れいせい','れいせん','れいねつ','れいふう']
	},
	{
		pronunciation:[['レイ'],['たとえる']],
		question:['一例','月例','好例','作例','実例','事例','先例','前例','通例','定例','特例','反例','文例','用例','例会','例外','例月','例題','例年','例文'],
		kanji:['一例','月例','好例','作例','実例','事例','先例','前例','通例','定例','特例','反例','文例','用例','例会','例外','例月','例題','例年','例文'],
		answer:['いちれい','げつれい','こうれい','さくれい','じつれい','じれい','せんれい','ぜんれい','つうれい','ていれい','とくれい','はんれい','ぶんれい','ようれい','れいかい','れいがい','れいげつ','れいだい','れいねん','れいぶん']
	},
	{
		pronunciation:[['レン'],['つらなる','つらねる','つれる']],
		question:['一連','関連','国連','連関','連記','連休','連係','連結','連言','連行','連語','連合','連作','連山','連勝','連日','連成','連戦','連想','連続','連体','連帯','連隊','連打','連中','連動','連年','連敗','連発','連名','連夜','連用','連立'],
		kanji:['一連','関連','国連','連関','連記','連休','連係','連結','連言','連行','連語','連合','連作','連山','連勝','連日','連成','連戦','連想','連続','連体','連帯','連隊','連打','連中','連動','連年','連敗','連発','連名','連夜','連用','連立'],
		answer:['いちれん','かんれん','こくれん','れんかん','れんき','れんきゅう','れんけい','れんけつ','れんげん','れんこう','れんご','れんごう','れんさく','れんざん','れんしょう','れんじつ','れんせい','れんせん','れんそう','れんぞく','れんたい','れんたい','れんたい','れんだ','れんちゅう','れんどう','れんねん','れんぱい','れんぱつ','れんめい','れんや','れんよう','れんりつ']
	},
	{
		pronunciation:[['ロウ'],['おいる','ふける']],
		question:['海老','古老','初老','大老','長老','不老','養老','老化','老後','老弱','老中','老人','老体','老夫','老父','老母','老木','老練'],
		kanji:['海老','古老','初老','大老','長老','不老','養老','老化','老後','老弱','老中','老人','老体','老夫','老父','老母','老木','老練'],
		answer:['えび','ころう','しょろう','たいろう','ちょうろう','ふろう','ようろう','ろうか','ろうご','ろうじゃく','ろうじゅう','ろうじん','ろうたい','ろうふ','ろうふ','ろうぼ','ろうぼく','ろうれん']
	},
	{
		pronunciation:[['ロウ'],['']],
		question:['苦労','功労','心労','足労','徒労','不労','労苦','労作','労使','労相','労組','労働','労力'],
		kanji:['苦労','功労','心労','足労','徒労','不労','労苦','労作','労使','労相','労組','労働','労力'],
		answer:['くろう','こうろう','しんろう','そくろう','とろう','ふろう','ろうく','ろうさく','ろうし','ろうしょう','ろうそ','ろうどう','ろうりょく']
	},
	{
		pronunciation:[['ロク'],['']],
		question:['記録','語録','集録','実録','図録','追録','登録','生録','付録','目録','要録','録音','録画'],
		kanji:['記録','語録','集録','実録','図録','追録','登録','生録','付録','目録','要録','録音','録画'],
		answer:['きろく','ごろく','しゅうろく','じつろく','ずろく','ついろく','とうろく','なまろく','ふろく','もくろく','ようろく','ろくおん','ろくが']
	}
];

const kanjiList = [
    ['一','右','雨','円','王','音','下','火','花','貝','学','気','九','休','玉','金','空','月','犬','見','五','口','校','左','三','山','子','四','糸','字','耳','七','車','手','十','出','女','小','上','森','人','水','正','生','青','夕','石','赤','千','川','先','早','草','足','村','大','男','竹','中','虫','町','天','田','土','二','日','入','年','白','八','百','文','木','本','名','目','立','力','林','六'],
    ['引','羽','雲','園','遠','何','科','夏','家','歌','画','回','会','海','絵','外','角','楽','活','間','丸','岩','顔','汽','記','帰','弓','牛','魚','京','強','教','近','兄','形','計','元','言','原','戸','古','午','後','語','工','公','広','交','光','考','行','高','黄','合','谷','国','黒','今','才','細','作','算','止','市','矢','姉','思','紙','寺','自','時','室','社','弱','首','秋','週','春','書','少','場','色','食','心','新','親','図','数','西','声','星','晴','切','雪','船','線','前','組','走','多','太','体','台','地','池','知','茶','昼','長','鳥','朝','直','通','弟','店','点','電','刀','冬','当','東','答','頭','同','道','読','内','南','肉','馬','売','買','麦','半','番','父','風','分','聞','米','歩','母','方','北','毎','妹','万','明','鳴','毛','門','夜','野','友','用','曜','来','里','理','話'],
    ['悪','安','暗','医','委','意','育','員','院','飲','運','泳','駅','央','横','屋','温','化','荷','界','開','階','寒','感','漢','館','岸','起','期','客','究','急','級','宮','球','去','橋','業','曲','局','銀','区','苦','具','君','係','軽','血','決','研','県','庫','湖','向','幸','港','号','根','祭','皿','仕','死','使','始','指','歯','詩','次','事','持','式','実','写','者','主','守','取','酒','受','州','拾','終','習','集','住','重','宿','所','暑','助','昭','消','商','章','勝','乗','植','申','身','神','真','深','進','世','整','昔','全','相','送','想','息','速','族','他','打','対','待','代','第','題','炭','短','談','着','注','柱','丁','帳','調','追','定','庭','笛','鉄','転','都','度','投','豆','島','湯','登','等','動','童','農','波','配','倍','箱','畑','発','反','坂','板','皮','悲','美','鼻','筆','氷','表','秒','病','品','負','部','服','福','物','平','返','勉','放','味','命','面','問','役','薬','由','油','有','遊','予','羊','洋','葉','陽','様','落','流','旅','両','緑','礼','列','練','路','和'],
    ['愛','案','以','衣','位','茨','印','英','栄','媛','塩','岡','億','加','果','貨','課','芽','賀','改','械','害','街','各','覚','潟','完','官','管','関','観','願','岐','希','季','旗','器','機','議','求','泣','給','挙','漁','共','協','鏡','競','極','熊','訓','軍','郡','群','径','景','芸','欠','結','建','健','験','固','功','好','香','候','康','佐','差','菜','最','埼','材','崎','昨','札','刷','察','参','産','散','残','氏','司','試','児','治','滋','辞','鹿','失','借','種','周','祝','順','初','松','笑','唱','焼','照','城','縄','臣','信','井','成','省','清','静','席','積','折','節','説','浅','戦','選','然','争','倉','巣','束','側','続','卒','孫','帯','隊','達','単','置','仲','沖','兆','低','底','的','典','伝','徒','努','灯','働','特','徳','栃','奈','梨','熱','念','敗','梅','博','阪','飯','飛','必','票','標','不','夫','付','府','阜','富','副','兵','別','辺','変','便','包','法','望','牧','末','満','未','民','無','約','勇','要','養','浴','利','陸','良','料','量','輪','類','令','冷','例','連','老','労','録'],
    ['圧','囲','移','因','永','営','衛','易','益','液','演','応','往','桜','可','仮','価','河','過','快','解','格','確','額','刊','幹','慣','眼','紀','基','寄','規','喜','技','義','逆','久','旧','救','居','許','境','均','禁','句','型','経','潔','件','険','検','限','現','減','故','個','護','効','厚','耕','航','鉱','構','興','講','告','混','査','再','災','妻','採','際','在','財','罪','殺','雑','酸','賛','士','支','史','志','枝','師','資','飼','示','似','識','質','舎','謝','授','修','述','術','準','序','招','証','象','賞','条','状','常','情','織','職','制','性','政','勢','精','製','税','責','績','接','設','絶','祖','素','総','造','像','増','則','測','属','率','損','貸','態','団','断','築','貯','張','停','提','程','適','統','堂','銅','導','得','毒','独','任','燃','能','破','犯','判','版','比','肥','非','費','備','評','貧','布','婦','武','復','複','仏','粉','編','弁','保','墓','報','豊','防','貿','暴','脈','務','夢','迷','綿','輸','余','容','略','留','領','歴'],
    ['胃','異','遺','域','宇','映','延','沿','恩','我','灰','拡','革','閣','割','株','干','巻','看','簡','危','机','揮','貴','疑','吸','供','胸','郷','勤','筋','系','敬','警','劇','激','穴','券','絹','権','憲','源','厳','己','呼','誤','后','孝','皇','紅','降','鋼','刻','穀','骨','困','砂','座','済','裁','策','冊','蚕','至','私','姿','視','詞','誌','磁','射','捨','尺','若','樹','収','宗','就','衆','従','縦','縮','熟','純','処','署','諸','除','承','将','傷','障','蒸','針','仁','垂','推','寸','盛','聖','誠','舌','宣','専','泉','洗','染','銭','善','奏','窓','創','装','層','操','蔵','臓','存','尊','退','宅','担','探','誕','段','暖','値','宙','忠','著','庁','頂','腸','潮','賃','痛','敵','展','討','党','糖','届','難','乳','認','納','脳','派','拝','背','肺','俳','班','晩','否','批','秘','俵','腹','奮','並','陛','閉','片','補','暮','宝','訪','亡','忘','棒','枚','幕','密','盟','模','訳','郵','優','預','幼','欲','翌','乱','卵','覧','裏','律','臨','朗','論']
];


window.onload = function () {

    if (window.name != "any") {
        location.reload();
        window.name = "any";
    } else {
        window.name = "";
    }

}

let kanjiGrade = 3;
let kanjiNumber = 0;
let passData = 0;
const quizLength = quiz.length;



//漢字の読みクイズのセットアップ
const setUpQuiz = (kanjiNumber, quiz) => {
	
	//指定学年に合わせて漢字ボタンを作成
	let kanjiCloneCounter = 0;
	while(kanjiCloneCounter < kanjiList[kanjiGrade].length-1){
		let kanjiClone = document.getElementsByClassName('kanjis');
		let cloneElement = kanjiClone[kanjiCloneCounter].cloneNode(true);
		kanjiClone[kanjiCloneCounter].after(cloneElement);
		kanjiCloneCounter++;
	}
	setKanji(kanjiGrade);
	
	//漢字の読みクイズをあるだけ作成
	let cloneCounter = 0;
		while(cloneCounter < quiz[kanjiNumber].question.length-1){
		let quizClone = document.getElementsByClassName('quiz_clone');
		let cloneElement = quizClone[cloneCounter].cloneNode(true);
		quizClone[cloneCounter].after(cloneElement);
		cloneCounter++;
	}

	const $question = document.getElementsByClassName('kanji-question');
	const $how_to_read = document.getElementsByClassName('how_to_read');
	
	//クイズ作成
	let inputCounter = 0;
	while(inputCounter < quiz[kanjiNumber].question.length){
		let inputToSplit = quiz[kanjiNumber].question[inputCounter].split(quiz[kanjiNumber].kanji[inputCounter]);
		$question[inputCounter].textContent = String(inputCounter+1) + '、 ' + inputToSplit[0] + ' [ ' + quiz[kanjiNumber].kanji[inputCounter] + ' ] ' + inputToSplit[1];
		$how_to_read[inputCounter].value = '';
		inputCounter++;
	}
	document.getElementById('correct_message').textContent = '';
	goToQuestion(kanjiGrade);
	hiddenRegisterBtn();
	setKanjiColor(kanjiGrade);
	changePassKanjiColor();
}
setUpQuiz(kanjiNumber, quiz);
document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];



//漢字の読みクイズの合否判定
function judge() {
	let score = 0;
	let quizLength = quiz[kanjiNumber].question.length;

	let answerToShow = document.getElementsByClassName('kanji-answer');

	for(let i = 0; i < quizLength; i++){
		let $answer = document.getElementsByClassName('how_to_read')[i].value;
		answerToShow[i].textContent = quiz[kanjiNumber].answer[i];
		if ($answer == quiz[kanjiNumber].answer[i]){
			score++;
		}
	}
	setTimeout(removeAnswer,3000);

	if (score == quizLength){
		document.getElementById('correct_message').textContent = '全問正解です！！（' + score + '点/' + quizLength + '点中）';
		$targetPassKanji = document.getElementById('kanji');
		passNumber = kanjiList[kanjiGrade].indexOf($targetPassKanji.textContent);
		passData = passNumber;

		$('#congratulations').css('visibility','visible');
		$('#registerButton').css('visibility','visible');
		openPopup(kanjiGrade, kanjiNumber);
	} else {
		document.getElementById('correct_message').textContent = '残念！もう一度やってみよう！！';
	}

}


//答えを消す
function removeAnswer(){
	let quizLength = quiz[kanjiNumber].question.length;
	let answerToShow = document.getElementsByClassName('kanji-answer');
	for(let i = 0; i < quizLength; i++){
		answerToShow[i].textContent = '';
	}
}


//各学年の漢字に色をつける
function setKanjiColor(kanjiGrade){
	let colorList = ['#ffdbdb','#ffdbed','#eddbff','#dbdbff','#dbedff','#ffeddb'];
	if(kanjiGrade == 0){
		changeColor(colorList[0]);
	}else if(kanjiGrade == 1){
		changeColor(colorList[1]);
	}else if(kanjiGrade == 2){
		changeColor(colorList[2]);
	}else if(kanjiGrade == 3){
		changeColor(colorList[3]);
	}else if(kanjiGrade == 4){
		changeColor(colorList[4]);
	}else if(kanjiGrade == 5){
		changeColor(colorList[5]);
	}
}

//色変え
function changeColor(color){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].style.backgroundColor = color;
	}
	setHover(color);
}

function setHover(color){
	let $mouseover = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $mouseover.length; i++){
		$mouseover[i].addEventListener('mouseover', function() {
			$mouseover[i].style.backgroundColor = 'white';
		});
		$mouseover[i].addEventListener('mouseleave', function() {
			$mouseover[i].style.backgroundColor = color;
		});
	}
}





//指定された学年の漢字をボタンに書き込む
function setKanji(kanjiGrade){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].textContent = kanjiList[kanjiGrade][i];
	}
	//漢字ボタンのクリック機能(漢字大きく表示)をオンにする
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].addEventListener('click', showKanji, false);
	}

}





//前回のクイズ削除
function removeQuiz(){
	removeAnswer();
	let cloneRemoveCounter = quiz[kanjiNumber].question.length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('quiz_clone');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
}





//前回の学年の漢字削除
function removeKanji(){
	let cloneRemoveCounter = kanjiList[kanjiGrade].length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('kanjis');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
	document.getElementsByClassName('kanjis')[0].textContent = kanjiList[kanjiGrade][0];
}




//漢字ボタンを押すと、その漢字を大きく表示
function showKanji(e){
	removeQuiz();
	removeKanji();

	$targetKanji = document.getElementById('kanji');
	$targetKanji.textContent = e.target.textContent;
	kanjiNumber = kanjiList[kanjiGrade].indexOf($targetKanji.textContent);

	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	document.getElementsByClassName('how_to_read')[0].value = '';
	
	setUpQuiz(kanjiNumber, quiz);
}




//学年変更
function changeGrade(grade){
	removeQuiz();
	removeKanji();

	kanjiGrade = grade;
	kanjiNumber = 0;

	if(grade == 1){
		quiz = quiz2;
		document.getElementById('grade').textContent = '小学校２年生の漢字';
	} else if(grade == 2){
		quiz = quiz3;
		document.getElementById('grade').textContent = '小学校３年生の漢字';
	} else if(grade == 3){
		quiz = quiz4;
		document.getElementById('grade').textContent = '小学校４年生の漢字';
	} else if(grade == 4){
		quiz = quiz5;
		document.getElementById('grade').textContent = '小学校５年生の漢字';
	} else if(grade == 5){
		quiz = quiz6;
		document.getElementById('grade').textContent = '小学校６年生の漢字';
	} else {
		quiz = quiz1;
		document.getElementById('grade').textContent = '小学校1年生の漢字';
	}
	
	setUpQuiz(kanjiNumber, quiz);
	document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	location.href = '#';
}





function hiddenRegisterBtn() {
    $('#congratulations').css('visibility','hidden');
	$('#registerButton').css('visibility','hidden');
}




//答え合わせボタンでjudge()発動
document.addEventListener('DOMContentLoaded', () => {
    const answerButton = document.getElementById("answerButton");
    answerButton.addEventListener("click", () => { judge() });
});

//学年変更ボタンでchangeGrade()発動
document.addEventListener('DOMContentLoaded', () => {
	const changeGradeButton = document.getElementsByClassName("changeGradeButton");
	for(let i = 0; i < changeGradeButton.length; i++){
    	changeGradeButton[i].addEventListener("click", () => { changeGrade(i) });
	}
});


//railsに正解した漢字のデータをpost
function postData(){

	$.ajax({
		url: '/kanji_quiz/update',
		type: 'GET',
		dataType: 'text',
		async: true,
		data: {
			grade: String(kanjiGrade),
			passData: String(passData),
		},
	});
}


//図鑑に登録ボタンでpostData()発動
let login_checker = document.getElementById('login_checker');
if(login_checker.textContent == 'true'){
	document.addEventListener('DOMContentLoaded', () => {
		const registerButton = document.getElementById("registerButton");
		registerButton.addEventListener("click", () => { postData() });
	});
}



//合格時のアニメーション
function openPopup(grade, num){
	let img = document.getElementById('image_file');
	let imgName = '/image' + grade + '_' + num + '.jpg';
	if(num > 8){
		imgName = '/dummy.jpg';
	}
	if(grade > 0){
		imgName = '/dummy.jpg';
	}
	img.src = imgName;
	document.querySelector('#image_file').animate(
		[
			{ transform: 'scale(0)' },
			{ transform: 'scale(2)' },
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(0, 0)'}
		],
		{
		  duration: 3000,
		  iterations: 1,
		  direction: 'normal'
		}
	);
	let popup = document.getElementById('js-popup');
	popup.classList.add('is-show');
	let passMessage = document.getElementById('pass_message');
	passMessage.style.visibility = 'visible';
}

function closePopUp() {
	let popup = document.getElementById('js-popup');
	let blackBg = document.getElementById('js-black-bg');
	let closeBtn = document.getElementById('js-close-btn');
	let img = document.getElementById('image_file');
	blackBg.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
	closeBtn.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
}
closePopUp();


let pageTop = document.getElementById('page_top');
pageTop.addEventListener('click', function() {
	$('html, body').animate({scrollTop:0},400);
});

function goToQuestion(kanjiGrade){
	let $goToQues = document.getElementsByClassName('kanjis');
	let $target = document.getElementById('hidden_block');
	for(let i = 0; i < kanjiList[kanjiGrade].length; i++){
		$goToQues[i].addEventListener('click', function() {
			$target.scrollIntoView({
				behavior: "smooth",
				block: "start",
				inline: "nearest"
			  });
		});
	}
}


//合格漢字の色を変える
function changePassKanjiColor(){
	//forで正解配列作る処理
	let login_checker = document.getElementById('login_checker');
	if(login_checker.textContent == 'true'){
		let $dummy = document.getElementsByClassName('dummy_data');
		let correctList = [];
		for(let i = 1; i < $dummy.length; i++){
			let splitData = $dummy[i].textContent.trim();
			splitData = splitData.slice(0,-1);
			let splitList = splitData.split(',');
			correctList.push(splitList);
		}
		

		let newColorList = ['#ff7f7f', '#ff7fbf', '#bf7fff', '#7f7fff', '#7fbfff', '#ffbf7f'];
		const $kanjiList = document.getElementsByClassName('kanjis');
		for(let i = 0; i < correctList[kanjiGrade].length; i++){
			let num = correctList[kanjiGrade][i];
			if(num != ''){
				$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];
				$kanjiList[num].addEventListener('mouseleave', function() {
					$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];	
				});
			}
		}
	}
	
}