const quiz = [
	{
		pronunciation:[['アク','オ'],['わるい']],
		question:['悪意','悪手','悪事','悪食','悪玉','悪人','悪病','悪名','悪名','悪役','悪友','悪用','悪化','悪漢','悪口','悪寒','悪気','悪口','悪者'],
		kanji:['悪意','悪手','悪事','悪食','悪玉','悪人','悪病','悪名','悪名','悪役','悪友','悪用','悪化','悪漢','悪口','悪寒','悪気','悪口','悪者'],
		answer:['あくい','あくしゅ','あくじ','あくじき','あくだま','あくにん','あくびょう','あくみょう','あくめい','あくやく','あくゆう','あくよう','あっか','あっかん','あっこう','おかん','わるぎ','わるくち','わるもの']
	},
	{
		pronunciation:[['アン'],['やすい']],
		question:['安心','安心','安住','安全','安息','安直','安定','安楽','円安','気安','公安','大安','平安','目安','安物'],
		kanji:['安心','安心','安住','安全','安息','安直','安定','安楽','円安','気安','公安','大安','平安','目安','安物'],
		answer:['あんしん','あんしん','あんじゅう','あんぜん','あんそく','あんちょく','あんてい','あんらく','えんやす','きやす','こうあん','たいあん','へいあん','めやす','やすもの']
	},
	{
		pronunciation:[['アン'],['くらい']],
		question:['暗雲','暗記','暗黒','暗号','暗算','暗室','暗所','暗色','暗中','明暗'],
		kanji:['暗雲','暗記','暗黒','暗号','暗算','暗室','暗所','暗色','暗中','明暗'],
		answer:['あんうん','あんき','あんこく','あんごう','あんざん','あんしつ','あんしょ','あんしょく','あんちゅう','めいあん']
	},
	{
		pronunciation:[['イ'],['']],
		question:['医院','医科','医学','医局','医業','医者','医書','医大','医薬','校医','女医','名医'],
		kanji:['医院','医科','医学','医局','医業','医者','医書','医大','医薬','校医','女医','名医'],
		answer:['いいん','いか','いがく','いきょく','いぎょう','いしゃ','いしょ','いだい','いやく','こうい','じょい','めいい']
	},
	{
		pronunciation:[['イ'],['ゆだねる']],
		question:['委員','委曲','委細'],
		kanji:['委員','委曲','委細'],
		answer:['いいん','いきょく','いさい']
	},
	{
		pronunciation:[['イ'],['']],
		question:['悪意','意外','意気','意見','意向','意思','意地','一意','意中','意図','意表','意味','強意','決意','語意','合意','作意','主意','深意','真意','他意','大意','注意','同意','表意','文意','本意','有意','用意'],
		kanji:['悪意','意外','意気','意見','意向','意思','意地','一意','意中','意図','意表','意味','強意','決意','語意','合意','作意','主意','深意','真意','他意','大意','注意','同意','表意','文意','本意','有意','用意'],
		answer:['あくい','いがい','いき','いけん','いこう','いし','いじ','いちい','いちゅう','いと','いひょう','いみ','きょうい','けつい','ごい','ごうい','さくい','しゅい','しんい','しんい','たい','たいい','ちゅうい','どうい','ひょうい','ぶんい','ほんい','ゆうい','ようい']
	},
	{
		pronunciation:[['イク'],['そだつ','そだてる','はぐくむ']],
		question:['教育','生育','体育','発育'],
		kanji:['教育','生育','体育','発育'],
		answer:['きょういく','せいいく','たいいく','はついく']
	},
	{
		pronunciation:[['イン'],['']],
		question:['委員','一員','員外','員数','駅員','会員','海員','係員','客員','館員','客員','教員','局員','工員','行員','社員','所員','乗員','人員','正員','船員','全員','定員','店員','動員','配員','部員','役員'],
		kanji:['委員','一員','員外','員数','駅員','会員','海員','係員','客員','館員','客員','教員','局員','工員','行員','社員','所員','乗員','人員','正員','船員','全員','定員','店員','動員','配員','部員','役員'],
		answer:['いいん','いちいん','いんがい','いんすう','えきいん','かいいん','かいいん','かかりいん','かくいん','かんいん','きゃくいん','きょういん','きょくいん','こういん','こういん','しゃいん','しょいん','じょういん','じんいん','せいいん','せんいん','ぜんいん','ていいん','てんいん','どういん','はいいん','ぶいん','やくいん']
	},
	{
		pronunciation:[['イン'],['']],
		question:['医院','院外','院生','院長','開院','下院','学院','書院','寺院','上院','通院','登院','入院','病院','両院'],
		kanji:['医院','院外','院生','院長','開院','下院','学院','書院','寺院','上院','通院','登院','入院','病院','両院'],
		answer:['いいん','いんがい','いんせい','いんちょう','かいいん','かいん','がくいん','しょいん','じいん','じょういん','つういん','とういん','にゅういん','びょういん','りょういん']
	},
	{
		pronunciation:[['イン'],['のむ']],
		question:['飲酒','飲食','飲用','飲物','飲茶'],
		kanji:['飲酒','飲食','飲用','飲物','飲茶'],
		answer:['いんしゅ','いんしょく','いんよう','のみもの','やむちゃ']
	},
	{
		pronunciation:[['ウン'],['はこぶ']],
		question:['運休','運行','運算','運送','運転','運動','運筆','運命','運用','海運','開運','気運','幸運','社運','命運'],
		kanji:['運休','運行','運算','運送','運転','運動','運筆','運命','運用','海運','開運','気運','幸運','社運','命運'],
		answer:['うんきゅう','うんこう','うんざん','うんそう','うんてん','うんどう','うんぴつ','うんめい','うんよう','かいうん','かいうん','きうん','こううん','しゃうん','めいうん']
	},
	{
		pronunciation:[['エイ'],['およぐ']],
		question:['遠泳','水泳','遊泳'],
		kanji:['遠泳','水泳','遊泳'],
		answer:['えんえい','すいえい','ゆうえい']
	},
	{
		pronunciation:[['エキ'],['']],
		question:['駅員','駅長','駅前','駅名'],
		kanji:['駅員','駅長','駅前','駅名'],
		answer:['えきいん','えきちょう','えきまえ','えきめい']
	},
	{
		pronunciation:[['オウ'],['']],
		question:['中央'],
		kanji:['中央'],
		answer:['ちゅうおう']
	},
	{
		pronunciation:[['オウ'],['よこ']],
		question:['横行','横着','横転','横顔','横切','横様','横手','横長','横道','横目'],
		kanji:['横行','横着','横転','横顔','横切','横様','横手','横長','横道','横目'],
		answer:['おうこう','おうちゃく','おうてん','よこがお','よこぎ','よこざま','よこて','よこなが','よこみち','よこめ']
	},
	{
		pronunciation:[['オク'],['や']],
		question:['屋外','屋上','屋内','母屋','家屋','紙屋','楽屋','小屋','酒屋','社屋','茶屋','長屋','花屋','古屋','部屋','本屋','母屋','屋形','屋号','屋台','宿屋','屋根'],
		kanji:['屋外','屋上','屋内','母屋','家屋','紙屋','楽屋','小屋','酒屋','社屋','茶屋','長屋','花屋','古屋','部屋','本屋','母屋','屋形','屋号','屋台','宿屋','屋根'],
		answer:['おくがい','おくじょう','おくない','おもや','かおく','かみや','がくや','こや','さかや','しゃおく','ちゃや','ながや','はなや','ふるや','へや','ほんや','もや','やかた','やごう','やたい','やどや','やね']
	},
	{
		pronunciation:[['オン'],['あたたか','あたたかい','あたたまる','あたためる']],
		question:['温室','温水','温度','温風','温和','気温','高温','室温','水温','体温'],
		kanji:['温室','温水','温度','温風','温和','気温','高温','室温','水温','体温'],
		answer:['おんしつ','おんすい','おんど','おんぷう','おんわ','きおん','こうおん','しつおん','すいおん','たいおん']
	},
	{
		pronunciation:[['カ','ケ'],['ばける','ばかす']],
		question:['悪化','羽化','開化','化学','化合','化石','感化','帰化','気化','強化','教化','化身','消化','深化','進化','石化','炭化','転化','電化','同化','道化','化学','美化','風化','分化','分化','文化','緑化'],
		kanji:['悪化','羽化','開化','化学','化合','化石','感化','帰化','気化','強化','教化','化身','消化','深化','進化','石化','炭化','転化','電化','同化','道化','化学','美化','風化','分化','分化','文化','緑化'],
		answer:['あっか','うか','かいか','かがく','かごう','かせき','かんか','きか','きか','きょうか','きょうか','けしん','しょうか','しんか','しんか','せきか','たんか','てんか','でんか','どうか','どうけ','ばけがく','びか','ふうか','ぶんか','ぶんか','ぶんか','りょっか']
	},
	{
		pronunciation:[['カ'],['に']],
		question:['重荷','荷重','荷電','集荷','出荷','電荷','荷車','荷主','荷物','入荷','負荷','船荷'],
		kanji:['重荷','荷重','荷電','集荷','出荷','電荷','荷車','荷主','荷物','入荷','負荷','船荷'],
		answer:['おもに','かじゅう','かでん','しゅうか','しゅっか','でんか','にぐるま','にぬし','にもつ','にゅうか','ふか','ふなに']
	},
	{
		pronunciation:[['カイ'],['']],
		question:['界面','下界','外界','学界','業界','下界','外界','三界','上界','世界','他界'],
		kanji:['界面','下界','外界','学界','業界','下界','外界','三界','上界','世界','他界'],
		answer:['かいめん','かかい','がいかい','がっかい','ぎょうかい','げかい','げかい','さんがい','じょうかい','せかい','たかい']
	},
	{
		pronunciation:[['カイ'],['ひらく','ひらける','あく','あける']],
		question:['開院','開運','開園','開化','開花','開会','開館','開局','開業','開校','開港','開国','開始','開室','開場','開通','開店','開発','開平','開放','開明','開門','公開','切開','全開','打開','見開'],
		kanji:['開院','開運','開園','開化','開花','開会','開館','開局','開業','開校','開港','開国','開始','開室','開場','開通','開店','開発','開平','開放','開明','開門','公開','切開','全開','打開','見開'],
		answer:['かいいん','かいうん','かいえん','かいか','かいか','かいかい','かいかん','かいきょく','かいぎょう','かいこう','かいこう','かいこく','かいし','かいしつ','かいじょう','かいつう','かいてん','かいはつ','かいへい','かいほう','かいめい','かいもん','こうかい','せっかい','ぜんかい','だかい','みひら']
	},
	{
		pronunciation:[['カイ'],['']],
		question:['音階','階下','階級','階上','階数','階調','地階','二階'],
		kanji:['音階','階下','階級','階上','階数','階調','地階','二階'],
		answer:['おんかい','かいか','かいきゅう','かいじょう','かいすう','かいちょう','ちかい','にかい']
	},
	{
		pronunciation:[['カン'],['さむい']],
		question:['悪寒','寒気','寒村','寒中','寒波','寒風','寒流','寒気','小寒','大寒'],
		kanji:['悪寒','寒気','寒村','寒中','寒波','寒風','寒流','寒気','小寒','大寒'],
		answer:['おかん','かんき','かんそん','かんちゅう','かんぱ','かんぷう','かんりゅう','さむけ','しょうかん','だいかん']
	},
	{
		pronunciation:[['カン'],['']],
		question:['音感','感化','感光','感心','感想','感知','感電','感度','感動','感服','交感','語感','所感','実感','多感','直感','同感','反感','万感','予感','流感'],
		kanji:['音感','感化','感光','感心','感想','感知','感電','感度','感動','感服','交感','語感','所感','実感','多感','直感','同感','反感','万感','予感','流感'],
		answer:['おんかん','かんか','かんこう','かんしん','かんそう','かんち','かんでん','かんど','かんどう','かんぷく','こうかん','ごかん','しょかん','じっかん','たかん','ちょっかん','どうかん','はんかん','ばんかん','よかん','りゅうかん']
	},
	{
		pronunciation:[['カン'],['']],
		question:['悪漢','漢字','漢文','漢方','漢和'],
		kanji:['悪漢','漢字','漢文','漢方','漢和'],
		answer:['あっかん','かんじ','かんぶん','かんぽう','かんわ']
	},
	{
		pronunciation:[['カン'],['やかた']],
		question:['会館','開館','館員','館長','館内','休館','新館','全館','館内','分館','本館','洋館','来館','旅館'],
		kanji:['会館','開館','館員','館長','館内','休館','新館','全館','館内','分館','本館','洋館','来館','旅館'],
		answer:['かいかん','かいかん','かんいん','かんちょう','かんない','きゅうかん','しんかん','ぜんかん','たてうち','ぶんかん','ほんかん','ようかん','らいかん','りょかん']
	},
	{
		pronunciation:[['ガン'],['きし']],
		question:['右岸','海岸','対岸'],
		kanji:['右岸','海岸','対岸'],
		answer:['うがん','かいがん','たいがん']
	},
	{
		pronunciation:[['キ'],['おきる','おこる','おこす']],
		question:['起業','起工','起算','起草','起点','起動','起筆','起用','起立','決起','生起','想起','発起'],
		kanji:['起業','起工','起算','起草','起点','起動','起筆','起用','起立','決起','生起','想起','発起'],
		answer:['きぎょう','きこう','きさん','きそう','きてん','きどう','きひつ','きよう','きりつ','けっき','せいき','そうき','ほっき']
	},
	{
		pronunciation:[['キ','ゴ'],['']],
		question:['一期','雨期','会期','夏期','上期','学期','期間','期首','期日','期待','後期','工期','今期','始期','死期','下期','終期','所期','時期','次期','前期','早期','短期','中期','長期','定期','冬期','当期','同期','年期','半期','毎期','予期','来期'],
		kanji:['一期','雨期','会期','夏期','上期','学期','期間','期首','期日','期待','後期','工期','今期','始期','死期','下期','終期','所期','時期','次期','前期','早期','短期','中期','長期','定期','冬期','当期','同期','年期','半期','毎期','予期','来期'],
		answer:['いっき','うき','かいき','かき','かみき','がっき','きかん','きしゅ','きじつ','きたい','こうき','こうき','こんき','しき','しき','しもき','しゅうき','しょき','じき','じき','ぜんき','そうき','たんき','ちゅうき','ちょうき','ていき','とうき','とうき','どうき','ねんき','はんき','まいき','よき','らいき']
	},
	{
		pronunciation:[['キャク','カク'],['']],
		question:['客員','客死','客足','客員','客死','客室','客車','客人','客船','客土','客間','乗客','船客','客人','来客','旅客'],
		kanji:['客員','客死','客足','客員','客死','客室','客車','客人','客船','客土','客間','乗客','船客','客人','来客','旅客'],
		answer:['かくいん','かくし','きゃくあし','きゃくいん','きゃくし','きゃくしつ','きゃくしゃ','きゃくじん','きゃくせん','きゃくど','きゃくま','じょうきゃく','せんきゃく','まろうど','らいきゃく','りょかく']
	},
	{
		pronunciation:[['キュウ'],['きわめる']],
		question:['究明','研究','追究'],
		kanji:['究明','研究','追究'],
		answer:['きゅうめい','けんきゅう','ついきゅう']
	},
	{
		pronunciation:[['キュウ'],['いそぐ']],
		question:['火急','急行','急死','急所','急進','急送','急速','急転','急場','急病','急用','急落','急流','早急','早急','速急'],
		kanji:['火急','急行','急死','急所','急進','急送','急速','急転','急場','急病','急用','急落','急流','早急','早急','速急'],
		answer:['かきゅう','きゅうこう','きゅうし','きゅうしょ','きゅうしん','きゅうそう','きゅうそく','きゅうてん','きゅうば','きゅうびょう','きゅうよう','きゅうらく','きゅうりゅう','さっきゅう','そうきゅう','そっきゅう']
	},
	{
		pronunciation:[['キュウ'],['']],
		question:['階級','下級','学級','級数','級長','級友','高級','進級','上級','中級','等級','同級'],
		kanji:['階級','下級','学級','級数','級長','級友','高級','進級','上級','中級','等級','同級'],
		answer:['かいきゅう','かきゅう','がっきゅう','きゅうすう','きゅうちょう','きゅうゆう','こうきゅう','しんきゅう','じょうきゅう','ちゅうきゅう','とうきゅう','どうきゅう']
	},
	{
		pronunciation:[['キュウ','グウ','ク'],['みや']],
		question:['王宮','宮中','後宮','子宮','新宮','神宮','神宮'],
		kanji:['王宮','宮中','後宮','子宮','新宮','神宮','神宮'],
		answer:['おうきゅう','きゅうちゅう','こうきゅう','しきゅう','しんぐう','じんぐう','じんぐう']
	},
	{
		pronunciation:[['キュウ'],['たま']],
		question:['気球','球形','球根','球場','球体','球面','血球','水球','地球','庭球','電球','投球','肉球','白球','半球','豆球','野球'],
		kanji:['気球','球形','球根','球場','球体','球面','血球','水球','地球','庭球','電球','投球','肉球','白球','半球','豆球','野球'],
		answer:['ききゅう','きゅうけい','きゅうこん','きゅうじょう','きゅうたい','きゅうめん','けっきゅう','すいきゅう','ちきゅう','ていきゅう','でんきゅう','とうきゅう','にくきゅう','はっきゅう','はんきゅう','まめきゅう','やきゅう']
	},
	{
		pronunciation:[['キョ','コ'],['さる']],
		question:['去年','去来','死去','消去'],
		kanji:['去年','去来','死去','消去'],
		answer:['きょねん','きょらい','しきょ','しょうきょ']
	},
	{
		pronunciation:[['キョウ'],['はし']],
		question:['石橋','大橋','橋台','新橋','鉄橋'],
		kanji:['石橋','大橋','橋台','新橋','鉄橋'],
		answer:['いしばし','おおはし','きょうだい','しんばし','てっきょう']
	},
	{
		pronunciation:[['ギョウ','ゴウ'],['わざ']],
		question:['医業','開業','家業','軽業','学業','起業','休業','業界','業者','工業','作業','始業','社業','終業','商業','所業','仕業','事業','実業','力業','転業','同業','生業','農業','分業','本業','林業'],
		kanji:['医業','開業','家業','軽業','学業','起業','休業','業界','業者','工業','作業','始業','社業','終業','商業','所業','仕業','事業','実業','力業','転業','同業','生業','農業','分業','本業','林業'],
		answer:['いぎょう','かいぎょう','かぎょう','かるわざ','がくぎょう','きぎょう','きゅうぎょう','ぎょうかい','ぎょうしゃ','こうぎょう','さぎょう','しぎょう','しゃぎょう','しゅうぎょう','しょうぎょう','しょぎょう','しわざ','じぎょう','じつぎょう','ちからわざ','てんぎょう','どうぎょう','なりわい','のうぎょう','ぶんぎょう','ほんぎょう','りんぎょう']
	},
	{
		pronunciation:[['キョク'],['まがる','まげる']],
		question:['委曲','大曲','歌曲','曲線','曲調','曲面','曲目','曲者','作曲','終曲','新曲','全曲','名曲'],
		kanji:['委曲','大曲','歌曲','曲線','曲調','曲面','曲目','曲者','作曲','終曲','新曲','全曲','名曲'],
		answer:['いきょく','おおまがり','かきょく','きょくせん','きょくちょう','きょくめん','きょくもく','くせもの','さっきょく','しゅうきょく','しんきょく','ぜんきょく','めいきょく']
	},
	{
		pronunciation:[['キョク'],['']],
		question:['医局','開局','外局','局員','局所','局地','局長','局内','局番','局部','局面','終局','時局','全局','対局','大局','他局','当局','内局','部局','本局','薬局'],
		kanji:['医局','開局','外局','局員','局所','局地','局長','局内','局番','局部','局面','終局','時局','全局','対局','大局','他局','当局','内局','部局','本局','薬局'],
		answer:['いきょく','かいきょく','がいきょく','きょくいん','きょくしょ','きょくち','きょくちょう','きょくない','きょくばん','きょくぶ','きょくめん','しゅうきょく','じきょく','ぜんきょく','たいきょく','たいきょく','たきょく','とうきょく','ないきょく','ぶきょく','ほんきょく','やっきょく']
	},
	{
		pronunciation:[['ギン'],['']],
		question:['金銀','銀色','銀行','銀山','水銀','都銀','洋銀','路銀'],
		kanji:['金銀','銀色','銀行','銀山','水銀','都銀','洋銀','路銀'],
		answer:['きんぎん','ぎんいろ','ぎんこう','ぎんざん','すいぎん','とぎん','ようぎん','ろぎん']
	},
	{
		pronunciation:[['ク'],['']],
		question:['学区','区画','区間','区切','区長','区内','区分','区立','校区','市区','全区','地区'],
		kanji:['学区','区画','区間','区切','区長','区内','区分','区立','校区','市区','全区','地区'],
		answer:['がっく','くかく','くかん','くぎ','くちょう','くない','くぶん','くりつ','こうく','しく','ぜんく','ちく']
	},
	{
		pronunciation:[['ク'],['くるしい','くるしむ','くるしめる','にがい','にがる']],
		question:['苦学','苦行','苦言','苦心','苦肉','苦楽','苦手'],
		kanji:['苦学','苦行','苦言','苦心','苦肉','苦楽','苦手'],
		answer:['くがく','くぎょう','くげん','くしん','くにく','くらく','にがて']
	},
	{
		pronunciation:[['グ'],['']],
		question:['家具','金具','具合','具申','具体','工具','道具','農具','文具','用具'],
		kanji:['家具','金具','具合','具申','具体','工具','道具','農具','文具','用具'],
		answer:['かぐ','かなぐ','ぐあい','ぐしん','ぐたい','こうぐ','どうぐ','のうぐ','ぶんぐ','ようぐ']
	},
	{
		pronunciation:[['クン'],['きみ']],
		question:['君主','主君'],
		kanji:['君主','主君'],
		answer:['くんしゅ','しゅくん']
	},
	{
		pronunciation:[['ケイ'],['かかる','かかり']],
		question:['係員','係長','係数'],
		kanji:['係員','係長','係数'],
		answer:['かかりいん','かかりちょう','けいすう']
	},
	{
		pronunciation:[['ケイ'],['かるい','かろやか']],
		question:['足軽','軽業','気軽','軽食','軽重','軽水','軽重','軽度','軽油','手軽','身軽'],
		kanji:['足軽','軽業','気軽','軽食','軽重','軽水','軽重','軽度','軽油','手軽','身軽'],
		answer:['あしがる','かるわざ','きがる','けいしょく','けいじゅう','けいすい','けいちょう','けいど','けいゆ','てがる','みがる']
	},
	{
		pronunciation:[['ケツ'],['ち']],
		question:['血球','血行','血色','血相','血族','血流','止血','出血','心血','全血','血走','鼻血','流血'],
		kanji:['血球','血行','血色','血相','血族','血流','止血','出血','心血','全血','血走','鼻血','流血'],
		answer:['けっきゅう','けっこう','けっしょく','けっそう','けつぞく','けつりゅう','しけつ','しゅっけつ','しんけつ','ぜんけつ','ちばし','はなぢ','りゅうけつ']
	},
	{
		pronunciation:[['ケツ'],['きめる','きまる']],
		question:['決起','決行','決算','決死','決勝','決心','決着','決定','決意','自決','先決','対決','表決'],
		kanji:['決起','決行','決算','決死','決勝','決心','決着','決定','決意','自決','先決','対決','表決'],
		answer:['けっき','けっこう','けっさん','けっし','けっしょう','けっしん','けっちゃく','けってい','けつい','じけつ','せんけつ','たいけつ','ひょうけつ']
	},
	{
		pronunciation:[['ケン'],['とぐ']],
		question:['研究','中研'],
		kanji:['研究','中研'],
		answer:['けんきゅう','ちゅうけん']
	},
	{
		pronunciation:[['ケン'],['']],
		question:['近県','県下','県会','県外','県人','県道','県内','県立','全県','他県','同県','両県'],
		kanji:['近県','県下','県会','県外','県人','県道','県内','県立','全県','他県','同県','両県'],
		answer:['きんけん','けんか','けんかい','けんがい','けんじん','けんどう','けんない','けんりつ','ぜんけん','たけん','どうけん','りょうけん']
	},
	{
		pronunciation:[['コ','ク'],['']],
		question:['金庫','公庫','国庫','国庫','車庫','出庫','書庫','入庫','文庫'],
		kanji:['金庫','公庫','国庫','国庫','車庫','出庫','書庫','入庫','文庫'],
		answer:['きんこ','こうこ','こくこ','こっこ','しゃこ','しゅっこ','しょこ','にゅうこ','ぶんこ']
	},
	{
		pronunciation:[['コ'],['みずうみ']],
		question:['湖水'],
		kanji:['湖水'],
		answer:['こすい']
	},
	{
		pronunciation:[['コウ'],['むく','むける','むかう','むこう']],
		question:['意向','一向','上向','外向','向学','向暑','向上','指向','仕向','出向','転向','出向','動向','内向','日向','風向','方向','真向','見向'],
		kanji:['意向','一向','上向','外向','向学','向暑','向上','指向','仕向','出向','転向','出向','動向','内向','日向','風向','方向','真向','見向'],
		answer:['いこう','いっこう','うわむ','がいこう','こうがく','こうしょ','こうじょう','しこう','しむけ','しゅっこう','てんこう','でむ','どうこう','ないこう','ひなた','ふうこう','ほうこう','まっこう','みむ']
	},
	{
		pronunciation:[['コウ'],['さいわい','しあわせ','さち']],
		question:['幸運','幸福','多幸'],
		kanji:['幸運','幸福','多幸'],
		answer:['こううん','こうふく','たこう']
	},
	{
		pronunciation:[['コウ'],['みなと']],
		question:['海港','開港','帰港','空港','港内','入港','母港'],
		kanji:['海港','開港','帰港','空港','港内','入港','母港'],
		answer:['かいこう','かいこう','きこう','くうこう','こうない','にゅうこう','ぼこう']
	},
	{
		pronunciation:[['ゴウ'],['さけぶ']],
		question:['暗号','記号','元号','根号','号外','号数','商号','次号','調号','等号','年号','番号','屋号'],
		kanji:['暗号','記号','元号','根号','号外','号数','商号','次号','調号','等号','年号','番号','屋号'],
		answer:['あんごう','きごう','げんごう','こんごう','ごうがい','ごうすう','しょうごう','じごう','ちょうごう','とうごう','ねんごう','ばんごう','やごう']
	},
	{
		pronunciation:[['コン'],['ね']],
		question:['球根','心根','根気','根号','根本','根毛','歯根','実根','大根','男根','同根','根強','根深','根深','根本','羽根','屋根'],
		kanji:['球根','心根','根気','根号','根本','根毛','歯根','実根','大根','男根','同根','根強','根深','根深','根本','羽根','屋根'],
		answer:['きゅうこん','こころね','こんき','こんごう','こんぽん','こんもう','しこん','じっこん','だいこん','だんこん','どうこん','ねづよ','ねぶか','ねぶか','ねもと','はね','やね']
	},
	{
		pronunciation:[['サイ'],['まつる','まつり']],
		question:['祭日','祭礼'],
		kanji:['祭日','祭礼'],
		answer:['さいじつ','さいれい']
	},
	{
		pronunciation:[[''],['さら']],
		question:['皿'],
		kanji:['皿'],
		answer:['さら']
	},
	{
		pronunciation:[['シ','ジ'],['つかえる']],
		question:['仕上','仕打','仕方','仕切','仕組','仕草','仕事','仕向','仕様','仕業'],
		kanji:['仕上','仕打','仕方','仕切','仕組','仕草','仕事','仕向','仕様','仕業'],
		answer:['しあげ','しうち','しかた','しき','しく','しぐさ','しごと','しむけ','しよう','しわざ']
	},
	{
		pronunciation:[['シ'],['しぬ']],
		question:['客死','客死','急死','決死','死角','死期','死去','死後','死語','死者','死守','死線','死体','死人','死人','死力','水死','生死','病死'],
		kanji:['客死','客死','急死','決死','死角','死期','死去','死後','死語','死者','死守','死線','死体','死人','死人','死力','水死','生死','病死'],
		answer:['かくし','きゃくし','きゅうし','けっし','しかく','しき','しきょ','しご','しご','ししゃ','ししゅ','しせん','したい','しにん','しびと','しりょく','すいし','せいし','びょうし']
	},
	{
		pronunciation:[['シ'],['つかう']],
		question:['公使','行使','使役','使者','使命','使用','大使','天使'],
		kanji:['公使','行使','使役','使者','使命','使用','大使','天使'],
		answer:['こうし','こうし','しえき','ししゃ','しめい','しよう','たいし','てんし']
	},
	{
		pronunciation:[['シ'],['はじめる','はじまる']],
		question:['開始','原始','始期','始業','始終','始点','始動','始発','終始','年始'],
		kanji:['開始','原始','始期','始業','始終','始点','始動','始発','終始','年始'],
		answer:['かいし','げんし','しき','しぎょう','しじゅう','してん','しどう','しはつ','しゅうし','ねんし']
	},
	{
		pronunciation:[['シ'],['ゆび','さす']],
		question:['親指','薬指','小指','指図','指向','指数','指定','指南','指名','指命','食指','中指','目指','目指','指先'],
		kanji:['親指','薬指','小指','指図','指向','指数','指定','指南','指名','指命','食指','中指','目指','目指','指先'],
		answer:['おやゆび','くすりゆび','こゆび','さしず','しこう','しすう','してい','しなん','しめい','しめい','しょくし','なかゆび','めざ','もくし','ゆびさき']
	},
	{
		pronunciation:[['シ'],['は']],
		question:['犬歯','歯科','歯学','歯根','歯石','歯車','前歯','虫歯','門歯'],
		kanji:['犬歯','歯科','歯学','歯根','歯石','歯車','前歯','虫歯','門歯'],
		answer:['けんし','しか','しがく','しこん','しせき','はぐるま','まえば','むしば','もんし']
	},
	{
		pronunciation:[['シ'],['']],
		question:['詩歌','詩集','詩人','詩文'],
		kanji:['詩歌','詩集','詩人','詩文'],
		answer:['しいか','ししゅう','しじん','しぶん']
	},
	{
		pronunciation:[['ジ','シ'],['つぐ','つぎ']],
		question:['相次','一次','月次','高次','次第','次回','次期','次兄','次元','次号','次子','次章','次女','次数','次代','次長','次点','次男','二次','日次','年次','目次','野次','野次'],
		kanji:['相次','一次','月次','高次','次第','次回','次期','次兄','次元','次号','次子','次章','次女','次数','次代','次長','次点','次男','二次','日次','年次','目次','野次','野次'],
		answer:['あいつ','いちじ','げつじ','こうじ','しだい','じかい','じき','じけい','じげん','じごう','じし','じしょう','じじょ','じすう','じだい','じちょう','じてん','じなん','にじ','にちじ','ねんじ','もくじ','やじ','やじ']
	},
	{
		pronunciation:[['ジ','ズ'],['こと']],
		question:['悪事','一事','家事','火事','記事','行事','工事','国事','作事','仕事','主事','商事','食事','事業','事後','時事','事実','事前','事物','事由','人事','世事','他事','多事','大事','知事','何事','万事','人事','返事','見事','物事','用事','理事'],
		kanji:['悪事','一事','家事','火事','記事','行事','工事','国事','作事','仕事','主事','商事','食事','事業','事後','時事','事実','事前','事物','事由','人事','世事','他事','多事','大事','知事','何事','万事','人事','返事','見事','物事','用事','理事'],
		answer:['あくじ','いちじ','かじ','かじ','きじ','ぎょうじ','こうじ','こくじ','さくじ','しごと','しゅじ','しょうじ','しょくじ','じぎょう','じご','じじ','じじつ','じぜん','じぶつ','じゆう','じんじ','せじ','たじ','たじ','だいじ','ちじ','なにごと','ばんじ','ひとごと','へんじ','みごと','ものごと','ようじ','りじ']
	},
	{
		pronunciation:[['ジ'],['もつ']],
		question:['気持','子持','所持','持病'],
		kanji:['気持','子持','所持','持病'],
		answer:['きもち','こもち','しょじ','じびょう']
	},
	{
		pronunciation:[['シキ'],['']],
		question:['一式','形式','公式','古式','式場','式部','書式','新式','数式','図式','正式','等式','方式','本式','様式','洋式','和式'],
		kanji:['一式','形式','公式','古式','式場','式部','書式','新式','数式','図式','正式','等式','方式','本式','様式','洋式','和式'],
		answer:['いっしき','けいしき','こうしき','こしき','しきじょう','しきぶ','しょしき','しんしき','すうしき','ずしき','せいしき','とうしき','ほうしき','ほんしき','ようしき','ようしき','わしき']
	},
	{
		pronunciation:[['ジツ'],['みのる']],
		question:['口実','写実','真実','事実','実家','実感','実兄','実行','実根','実作','実子','実写','実習','実数','実線','実体','実地','実直','実父','実業','実物','実母','実名','実用','実力','実話','切実','着実','内実','名実'],
		kanji:['口実','写実','真実','事実','実家','実感','実兄','実行','実根','実作','実子','実写','実習','実数','実線','実体','実地','実直','実父','実業','実物','実母','実名','実用','実力','実話','切実','着実','内実','名実'],
		answer:['こうじつ','しゃじつ','しんじつ','じじつ','じっか','じっかん','じっけい','じっこう','じっこん','じっさく','じっし','じっしゃ','じっしゅう','じっすう','じっせん','じったい','じっち','じっちょく','じっぷ','じつぎょう','じつぶつ','じつぼ','じつめい','じつよう','じつりょく','じつわ','せつじつ','ちゃくじつ','ないじつ','めいじつ']
	},
	{
		pronunciation:[['シャ'],['うつす','うつる']],
		question:['写植','写真','写実','写生','書写','実写','転写','筆写'],
		kanji:['写植','写真','写実','写生','書写','実写','転写','筆写'],
		answer:['しゃしょく','しゃしん','しゃじつ','しゃせい','しょしゃ','じっしゃ','てんしゃ','ひっしゃ']
	},
	{
		pronunciation:[['シャ'],['もの']],
		question:['医者','王者','学者','記者','強者','業者','曲者','後者','作者','使者','死者','勝者','弱者','前者','走者','他者','打者','長者','読者','何者','筆者','役者','両者','話者','悪者'],
		kanji:['医者','王者','学者','記者','強者','業者','曲者','後者','作者','使者','死者','勝者','弱者','前者','走者','他者','打者','長者','読者','何者','筆者','役者','両者','話者','悪者'],
		answer:['いしゃ','おうじゃ','がくしゃ','きしゃ','きょうしゃ','ぎょうしゃ','くせもの','こうしゃ','さくしゃ','ししゃ','ししゃ','しょうしゃ','じゃくしゃ','ぜんしゃ','そうしゃ','たしゃ','だしゃ','ちょうじゃ','どくしゃ','なにもの','ひっしゃ','やくしゃ','りょうしゃ','わしゃ','わるもの']
	},
	{
		pronunciation:[['シュ','ス'],['ぬし','おも']],
		question:['馬主','神主','君主','戸主','主意','主君','主計','主語','主食','主事','主人','主体','主題','主筆','主文','主役','主流','主力','自主','地主','店主','当主','荷主','馬主','家主'],
		kanji:['馬主','神主','君主','戸主','主意','主君','主計','主語','主食','主事','主人','主体','主題','主筆','主文','主役','主流','主力','自主','地主','店主','当主','荷主','馬主','家主'],
		answer:['うまぬし','かんぬし','くんしゅ','こしゅ','しゅい','しゅくん','しゅけい','しゅご','しゅしょく','しゅじ','しゅじん','しゅたい','しゅだい','しゅひつ','しゅぶん','しゅやく','しゅりゅう','しゅりょく','じしゅ','じぬし','てんしゅ','とうしゅ','にぬし','ばぬし','やぬし']
	},
	{
		pronunciation:[['シュ','ス'],['まもる','もり']],
		question:['子守','死守','見守'],
		kanji:['子守','死守','見守'],
		answer:['こもり','ししゅ','みまも']
	},
	{
		pronunciation:[['シュ'],['とる']],
		question:['受取','書取','気取','取水','進取','先取','頭取','取消','取調','取立','取引','名取','見取'],
		kanji:['受取','書取','気取','取水','進取','先取','頭取','取消','取調','取立','取引','名取','見取'],
		answer:['うけとり','かきとり','きど','しゅすい','しんしゅ','せんしゅ','とうどり','とりけし','とりしらべ','とりたて','とりひき','なとり','みと']
	},
	{
		pronunciation:[['シュ'],['さけ','さか']],
		question:['飲酒','原酒','酒場','酒屋','新酒','地酒','美酒','洋酒'],
		kanji:['飲酒','原酒','酒場','酒屋','新酒','地酒','美酒','洋酒'],
		answer:['いんしゅ','げんしゅ','さかば','さかや','しんしゅ','じざけ','びしゅ','ようしゅ']
	},
	{
		pronunciation:[['ジュ'],['うける','うかる']],
		question:['受取','受身','受注','受動','受理','送受','引受'],
		kanji:['受取','受身','受注','受動','受理','送受','引受'],
		answer:['うけとり','うけみ','じゅちゅう','じゅどう','じゅり','そうじゅ','ひきうけ']
	},
	{
		pronunciation:[['シュウ'],['す']],
		question:['九州'],
		kanji:['九州'],
		answer:['きゅうしゅう']
	},
	{
		pronunciation:[['シュウ','ジュウ'],['ひろう']],
		question:['拾う'],
		kanji:['拾'],
		answer:['ひろ']
	},
	{
		pronunciation:[['シュウ'],['おわる','おえる']],
		question:['始終','終期','終局','終曲','終業','終始','終止','終身','終日','終生','終息','終着','終点','終電','終夜'],
		kanji:['始終','終期','終局','終曲','終業','終始','終止','終身','終日','終生','終息','終着','終点','終電','終夜'],
		answer:['しじゅう','しゅうき','しゅうきょく','しゅうきょく','しゅうぎょう','しゅうし','しゅうし','しゅうしん','しゅうじつ','しゅうせい','しゅうそく','しゅうちゃく','しゅうてん','しゅうでん','しゅうや']
	},
	{
		pronunciation:[['シュウ'],['ならう']],
		question:['学習','習作','習字','習知','自習','実習','風習','見習','予習','練習'],
		kanji:['学習','習作','習字','習知','自習','実習','風習','見習','予習','練習'],
		answer:['がくしゅう','しゅうさく','しゅうじ','しゅうち','じしゅう','じっしゅう','ふうしゅう','みなら','よしゅう','れんしゅう']
	},
	{
		pronunciation:[['シュウ'],['あつまる','あつめる','つどう']],
		question:['歌集','画集','詩集','集荷','集会','集金','集計','集合','集中','集配','集落','全集','文集'],
		kanji:['歌集','画集','詩集','集荷','集会','集金','集計','集合','集中','集配','集落','全集','文集'],
		answer:['かしゅう','がしゅう','ししゅう','しゅうか','しゅうかい','しゅうきん','しゅうけい','しゅうごう','しゅうちゅう','しゅうはい','しゅうらく','ぜんしゅう','ぶんしゅう']
	},
	{
		pronunciation:[['ジュウ'],['すむ','すまう']],
		question:['安住','住所','住人','定住'],
		kanji:['安住','住所','住人','定住'],
		answer:['あんじゅう','じゅうしょ','じゅうにん','ていじゅう']
	},
	{
		pronunciation:[['ジュウ','チョウ'],['おもい','かさねる','かさなる','え']],
		question:['重荷','荷重','軽重','軽重','五重','四重','自重','自重','重工','重心','重水','重体','重大','重点','重箱','重病','重役','重油','重力','体重','多重','丁重','十重','二重','一重','二重','身重','八重'],
		kanji:['重荷','荷重','軽重','軽重','五重','四重','自重','自重','重工','重心','重水','重体','重大','重点','重箱','重病','重役','重油','重力','体重','多重','丁重','十重','二重','一重','二重','身重','八重'],
		answer:['おもに','かじゅう','けいじゅう','けいちょう','ごじゅう','しじゅう','じじゅう','じちょう','じゅうこう','じゅうしん','じゅうすい','じゅうたい','じゅうだい','じゅうてん','じゅうばこ','じゅうびょう','じゅうやく','じゅうゆ','じゅうりょく','たいじゅう','たじゅう','ていちょう','とえ','にじゅう','ひとえ','ふたえ','みおも','やえ']
	},
	{
		pronunciation:[['シュク'],['やど','やどる','やどす']],
		question:['合宿','下宿','宿題','宿直','宿場','宿命','定宿','野宿','宿屋'],
		kanji:['合宿','下宿','宿題','宿直','宿場','宿命','定宿','野宿','宿屋'],
		answer:['がっしゅく','げしゅく','しゅくだい','しゅくちょく','しゅくば','しゅくめい','じょうやど','のじゅく','やどや']
	},
	{
		pronunciation:[['ショ'],['ところ']],
		question:['暗所','会所','急所','局所','近所','高所','出所','所員','所感','所外','所期','所業','所見','所作','所持','所長','所定','所内','所有','所用','地所','住所','短所','台所','長所','出所','入所','場所','部所','見所','名所','役所','来所'],
		kanji:['暗所','会所','急所','局所','近所','高所','出所','所員','所感','所外','所期','所業','所見','所作','所持','所長','所定','所内','所有','所用','地所','住所','短所','台所','長所','出所','入所','場所','部所','見所','名所','役所','来所'],
		answer:['あんしょ','かいしょ','きゅうしょ','きょくしょ','きんじょ','こうしょ','しゅっしょ','しょいん','しょかん','しょがい','しょき','しょぎょう','しょけん','しょさ','しょじ','しょちょう','しょてい','しょない','しょゆう','しょよう','じしょ','じゅうしょ','たんしょ','だいどころ','ちょうしょ','でどころ','にゅうしょ','ばしょ','ぶしょ','みどころ','めいしょ','やくしょ','らいしょ']
	},
	{
		pronunciation:[['ショ'],['あつい']],
		question:['向暑','小暑','暑中','大暑'],
		kanji:['向暑','小暑','暑中','大暑'],
		answer:['こうしょ','しょうしょ','しょちゅう','たいしょ']
	},
	{
		pronunciation:[['ジョ'],['たすける','たすかる','すけ']],
		question:['一助','助言','助手','助走','助長','助命','助役','助力'],
		kanji:['一助','助言','助手','助走','助長','助命','助役','助力'],
		answer:['いちじょ','じょげん','じょしゅ','じょそう','じょちょう','じょめい','じょやく','じょりょく']
	},
	{
		pronunciation:[['ショウ'],['']],
		question:['昭和'],
		kanji:['昭和'],
		answer:['しょうわ']
	},
	{
		pronunciation:[['ショウ'],['きえる','けす']],
		question:['消音','消化','消火','消去','消光','消息','消長','取消'],
		kanji:['消音','消化','消火','消去','消光','消息','消長','取消'],
		answer:['しょうおん','しょうか','しょうか','しょうきょ','しょうこう','しょうそく','しょうちょう','とりけし']
	},
	{
		pronunciation:[['ショウ'],['あきなう']],
		question:['画商','行商','商会','商業','商工','商号','商才','商社','商事','商船','商談','商店','商人','商売','商品','商用','通商','年商'],
		kanji:['画商','行商','商会','商業','商工','商号','商才','商社','商事','商船','商談','商店','商人','商売','商品','商用','通商','年商'],
		answer:['がしょう','ぎょうしょう','しょうかい','しょうぎょう','しょうこう','しょうごう','しょうさい','しょうしゃ','しょうじ','しょうせん','しょうだん','しょうてん','しょうにん','しょうばい','しょうひん','しょうよう','つうしょう','ねんしょう']
	},
	{
		pronunciation:[['ショウ'],['']],
		question:['一章','楽章','記章','校章','次章','前章','全章','八章','文章','本章'],
		kanji:['一章','楽章','記章','校章','次章','前章','全章','八章','文章','本章'],
		answer:['いっしょう','がくしょう','きしょう','こうしょう','じしょう','ぜんしょう','ぜんしょう','はっしょう','ぶんしょう','ほんしょう']
	},
	{
		pronunciation:[['ショウ'],['かつ','まさる']],
		question:['勝気','勝手','決勝','勝算','勝者','勝負','先勝','全勝','大勝','名勝','楽勝'],
		kanji:['勝気','勝手','決勝','勝算','勝者','勝負','先勝','全勝','大勝','名勝','楽勝'],
		answer:['かちき','かって','けっしょう','しょうさん','しょうしゃ','しょうぶ','せんしょう','ぜんしょう','たいしょう','めいしょう','らくしょう']
	},
	{
		pronunciation:[['ジョウ'],['のる','のせる']],
		question:['自乗','乗員','乗客','乗算','乗算','乗車','上乗','乗船','乗馬','乗用','相乗','同乗','名乗','二乗','乗場','乗物'],
		kanji:['自乗','乗員','乗客','乗算','乗算','乗車','上乗','乗船','乗馬','乗用','相乗','同乗','名乗','二乗','乗場','乗物'],
		answer:['じじょう','じょういん','じょうきゃく','じょうさん','じょうざん','じょうしゃ','じょうじょう','じょうせん','じょうば','じょうよう','そうじょう','どうじょう','なの','にじょう','のりば','のりもの']
	},
	{
		pronunciation:[['ショク'],['うえる','うわる']],
		question:['植木','写植','植字','植生','植物','植毛','植林'],
		kanji:['植木','写植','植字','植生','植物','植毛','植林'],
		answer:['うえき','しゃしょく','しょくじ','しょくせい','しょくぶつ','しょくもう','しょくりん']
	},
	{
		pronunciation:[['シン'],['もうす']],
		question:['具申','申年','上申','答申','内申'],
		kanji:['具申','申年','上申','答申','内申'],
		answer:['ぐしん','さるどし','じょうしん','とうしん','ないしん']
	},
	{
		pronunciation:[['シン'],['み']],
		question:['一身','受身','身体','空身','黄身','化身','終身','出身','白身','心身','身上','身体','身長','親身','身命','自身','人身','前身','全身','長身','転身','投身','中身','生身','半身','半身','病身','分身','平身','身内','身重','身軽','身空','身近','身分','身元','立身'],
		kanji:['一身','受身','身体','空身','黄身','化身','終身','出身','白身','心身','身上','身体','身長','親身','身命','自身','人身','前身','全身','長身','転身','投身','中身','生身','半身','半身','病身','分身','平身','身内','身重','身軽','身空','身近','身分','身元','立身'],
		answer:['いっしん','うけみ','からだ','からみ','きみ','けしん','しゅうしん','しゅっしん','しろみ','しんしん','しんじょう','しんたい','しんちょう','しんみ','しんめい','じしん','じんしん','ぜんしん','ぜんしん','ちょうしん','てんしん','とうしん','なかみ','なまみ','はんしん','はんみ','びょうしん','ぶんしん','へいしん','みうち','みおも','みがる','みそら','みぢか','みぶん','みもと','りっしん']
	},
	{
		pronunciation:[['シン','ジン'],['かみ','かん','こう']],
		question:['神楽','神様','神世','神代','神主','神学','神前','神体','神童','神父','神木','神話','神宮','神宮','神社','天神','女神'],
		kanji:['神楽','神様','神世','神代','神主','神学','神前','神体','神童','神父','神木','神話','神宮','神宮','神社','天神','女神'],
		answer:['かぐら','かみさま','かみよ','かみよ','かんぬし','しんがく','しんぜん','しんたい','しんどう','しんぷ','しんぼく','しんわ','じんぐう','じんぐう','じんじゃ','てんじん','めがみ']
	},
	{
		pronunciation:[['シン'],['ま']],
		question:['写真','正真','真意','真空','真実','真正','真相','真理','真上','真顔','真木','真北','真心','真下','真向','真直','真夏','真西','真東','真昼','真冬','真水','真南','真中'],
		kanji:['写真','正真','真意','真空','真実','真正','真相','真理','真上','真顔','真木','真北','真心','真下','真向','真直','真夏','真西','真東','真昼','真冬','真水','真南','真中'],
		answer:['しゃしん','しょうしん','しんい','しんくう','しんじつ','しんせい','しんそう','しんり','まうえ','まがお','まき','まきた','まごころ','ました','まっこう','まっすぐ','まなつ','まにし','まひがし','まひる','まふゆ','まみず','まみなみ','まんなか']
	},
	{
		pronunciation:[['シン'],['ふかい','ふかまる','ふかめる']],
		question:['毛深','深意','深遠','深化','深海','深長','深部','深夜','水深','根深','根深','目深','深山'],
		kanji:['毛深','深意','深遠','深化','深海','深長','深部','深夜','水深','根深','根深','目深','深山'],
		answer:['けぶか','しんい','しんえん','しんか','しんかい','しんちょう','しんぶ','しんや','すいしん','ねぶか','ねぶか','まぶか','みやま']
	},
	{
		pronunciation:[['シン'],['すすむ','すすめる']],
		question:['急進','後進','行進','高進','進化','進学','進級','進行','進取','進出','新進','進上','進水','進度','進入','進歩','進物','進路','先進','前進','直進','転進','発進'],
		kanji:['急進','後進','行進','高進','進化','進学','進級','進行','進取','進出','新進','進上','進水','進度','進入','進歩','進物','進路','先進','前進','直進','転進','発進'],
		answer:['きゅうしん','こうしん','こうしん','こうしん','しんか','しんがく','しんきゅう','しんこう','しんしゅ','しんしゅつ','しんしん','しんじょう','しんすい','しんど','しんにゅう','しんぽ','しんもつ','しんろ','せんしん','ぜんしん','ちょくしん','てんしん','はっしん']
	},
	{
		pronunciation:[['セイ','セ'],['よ']],
		question:['一世','神世','近世','後世','出世','時世','世界','世間','世事','世相','世代','世話','早世','中世','当世','二世','来世'],
		kanji:['一世','神世','近世','後世','出世','時世','世界','世間','世事','世相','世代','世話','早世','中世','当世','二世','来世'],
		answer:['いっせい','かみよ','きんせい','こうせい','しゅっせ','じせい','せかい','せけん','せじ','せそう','せだい','せわ','そうせい','ちゅうせい','とうせい','にせい','らいせ']
	},
	{
		pronunciation:[['セイ'],['ととのえる','ととのう']],
		question:['整形','整合','整数','整地','整調','整理','整流','整列','調整'],
		kanji:['整形','整合','整数','整地','整調','整理','整流','整列','調整'],
		answer:['せいけい','せいごう','せいすう','せいち','せいちょう','せいり','せいりゅう','せいれつ','ちょうせい']
	},
	{
		pronunciation:[['セキ','シャク'],['むかし']],
		question:['大昔','今昔','昔話'],
		kanji:['大昔','今昔','昔話'],
		answer:['おおむかし','こんじゃく','むかしばなし']
	},
	{
		pronunciation:[['ゼン'],['まったく','すべて']],
		question:['安全','十全','全員','全会','全開','全館','全学','全局','全曲','全区','全形','全血','全県','全戸','全校','全国','全市','全紙','全社','全集','全書','全勝','全章','全身','全日','全線','全体','全長','全通','全店','全島','全土','全品','全部','全文','全面','全力','万全'],
		kanji:['安全','十全','全員','全会','全開','全館','全学','全局','全曲','全区','全形','全血','全県','全戸','全校','全国','全市','全紙','全社','全集','全書','全勝','全章','全身','全日','全線','全体','全長','全通','全店','全島','全土','全品','全部','全文','全面','全力','万全'],
		answer:['あんぜん','じゅうぜん','ぜんいん','ぜんかい','ぜんかい','ぜんかん','ぜんがく','ぜんきょく','ぜんきょく','ぜんく','ぜんけい','ぜんけつ','ぜんけん','ぜんこ','ぜんこう','ぜんこく','ぜんし','ぜんし','ぜんしゃ','ぜんしゅう','ぜんしょ','ぜんしょう','ぜんしょう','ぜんしん','ぜんじつ','ぜんせん','ぜんたい','ぜんちょう','ぜんつう','ぜんてん','ぜんとう','ぜんど','ぜんぴん','ぜんぶ','ぜんぶん','ぜんめん','ぜんりょく','ばんぜん']
	},
	{
		pronunciation:[['ソウ','ショウ'],['あい']],
		question:['相生','相方','相対','相次','相通','相手','外相','形相','形相','血相','色相','首相','真相','世相','相思','相乗','相対','相談','相当','相反','相場','同相','人相','皮相','面相','様相'],
		kanji:['相生','相方','相対','相次','相通','相手','外相','形相','形相','血相','色相','首相','真相','世相','相思','相乗','相対','相談','相当','相反','相場','同相','人相','皮相','面相','様相'],
		answer:['あいおい','あいかた','あいたい','あいつ','あいつう','あいて','がいしょう','ぎょうそう','けいそう','けっそう','しきそう','しゅしょう','しんそう','せそう','そうし','そうじょう','そうたい','そうだん','そうとう','そうはん','そうば','どうそう','にんそう','ひそう','めんそう','ようそう']
	},
	{
		pronunciation:[['ソウ'],['おくる']],
		question:['運送','回送','急送','後送','送金','送出','送受','送電','送配','送風','直送','転送','電送','配送','発送','返送','放送','見送'],
		kanji:['運送','回送','急送','後送','送金','送出','送受','送電','送配','送風','直送','転送','電送','配送','発送','返送','放送','見送'],
		answer:['うんそう','かいそう','きゅうそう','こうそう','そうきん','そうしゅつ','そうじゅ','そうでん','そうはい','そうふう','ちょくそう','てんそう','でんそう','はいそう','はっそう','へんそう','ほうそう','みおく']
	},
	{
		pronunciation:[['ソウ','ソ'],['']],
		question:['回想','感想','空想','思想','想起','想定','着想','発想','予想','理想'],
		kanji:['回想','感想','空想','思想','想起','想定','着想','発想','予想','理想'],
		answer:['かいそう','かんそう','くうそう','しそう','そうき','そうてい','ちゃくそう','はっそう','よそう','りそう']
	},
	{
		pronunciation:[['ソク'],['いき']],
		question:['安息','気息','休息','子息','終息','消息','生息','息子'],
		kanji:['安息','気息','休息','子息','終息','消息','生息','息子'],
		answer:['あんそく','きそく','きゅうそく','しそく','しゅうそく','しょうそく','せいそく','むすこ']
	},
	{
		pronunciation:[['ソク'],['はやい','はやめる','はやまる','すみやか']],
		question:['音速','急速','光速','高速','早速','車速','時速','速答','速度','速力','速記','速急','中速','秒速','風速','流速'],
		kanji:['音速','急速','光速','高速','早速','車速','時速','速答','速度','速力','速記','速急','中速','秒速','風速','流速'],
		answer:['おんそく','きゅうそく','こうそく','こうそく','さっそく','しゃそく','じそく','そくとう','そくど','そくりょく','そっき','そっきゅう','ちゅうそく','びょうそく','ふうそく','りゅうそく']
	},
	{
		pronunciation:[['ゾク'],['']],
		question:['家族','血族','親族','部族'],
		kanji:['家族','血族','親族','部族'],
		answer:['かぞく','けつぞく','しんぞく','ぶぞく']
	},
	{
		pronunciation:[['タ'],['ほか']],
		question:['自他','他意','他界','他局','他家','他県','他校','他国','他言','他紙','他社','他者','他出','他生','他事','他日','他人','他聞','他方','他面','他力','他人'],
		kanji:['自他','他意','他界','他局','他家','他県','他校','他国','他言','他紙','他社','他者','他出','他生','他事','他日','他人','他聞','他方','他面','他力','他人'],
		answer:['じた','たい','たかい','たきょく','たけ','たけん','たこう','たこく','たごん','たし','たしゃ','たしゃ','たしゅつ','たしょう','たじ','たじつ','たにん','たぶん','たほう','ためん','たりき','ひと']
	},
	{
		pronunciation:[['ダ'],['うつ']],
		question:['強打','金打','仕打','打開','打算','打者','打電'],
		kanji:['強打','金打','仕打','打開','打算','打者','打電'],
		answer:['きょうだ','きんちょう','しうち','だかい','ださん','だしゃ','だでん']
	},
	{
		pronunciation:[['タイ','ツイ'],['']],
		question:['相対','相対','対外','対岸','対局','対決','対人','対談','対地','対等','対内','対日','対物','対米','対面','対立','対流','対話','反対'],
		kanji:['相対','相対','対外','対岸','対局','対決','対人','対談','対地','対等','対内','対日','対物','対米','対面','対立','対流','対話','反対'],
		answer:['あいたい','そうたい','たいがい','たいがん','たいきょく','たいけつ','たいじん','たいだん','たいち','たいとう','たいない','たいにち','たいぶつ','たいべい','たいめん','たいりつ','たいりゅう','たいわ','はんたい']
	},
	{
		pronunciation:[['タイ'],['まつ']],
		question:['期待','待合','待人'],
		kanji:['期待','待合','待人'],
		answer:['きたい','まちあい','まちびと']
	},
	{
		pronunciation:[['ダイ','タイ'],['かわる','かえる','よ','しろ']],
		question:['神代','近代','車代','交代','古代','代物','時代','次代','地代','世代','先代','前代','代休','代金','代行','代書','代数','代入','代筆','代表','代役','代用','代理','地代','千代','当代','年代','本代','名代'],
		kanji:['神代','近代','車代','交代','古代','代物','時代','次代','地代','世代','先代','前代','代休','代金','代行','代書','代数','代入','代筆','代表','代役','代用','代理','地代','千代','当代','年代','本代','名代'],
		answer:['かみよ','きんだい','くるまだい','こうたい','こだい','しろもの','じだい','じだい','じだい','せだい','せんだい','ぜんだい','だいきゅう','だいきん','だいこう','だいしょ','だいすう','だいにゅう','だいひつ','だいひょう','だいやく','だいよう','だいり','ちだい','ちよ','とうだい','ねんだい','ほんだい','みょうだい']
	},
	{
		pronunciation:[['ダイ'],['']],
		question:['次第','第一','第二','落第'],
		kanji:['次第','第一','第二','落第'],
		answer:['しだい','だいいち','だいに','らくだい']
	},
	{
		pronunciation:[['ダイ'],['']],
		question:['画題','原題','宿題','主題','出題','題字','題名','題目','表題','放題','本題','命題','問題','話題'],
		kanji:['画題','原題','宿題','主題','出題','題字','題名','題目','表題','放題','本題','命題','問題','話題'],
		answer:['がだい','げんだい','しゅくだい','しゅだい','しゅつだい','だいじ','だいめい','だいもく','ひょうだい','ほうだい','ほんだい','めいだい','もんだい','わだい']
	},
	{
		pronunciation:[['タン'],['すみ']],
		question:['炭火','石炭','炭化','炭田','木炭'],
		kanji:['炭火','石炭','炭化','炭田','木炭'],
		answer:['すみび','せきたん','たんか','たんでん','もくたん']
	},
	{
		pronunciation:[['タン'],['みじかい']],
		question:['気短','時短','短歌','短期','短気','短所','短小','短足','短大','短調','短刀','短波','短文','長短','手短'],
		kanji:['気短','時短','短歌','短期','短気','短所','短小','短足','短大','短調','短刀','短波','短文','長短','手短'],
		answer:['きみじか','じたん','たんか','たんき','たんき','たんしょ','たんしょう','たんそく','たんだい','たんちょう','たんとう','たんぱ','たんぶん','ちょうたん','てみじか']
	},
	{
		pronunciation:[['ダン'],['']],
		question:['会談','商談','相談','対談','談合','談話','筆談','美談','放談','面談'],
		kanji:['会談','商談','相談','対談','談合','談話','筆談','美談','放談','面談'],
		answer:['かいだん','しょうだん','そうだん','たいだん','だんごう','だんわ','ひつだん','びだん','ほうだん','めんだん']
	},
	{
		pronunciation:[['チャク','ジャク'],['きる','きせる','つく','つける']],
		question:['上着','横着','帰着','着物','近着','決着','下着','終着','先着','着手','着色','着実','着水','着生','着想','着地','着服','着目','着用','着火','着工','定着','発着','古着','水着','夜着','落着'],
		kanji:['上着','横着','帰着','着物','近着','決着','下着','終着','先着','着手','着色','着実','着水','着生','着想','着地','着服','着目','着用','着火','着工','定着','発着','古着','水着','夜着','落着'],
		answer:['うわぎ','おうちゃく','きちゃく','きもの','きんちゃく','けっちゃく','したぎ','しゅうちゃく','せんちゃく','ちゃくしゅ','ちゃくしょく','ちゃくじつ','ちゃくすい','ちゃくせい','ちゃくそう','ちゃくち','ちゃくふく','ちゃくもく','ちゃくよう','ちゃっか','ちゃっこう','ていちゃく','はっちゃく','ふるぎ','みずぎ','やぎ','らくちゃく']
	},
	{
		pronunciation:[['チュウ'],['そそぐ']],
		question:['外注','受注','注意','注記','注水','注入','注目','注文','注力','発注'],
		kanji:['外注','受注','注意','注記','注水','注入','注目','注文','注力','発注'],
		answer:['がいちゅう','じゅちゅう','ちゅうい','ちゅうき','ちゅうすい','ちゅうにゅう','ちゅうもく','ちゅうもん','ちゅうりょく','はっちゅう']
	},
	{
		pronunciation:[['チュウ'],['はしら']],
		question:['円柱','角柱','電柱','火柱'],
		kanji:['円柱','角柱','電柱','火柱'],
		answer:['えんちゅう','かくちゅう','でんちゅう','ひばしら']
	},
	{
		pronunciation:[['チョウ','テイ'],['']],
		question:['丁度','丁度','丁目','丁重','落丁'],
		kanji:['丁度','丁度','丁目','丁重','落丁'],
		answer:['ちょうど','ちょうど','ちょうめ','ていちょう','らくちょう']
	},
	{
		pronunciation:[['チョウ'],['']],
		question:['記帳','台帳','帳場','帳面','通帳','手帳','元帳'],
		kanji:['記帳','台帳','帳場','帳面','通帳','手帳','元帳'],
		answer:['きちょう','だいちょう','ちょうば','ちょうめん','つうちょう','てちょう','もとちょう']
	},
	{
		pronunciation:[['チョウ'],['しらべる','ととのう','ととのえる']],
		question:['階調','強調','曲調','空調','口調','語調','色調','新調','整調','正調','体調','短調','調教','調号','調合','調子','調書','調整','長調','調度','調味','調理','調和','転調','取調','同調','歩調'],
		kanji:['階調','強調','曲調','空調','口調','語調','色調','新調','整調','正調','体調','短調','調教','調号','調合','調子','調書','調整','長調','調度','調味','調理','調和','転調','取調','同調','歩調'],
		answer:['かいちょう','きょうちょう','きょくちょう','くうちょう','くちょう','ごちょう','しきちょう','しんちょう','せいちょう','せいちょう','たいちょう','たんちょう','ちょうきょう','ちょうごう','ちょうごう','ちょうし','ちょうしょ','ちょうせい','ちょうちょう','ちょうど','ちょうみ','ちょうり','ちょうわ','てんちょう','とりしらべ','どうちょう','ほちょう']
	},
	{
		pronunciation:[['ツイ'],['おう']],
		question:['追手','追記','追究','追放'],
		kanji:['追手','追記','追究','追放'],
		answer:['おって','ついき','ついきゅう','ついほう']
	},
	{
		pronunciation:[['テイ','ジョウ'],['さだめる','さだまる','さだか']],
		question:['安定','一定','決定','公定','国定','算定','指定','所定','定数','定石','定宿','人定','想定','定員','定期','定休','定見','定食','定時','定住','定数','定着','定点','定年','定番','定理','同定','内定','平定','予定'],
		kanji:['安定','一定','決定','公定','国定','算定','指定','所定','定数','定石','定宿','人定','想定','定員','定期','定休','定見','定食','定時','定住','定数','定着','定点','定年','定番','定理','同定','内定','平定','予定'],
		answer:['あんてい','いってい','けってい','こうてい','こくてい','さんてい','してい','しょてい','じょうすう','じょうせき','じょうやど','じんてい','そうてい','ていいん','ていき','ていきゅう','ていけん','ていしょく','ていじ','ていじゅう','ていすう','ていちゃく','ていてん','ていねん','ていばん','ていり','どうてい','ないてい','へいてい','よてい']
	},
	{
		pronunciation:[['テイ'],['にわ']],
		question:['家庭','校庭','石庭','庭園','庭球','中庭','庭木','庭先'],
		kanji:['家庭','校庭','石庭','庭園','庭球','中庭','庭木','庭先'],
		answer:['かてい','こうてい','せきてい','ていえん','ていきゅう','なかにわ','にわき','にわさき']
	},
	{
		pronunciation:[['テキ'],['ふえ']],
		question:['汽笛'],
		kanji:['汽笛'],
		answer:['きてき']
	},
	{
		pronunciation:[['テツ'],['']],
		question:['鉄橋','鉄工','鉄線','鉄板','鉄人','鉄道','電鉄'],
		kanji:['鉄橋','鉄工','鉄線','鉄板','鉄人','鉄道','電鉄'],
		answer:['てっきょう','てっこう','てっせん','てっぱん','てつじん','てつどう','でんてつ']
	},
	{
		pronunciation:[['テン'],['ころがる','ころげる','ころがす','ころぶ']],
		question:['一転','運転','横転','回転','急転','空転','公転','自転','転化','転回','転記','転業','転向','転校','転写','転出','転生','転身','転進','転石','転送','転地','転調','転入','転売','転用','転落','動転','反転','流転'],
		kanji:['一転','運転','横転','回転','急転','空転','公転','自転','転化','転回','転記','転業','転向','転校','転写','転出','転生','転身','転進','転石','転送','転地','転調','転入','転売','転用','転落','動転','反転','流転'],
		answer:['いってん','うんてん','おうてん','かいてん','きゅうてん','くうてん','こうてん','じてん','てんか','てんかい','てんき','てんぎょう','てんこう','てんこう','てんしゃ','てんしゅつ','てんしょう','てんしん','てんしん','てんせき','てんそう','てんち','てんちょう','てんにゅう','てんばい','てんよう','てんらく','どうてん','はんてん','るてん']
	},
	{
		pronunciation:[['ト','ツ'],['みやこ']],
		question:['古都','首都','都合','都度','都下','都会','都銀','都市','都心','都内','都立'],
		kanji:['古都','首都','都合','都度','都下','都会','都銀','都市','都心','都内','都立'],
		answer:['こと','しゅと','つごう','つど','とか','とかい','とぎん','とし','としん','とない','とりつ']
	},
	{
		pronunciation:[['タク','ド','ト'],['たび']],
		question:['一度','落度','温度','角度','感度','強度','軽度','高度','今度','進度','速度','丁度','丁度','調度','都度','度合','度数','何度','二度','年度','一度','毎度','明度','用度'],
		kanji:['一度','落度','温度','角度','感度','強度','軽度','高度','今度','進度','速度','丁度','丁度','調度','都度','度合','度数','何度','二度','年度','一度','毎度','明度','用度'],
		answer:['いちど','おちど','おんど','かくど','かんど','きょうど','けいど','こうど','こんど','しんど','そくど','ちょうど','ちょうど','ちょうど','つど','どあい','どすう','なんど','にど','ねんど','ひとたび','まいど','めいど','ようど']
	},
	{
		pronunciation:[['トウ'],['なげる']],
		question:['帰投','投下','投球','投手','投書','投身','投石','投入','投薬'],
		kanji:['帰投','投下','投球','投手','投書','投身','投石','投入','投薬'],
		answer:['きとう','とうか','とうきゅう','とうしゅ','とうしょ','とうしん','とうせき','とうにゅう','とうやく']
	},
	{
		pronunciation:[['トウ','ズ'],['まめ']],
		question:['小豆','黒豆','大豆','豆球'],
		kanji:['小豆','黒豆','大豆','豆球'],
		answer:['あずき','くろまめ','だいず','まめきゅう']
	},
	{
		pronunciation:[['トウ'],['しま']],
		question:['大島','小島','島国','全島','半島','列島'],
		kanji:['大島','小島','島国','全島','半島','列島'],
		answer:['おおしま','こじま','しまぐに','ぜんとう','はんとう','れっとう']
	},
	{
		pronunciation:[['トウ'],['ゆ']],
		question:['湯気'],
		kanji:['湯気'],
		answer:['ゆげ']
	},
	{
		pronunciation:[['トウ','ト'],['のぼる']],
		question:['登院','登記','登校','登場','登用','登山'],
		kanji:['登院','登記','登校','登場','登用','登山'],
		answer:['とういん','とうき','とうこう','とうじょう','とうよう','とざん']
	},
	{
		pronunciation:[['トウ'],['ひとしい']],
		question:['一等','下等','高等','親等','上等','対等','中等','等級','等号','等式','等分','等方','同等','何等','平等'],
		kanji:['一等','下等','高等','親等','上等','対等','中等','等級','等号','等式','等分','等方','同等','何等','平等'],
		answer:['いっとう','かとう','こうとう','しんとう','じょうとう','たいとう','ちゅうとう','とうきゅう','とうごう','とうしき','とうぶん','とうほう','どうとう','なんら','びょうどう']
	},
	{
		pronunciation:[['ドウ'],['うごく','うごかす']],
		question:['運動','活動','感動','起動','原動','言動','行動','作動','始動','出動','手動','自動','受動','電動','動員','動画','動向','動作','動転','動物','動力','発動','波動','反動','流動'],
		kanji:['運動','活動','感動','起動','原動','言動','行動','作動','始動','出動','手動','自動','受動','電動','動員','動画','動向','動作','動転','動物','動力','発動','波動','反動','流動'],
		answer:['うんどう','かつどう','かんどう','きどう','げんどう','げんどう','こうどう','さどう','しどう','しゅつどう','しゅどう','じどう','じゅどう','でんどう','どういん','どうが','どうこう','どうさ','どうてん','どうぶつ','どうりょく','はつどう','はどう','はんどう','りゅうどう']
	},
	{
		pronunciation:[['ドウ'],['わらべ']],
		question:['大童','学童','神童','童画','童顔','童心','童子','童女','童話'],
		kanji:['大童','学童','神童','童画','童顔','童心','童子','童女','童話'],
		answer:['おおわらわ','がくどう','しんどう','どうが','どうがん','どうしん','どうじ','どうじょ','どうわ']
	},
	{
		pronunciation:[['ノウ'],['']],
		question:['農園','農家','農学','農業','農具','農場','農村','農地','農薬','農林'],
		kanji:['農園','農家','農学','農業','農具','農場','農村','農地','農薬','農林'],
		answer:['のうえん','のうか','のうがく','のうぎょう','のうぐ','のうじょう','のうそん','のうち','のうやく','のうりん']
	},
	{
		pronunciation:[['ハ'],['なみ']],
		question:['大波','音波','寒波','光波','秋波','高波','短波','長波','電波','年波','波風','波線','波立','波間','波形','波線','波長','波動','波面'],
		kanji:['大波','音波','寒波','光波','秋波','高波','短波','長波','電波','年波','波風','波線','波立','波間','波形','波線','波長','波動','波面'],
		answer:['おおなみ','おんぱ','かんぱ','こうは','しゅうは','たかなみ','たんぱ','ちょうは','でんぱ','としなみ','なみかぜ','なみせん','なみだ','なみま','はけい','はせん','はちょう','はどう','はめん']
	},
	{
		pronunciation:[['ハイ'],['くばる']],
		question:['気配','高配','集配','心配','送配','手配','年配','配員','配下','交配','配合','配車','配色','配水','配線','配送','配電','配当','配分','配役','配列','分配'],
		kanji:['気配','高配','集配','心配','送配','手配','年配','配員','配下','交配','配合','配車','配色','配水','配線','配送','配電','配当','配分','配役','配列','分配'],
		answer:['けはい','こうはい','しゅうはい','しんぱい','そうはい','てはい','ねんぱい','はいいん','はいか','はいごう','はいごう','はいしゃ','はいしょく','はいすい','はいせん','はいそう','はいでん','はいとう','はいぶん','はいやく','はいれつ','ぶんぱい']
	},
	{
		pronunciation:[['バイ'],['']],
		question:['倍数'],
		kanji:['倍数'],
		answer:['ばいすう']
	},
	{
		pronunciation:[[''],['はこ']],
		question:['重箱','箱船','本箱'],
		kanji:['重箱','箱船','本箱'],
		answer:['じゅうばこ','はこぶね','ほんばこ']
	},
	{
		pronunciation:[[''],['はた','はたけ']],
		question:['麦畑'],
		kanji:['麦畑'],
		answer:['むぎばたけ']
	},
	{
		pronunciation:[['ハツ','ホツ'],['']],
		question:['一発','開発','活発','原発','始発','出発','自発','先発','多発','内発','発火','発見','発行','発止','発車','発進','発生','発声','発想','発送','発着','発注','発表','発育','発音','発言','発電','発動','発売','発病','発明','反発','発起','発作','発足'],
		kanji:['一発','開発','活発','原発','始発','出発','自発','先発','多発','内発','発火','発見','発行','発止','発車','発進','発生','発声','発想','発送','発着','発注','発表','発育','発音','発言','発電','発動','発売','発病','発明','反発','発起','発作','発足'],
		answer:['いっぱつ','かいはつ','かっぱつ','げんぱつ','しはつ','しゅっぱつ','じはつ','せんぱつ','たはつ','ないはつ','はっか','はっけん','はっこう','はっし','はっしゃ','はっしん','はっせい','はっせい','はっそう','はっそう','はっちゃく','はっちゅう','はっぴょう','はついく','はつおん','はつげん','はつでん','はつどう','はつばい','はつびょう','はつめい','はんぱつ','ほっき','ほっさ','ほっそく']
	},
	{
		pronunciation:[['ハン','タン','ホン'],['そる','そらす']],
		question:['相反','反物','反感','反語','反対','反転','反動','反日','反発','反面','反目','反問','反落','反古'],
		kanji:['相反','反物','反感','反語','反対','反転','反動','反日','反発','反面','反目','反問','反落','反古'],
		answer:['そうはん','たんもの','はんかん','はんご','はんたい','はんてん','はんどう','はんにち','はんぱつ','はんめん','はんもく','はんもん','はんらく','ほご']
	},
	{
		pronunciation:[['ハン'],['さか']],
		question:['坂道','坂路'],
		kanji:['坂道','坂路'],
		answer:['さかみち','はんろ']
	},
	{
		pronunciation:[['ハン','バン'],['いた']],
		question:['板場','板前','画板','黒板','合板','鉄板','花板','板金','板書','平板'],
		kanji:['板場','板前','画板','黒板','合板','鉄板','花板','板金','板書','平板'],
		answer:['いたば','いたまえ','がばん','こくばん','ごうはん','てっぱん','はないた','ばんきん','ばんしょ','へいばん']
	},
	{
		pronunciation:[['ヒ'],['かわ']],
		question:['外皮','毛皮','皮下','皮相','皮肉','皮肉','表皮'],
		kanji:['外皮','毛皮','皮下','皮相','皮肉','皮肉','表皮'],
		answer:['がいひ','けがわ','ひか','ひそう','ひにく','ひにく','ひょうひ']
	},
	{
		pronunciation:[['ヒ'],['かなしい','かなしむ']],
		question:['悲鳴'],
		kanji:['悲鳴'],
		answer:['ひめい']
	},
	{
		pronunciation:[['ビ'],['うつくしい']],
		question:['美化','美学','美酒','美食','美女','美人','美談','美点','美男','美名'],
		kanji:['美化','美学','美酒','美食','美女','美人','美談','美点','美男','美名'],
		answer:['びか','びがく','びしゅ','びしょく','びじょ','びじん','びだん','びてん','びなん','びめい']
	},
	{
		pronunciation:[['ビ'],['はな']],
		question:['小鼻','鼻毛','鼻先','鼻血','鼻水','目鼻'],
		kanji:['小鼻','鼻毛','鼻先','鼻血','鼻水','目鼻'],
		answer:['こばな','はなげ','はなさき','はなぢ','はなみず','めはな']
	},
	{
		pronunciation:[['ヒツ'],['ふで']],
		question:['一筆','運筆','合筆','起筆','合筆','主筆','直筆','自筆','代筆','筆記','筆写','筆者','筆頭','筆談','分筆','文筆','毛筆'],
		kanji:['一筆','運筆','合筆','起筆','合筆','主筆','直筆','自筆','代筆','筆記','筆写','筆者','筆頭','筆談','分筆','文筆','毛筆'],
		answer:['いっぴつ','うんぴつ','がっぴつ','きひつ','ごうひつ','しゅひつ','じきひつ','じひつ','だいひつ','ひっき','ひっしゃ','ひっしゃ','ひっとう','ひつだん','ぶんぴつ','ぶんぴつ','もうひつ']
	},
	{
		pronunciation:[['ヒョウ'],['こおり','ひ']],
		question:['氷原','氷山','氷点','流氷'],
		kanji:['氷原','氷山','氷点','流氷'],
		answer:['ひょうげん','ひょうざん','ひょうてん','りゅうひょう']
	},
	{
		pronunciation:[['ヒョウ'],['おもて','あらわす','あらわれる']],
		question:['意表','表口','表地','下表','公表','作表','図表','線表','代表','地表','年表','発表','表意','表音','表記','表決','表紙','表出','表題','表土','表皮','表明','表面'],
		kanji:['意表','表口','表地','下表','公表','作表','図表','線表','代表','地表','年表','発表','表意','表音','表記','表決','表紙','表出','表題','表土','表皮','表明','表面'],
		answer:['いひょう','おもてぐち','おもてじ','かひょう','こうひょう','さくひょう','ずひょう','せんぴょう','だいひょう','ちひょう','ねんぴょう','はっぴょう','ひょうい','ひょうおん','ひょうき','ひょうけつ','ひょうし','ひょうしゅつ','ひょうだい','ひょうど','ひょうひ','ひょうめい','ひょうめん']
	},
	{
		pronunciation:[['ビョウ'],['']],
		question:['何秒','秒速'],
		kanji:['何秒','秒速'],
		answer:['なんびょう','びょうそく']
	},
	{
		pronunciation:[['ビョウ','ヘイ'],['やまい','やむ']],
		question:['悪病','急病','持病','重病','大病','発病','病院','病気','病原','病死','病室','病身','病弱','病人','病名','病理'],
		kanji:['悪病','急病','持病','重病','大病','発病','病院','病気','病原','病死','病室','病身','病弱','病人','病名','病理'],
		answer:['あくびょう','きゅうびょう','じびょう','じゅうびょう','たいびょう','はつびょう','びょういん','びょうき','びょうげん','びょうし','びょうしつ','びょうしん','びょうじゃく','びょうにん','びょうめい','びょうり']
	},
	{
		pronunciation:[['ヒン'],['しな']],
		question:['気品','金品','下品','作品','品数','品物','出品','商品','食品','新品','上品','全品','手品','品行','品名','品目','物品','部品','返品','薬品','洋品'],
		kanji:['気品','金品','下品','作品','品数','品物','出品','商品','食品','新品','上品','全品','手品','品行','品名','品目','物品','部品','返品','薬品','洋品'],
		answer:['きひん','きんぴん','げひん','さくひん','しなかず','しなもの','しゅっぴん','しょうひん','しょくひん','しんぴん','じょうひん','ぜんぴん','てじな','ひんこう','ひんめい','ひんもく','ぶっぴん','ぶひん','へんぴん','やくひん','ようひん']
	},
	{
		pronunciation:[['フ'],['まける','まかす','おう']],
		question:['気負','勝負','自負','正負','先負','先負','先負','負荷','負数'],
		kanji:['気負','勝負','自負','正負','先負','先負','先負','負荷','負数'],
		answer:['きお','しょうぶ','じふ','せいふ','せんぶ','せんぷ','せんまけ','ふか','ふすう']
	},
	{
		pronunciation:[['ブ'],['']],
		question:['一部','下部','外部','学部','局部','後部','細部','式部','市部','深部','上部','声部','西部','全部','大部','大部','中部','東部','当部','頭部','内部','南部','入部','部員','部下','部会','部外','部局','部室','部首','部所','部数','部族','部長','部内','部品','部分','部門','部落','部屋','北部','本部','文部'],
		kanji:['一部','下部','外部','学部','局部','後部','細部','式部','市部','深部','上部','声部','西部','全部','大部','大部','中部','東部','当部','頭部','内部','南部','入部','部員','部下','部会','部外','部局','部室','部首','部所','部数','部族','部長','部内','部品','部分','部門','部落','部屋','北部','本部','文部'],
		answer:['いちぶ','かぶ','がいぶ','がくぶ','きょくぶ','こうぶ','さいぶ','しきぶ','しぶ','しんぶ','じょうぶ','せいぶ','せいぶ','ぜんぶ','たいぶ','たいぶ','ちゅうぶ','とうぶ','とうぶ','とうぶ','ないぶ','なんぶ','にゅうぶ','ぶいん','ぶか','ぶかい','ぶがい','ぶきょく','ぶしつ','ぶしゅ','ぶしょ','ぶすう','ぶぞく','ぶちょう','ぶない','ぶひん','ぶぶん','ぶもん','ぶらく','へや','ほくぶ','ほんぶ','もんぶ']
	},
	{
		pronunciation:[['フク'],['']],
		question:['一服','感服','着服','夏服','服役','服地','服薬','服用','冬服','平服','洋服','礼服','和服'],
		kanji:['一服','感服','着服','夏服','服役','服地','服薬','服用','冬服','平服','洋服','礼服','和服'],
		answer:['いっぷく','かんぷく','ちゃくふく','なつふく','ふくえき','ふくじ','ふくやく','ふくよう','ふゆふく','へいふく','ようふく','れいふく','わふく']
	},
	{
		pronunciation:[['フク'],['']],
		question:['幸福','大福','福音','福引'],
		kanji:['幸福','大福','福音','福引'],
		answer:['こうふく','だいふく','ふくいん','ふくびき']
	},
	{
		pronunciation:[['ブツ','モツ'],['もの']],
		question:['青物','大物','買物','金物','着物','見物','小物','先物','作物','品物','植物','食物','書物','代物','進物','実物','事物','人物','生物','対物','反物','長物','動物','夏物','荷物','飲物','乗物','万物','風物','冬物','物色','物心','物体','物品','物理','文物','本物','名物','物音','物語','物語','物事','薬物','安物','洋物'],
		kanji:['青物','大物','買物','金物','着物','見物','小物','先物','作物','品物','植物','食物','書物','代物','進物','実物','事物','人物','生物','対物','反物','長物','動物','夏物','荷物','飲物','乗物','万物','風物','冬物','物色','物心','物体','物品','物理','文物','本物','名物','物音','物語','物語','物事','薬物','安物','洋物'],
		answer:['あおもの','おおもの','かいもの','かなもの','きもの','けんぶつ','こもの','さきもの','さくもつ','しなもの','しょくぶつ','しょくもつ','しょもつ','しろもの','しんもつ','じつぶつ','じぶつ','じんぶつ','せいぶつ','たいぶつ','たんもの','ちょうぶつ','どうぶつ','なつもの','にもつ','のみもの','のりもの','ばんぶつ','ふうぶつ','ふゆもの','ぶっしょく','ぶっしん','ぶったい','ぶっぴん','ぶつり','ぶんぶつ','ほんもの','めいぶつ','ものおと','ものがた','ものがたり','ものごと','やくぶつ','やすもの','ようもの']
	},
	{
		pronunciation:[['ヘイ','ビョウ'],['たいら','ひら']],
		question:['開平','公平','水平','太平','地平','平等','平安','平気','平家','平原','平行','平行','平身','平時','平日','平地','平定','平年','平板','平服','平方','平明','平面','平野','平和','和平'],
		kanji:['開平','公平','水平','太平','地平','平等','平安','平気','平家','平原','平行','平行','平身','平時','平日','平地','平定','平年','平板','平服','平方','平明','平面','平野','平和','和平'],
		answer:['かいへい','こうへい','すいへい','たいへい','ちへい','びょうどう','へいあん','へいき','へいけ','へいげん','へいこう','へいこう','へいしん','へいじ','へいじつ','へいち','へいてい','へいねん','へいばん','へいふく','へいほう','へいめい','へいめん','へいや','へいわ','わへい']
	},
	{
		pronunciation:[['ヘン'],['かえす','かえる']],
		question:['返金','返書','返事','返上','返送','返答','返品','返本','返礼','見返','見返'],
		kanji:['返金','返書','返事','返上','返送','返答','返品','返本','返礼','見返','見返'],
		answer:['へんきん','へんしょ','へんじ','へんじょう','へんそう','へんとう','へんぴん','へんぽん','へんれい','みかえ','みかえ']
	},
	{
		pronunciation:[['ベン'],['']],
		question:['勉学','勉強'],
		kanji:['勉学','勉強'],
		answer:['べんがく','べんきょう']
	},
	{
		pronunciation:[['ホウ'],['はなす','はなつ','はなれる','ほうる']],
		question:['開放','追放','手放','放火','放言','放校','放出','放心','放水','放送','放題','放談','放電','放流','見放'],
		kanji:['開放','追放','手放','放火','放言','放校','放出','放心','放水','放送','放題','放談','放電','放流','見放'],
		answer:['かいほう','ついほう','てばな','ほうか','ほうげん','ほうこう','ほうしゅつ','ほうしん','ほうすい','ほうそう','ほうだい','ほうだん','ほうでん','ほうりゅう','みはな']
	},
	{
		pronunciation:[['ミ'],['あじ','あじわう']],
		question:['味見','意味','気味','気味','三味','正味','地味','調味','風味','味方','弱味'],
		kanji:['味見','意味','気味','気味','三味','正味','地味','調味','風味','味方','弱味'],
		answer:['あじみ','いみ','きみ','ぎみ','しゃみ','しょうみ','じみ','ちょうみ','ふうみ','みかた','よわみ']
	},
	{
		pronunciation:[['メイ','ミョウ'],['いのち']],
		question:['一命','運命','使命','指命','宿命','身命','助命','人命','生命','知命','本命','命運','命題','命中','命日','命名','用命'],
		kanji:['一命','運命','使命','指命','宿命','身命','助命','人命','生命','知命','本命','命運','命題','命中','命日','命名','用命'],
		answer:['いちめい','うんめい','しめい','しめい','しゅくめい','しんめい','じょめい','じんめい','せいめい','ちめい','ほんめい','めいうん','めいだい','めいちゅう','めいにち','めいめい','ようめい']
	},
	{
		pronunciation:[['メン'],['おも','おもて','つら']],
		question:['一面','馬面','面白','面白','海面','界面','外面','画面','顔面','球面','局面','曲面','工面','紙面','正面','書面','字面','地面','水面','図面','赤面','前面','全面','外面','体面','対面','他面','多面','帳面','直面','当面','内面','波面','半面','反面','場面','表面','文面','平面','方面','水面','面会','面前','面相','面談','面子','面目','面目','矢面','両面','路面'],
		kanji:['一面','馬面','面白','面白','海面','界面','外面','画面','顔面','球面','局面','曲面','工面','紙面','正面','書面','字面','地面','水面','図面','赤面','前面','全面','外面','体面','対面','他面','多面','帳面','直面','当面','内面','波面','半面','反面','場面','表面','文面','平面','方面','水面','面会','面前','面相','面談','面子','面目','面目','矢面','両面','路面'],
		answer:['いちめん','うまづら','おもしろ','おもしろ','かいめん','かいめん','がいめん','がめん','がんめん','きゅうめん','きょくめん','きょくめん','くめん','しめん','しょうめん','しょめん','じづら','じめん','すいめん','ずめん','せきめん','ぜんめん','ぜんめん','そとづら','たいめん','たいめん','ためん','ためん','ちょうめん','ちょくめん','とうめん','ないめん','はめん','はんめん','はんめん','ばめん','ひょうめん','ぶんめん','へいめん','ほうめん','みなも','めんかい','めんぜん','めんそう','めんだん','めんつ','めんぼく','めんもく','やおもて','りょうめん','ろめん']
	},
	{
		pronunciation:[['モン'],['とう','とい','とん']],
		question:['学問','自問','反問','問題','問答'],
		kanji:['学問','自問','反問','問題','問答'],
		answer:['がくもん','じもん','はんもん','もんだい','もんどう']
	},
	{
		pronunciation:[['ヤク','エキ'],['']],
		question:['悪役','上役','顔役','公役','使役','主役','重役','助役','大役','代役','配役','服役','役員','役者','役所','役立','役人','役場','役目'],
		kanji:['悪役','上役','顔役','公役','使役','主役','重役','助役','大役','代役','配役','服役','役員','役者','役所','役立','役人','役場','役目'],
		answer:['あくやく','うわやく','かおやく','こうえき','しえき','しゅやく','じゅうやく','じょやく','たいやく','だいやく','はいやく','ふくえき','やくいん','やくしゃ','やくしょ','やくだ','やくにん','やくば','やくめ']
	},
	{
		pronunciation:[['ヤク'],['くすり']],
		question:['医薬','火薬','丸薬','薬指','生薬','投薬','農薬','服薬','目薬','薬学','薬草','薬品','薬物','薬用','薬局'],
		kanji:['医薬','火薬','丸薬','薬指','生薬','投薬','農薬','服薬','目薬','薬学','薬草','薬品','薬物','薬用','薬局'],
		answer:['いやく','かやく','がんやく','くすりゆび','しょうやく','とうやく','のうやく','ふくやく','めぐすり','やくがく','やくそう','やくひん','やくぶつ','やくよう','やっきょく']
	},
	{
		pronunciation:[['ユ','ユウ','ユイ'],['よし']],
		question:['事由','自由','由来','理由'],
		kanji:['事由','自由','由来','理由'],
		answer:['じゆう','じゆう','ゆらい','りゆう']
	},
	{
		pronunciation:[['ユ'],['あぶら']],
		question:['油絵','軽油','原油','重油','石油','油田'],
		kanji:['油絵','軽油','原油','重油','石油','油田'],
		answer:['あぶらえ','けいゆ','げんゆ','じゅうゆ','せきゆ','ゆでん']
	},
	{
		pronunciation:[['ユウ','ウ'],['ある']],
		question:['公有','国有','所有','万有','有意','有休','有形','有人','有数','有線','有名','有用','有理','有力'],
		kanji:['公有','国有','所有','万有','有意','有休','有形','有人','有数','有線','有名','有用','有理','有力'],
		answer:['こうゆう','こくゆう','しょゆう','ばんゆう','ゆうい','ゆうきゅう','ゆうけい','ゆうじん','ゆうすう','ゆうせん','ゆうめい','ゆうよう','ゆうり','ゆうりょく']
	},
	{
		pronunciation:[['ユウ','ユ'],['あそぶ']],
		question:['回遊','外遊','交遊','遊泳','遊学','遊休','遊女','遊星'],
		kanji:['回遊','外遊','交遊','遊泳','遊学','遊休','遊女','遊星'],
		answer:['かいゆう','がいゆう','こうゆう','ゆうえい','ゆうがく','ゆうきゅう','ゆうじょ','ゆうせい']
	},
	{
		pronunciation:[['ヨ'],['']],
		question:['予感','予期','予言','予行','予後','予算','予習','予想','予知','予定'],
		kanji:['予感','予期','予言','予行','予後','予算','予習','予想','予知','予定'],
		answer:['よかん','よき','よげん','よこう','よご','よさん','よしゅう','よそう','よち','よてい']
	},
	{
		pronunciation:[['ヨウ'],['ひつじ']],
		question:['山羊','羊毛'],
		kanji:['山羊','羊毛'],
		answer:['やぎ','ようもう']
	},
	{
		pronunciation:[['ヨウ'],['']],
		question:['遠洋','海洋','大洋','北洋','洋館','洋画','洋楽','洋銀','洋行','洋式','洋室','洋酒','洋書','洋食','洋上','洋品','洋風','洋服','洋間','洋物','和洋'],
		kanji:['遠洋','海洋','大洋','北洋','洋館','洋画','洋楽','洋銀','洋行','洋式','洋室','洋酒','洋書','洋食','洋上','洋品','洋風','洋服','洋間','洋物','和洋'],
		answer:['えんよう','かいよう','たいよう','ほくよう','ようかん','ようが','ようがく','ようぎん','ようこう','ようしき','ようしつ','ようしゅ','ようしょ','ようしょく','ようじょう','ようひん','ようふう','ようふく','ようま','ようもの','わよう']
	},
	{
		pronunciation:[['ヨウ'],['は']],
		question:['青葉','落葉','言葉','葉書','葉月','万葉','落葉'],
		kanji:['青葉','落葉','言葉','葉書','葉月','万葉','落葉'],
		answer:['あおば','おちば','ことば','はがき','はづき','まんよう','らくよう']
	},
	{
		pronunciation:[['ヨウ'],['']],
		question:['太陽','西陽','夕陽','陽画','陽気','陽光','陽子','陽春'],
		kanji:['太陽','西陽','夕陽','陽画','陽気','陽光','陽子','陽春'],
		answer:['たいよう','にしび','ゆうひ','ようが','ようき','ようこう','ようし','ようしゅん']
	},
	{
		pronunciation:[['ヨウ'],['さま']],
		question:['一様','王様','神様','先様','仕様','多様','父様','外様','同様','文様','様式','様子','様相','横様','両様'],
		kanji:['一様','王様','神様','先様','仕様','多様','父様','外様','同様','文様','様式','様子','様相','横様','両様'],
		answer:['いちよう','おうさま','かみさま','さきさま','しよう','たよう','とうさま','とざま','どうよう','もんよう','ようしき','ようす','ようそう','よこざま','りょうよう']
	},
	{
		pronunciation:[['ラク'],['おちる','おとす']],
		question:['落度','落葉','急落','下落','集落','村落','転落','当落','反落','部落','見落','落書','落後','落語','落手','落日','落石','落第','落着','落丁','落馬','落葉','落下'],
		kanji:['落度','落葉','急落','下落','集落','村落','転落','当落','反落','部落','見落','落書','落後','落語','落手','落日','落石','落第','落着','落丁','落馬','落葉','落下'],
		answer:['おちど','おちば','きゅうらく','げらく','しゅうらく','そんらく','てんらく','とうらく','はんらく','ぶらく','みおと','らくがき','らくご','らくご','らくしゅ','らくじつ','らくせき','らくだい','らくちゃく','らくちょう','らくば','らくよう','らっか']
	},
	{
		pronunciation:[['リュウ','ル'],['ながれる','ながす']],
		question:['一流','海流','下流','寒流','急流','気流','血流','交流','合流','流石','流石','三流','主流','上流','女流','時流','自流','水流','整流','対流','中流','直流','電流','二流','流行','風流','放流','本流','流会','流感','流血','流言','流行','流出','流水','流速','流体','流通','流動','流入','流氷','流用','流転'],
		kanji:['一流','海流','下流','寒流','急流','気流','血流','交流','合流','流石','流石','三流','主流','上流','女流','時流','自流','水流','整流','対流','中流','直流','電流','二流','流行','風流','放流','本流','流会','流感','流血','流言','流行','流出','流水','流速','流体','流通','流動','流入','流氷','流用','流転'],
		answer:['いちりゅう','かいりゅう','かりゅう','かんりゅう','きゅうりゅう','きりゅう','けつりゅう','こうりゅう','ごうりゅう','さすが','さすが','さんりゅう','しゅりゅう','じょうりゅう','じょりゅう','じりゅう','じりゅう','すいりゅう','せいりゅう','たいりゅう','ちゅうりゅう','ちょくりゅう','でんりゅう','にりゅう','はや','ふうりゅう','ほうりゅう','ほんりゅう','りゅうかい','りゅうかん','りゅうけつ','りゅうげん','りゅうこう','りゅうしゅつ','りゅうすい','りゅうそく','りゅうたい','りゅうつう','りゅうどう','りゅうにゅう','りゅうひょう','りゅうよう','るてん']
	},
	{
		pronunciation:[['リョ'],['たび']],
		question:['旅先','旅路','旅立','旅人','船旅','旅客','旅館','旅行'],
		kanji:['旅先','旅路','旅立','旅人','船旅','旅客','旅館','旅行'],
		answer:['たびさき','たびじ','たびだ','たびびと','ふなたび','りょかく','りょかん','りょこう']
	},
	{
		pronunciation:[['リョウ'],['']],
		question:['車両','両足','両院','両家','両県','両国','両市','両社','両者','両親','両日','両手','両道','両人','両年','両分','両方','両目','両面','両様','両用','両立'],
		kanji:['車両','両足','両院','両家','両県','両国','両市','両社','両者','両親','両日','両手','両道','両人','両年','両分','両方','両目','両面','両様','両用','両立'],
		answer:['しゃりょう','りょうあし','りょういん','りょうけ','りょうけん','りょうこく','りょうし','りょうしゃ','りょうしゃ','りょうしん','りょうじつ','りょうて','りょうどう','りょうにん','りょうねん','りょうぶん','りょうほう','りょうめ','りょうめん','りょうよう','りょうよう','りょうりつ']
	},
	{
		pronunciation:[['リョク','ロク'],['みどり']],
		question:['黄緑','新緑','緑色','緑地','緑茶','緑化','緑青'],
		kanji:['黄緑','新緑','緑色','緑地','緑茶','緑化','緑青'],
		answer:['きみどり','しんりょく','りょくしょく','りょくち','りょくちゃ','りょっか','ろくしょう']
	},
	{
		pronunciation:[['レイ','ライ'],['']],
		question:['祭礼','朝礼','返礼','礼金','礼服'],
		kanji:['祭礼','朝礼','返礼','礼金','礼服'],
		answer:['さいれい','ちょうれい','へんれい','れいきん','れいふく']
	},
	{
		pronunciation:[['レツ'],['']],
		question:['行列','後列','数列','整列','前列','直列','点列','同列','配列','列記','列強','列国','列車','列島'],
		kanji:['行列','後列','数列','整列','前列','直列','点列','同列','配列','列記','列強','列国','列車','列島'],
		answer:['ぎょうれつ','こうれつ','すうれつ','せいれつ','ぜんれつ','ちょくれつ','てんれつ','どうれつ','はいれつ','れっき','れっきょう','れっこく','れっしゃ','れっとう']
	},
	{
		pronunciation:[['レン'],['ねる']],
		question:['教練','練習'],
		kanji:['教練','練習'],
		answer:['きょうれん','れんしゅう']
	},
	{
		pronunciation:[['ロ'],['じ']],
		question:['家路','一路','遠路','回路','海路','活路','帰路','空路','小路','小路','進路','水路','線路','旅路','通路','道路','坂路','路銀','路地','路上','路線','路面'],
		kanji:['家路','一路','遠路','回路','海路','活路','帰路','空路','小路','小路','進路','水路','線路','旅路','通路','道路','坂路','路銀','路地','路上','路線','路面'],
		answer:['いえじ','いちろ','えんろ','かいろ','かいろ','かつろ','きろ','くうろ','こうじ','こみち','しんろ','すいろ','せんろ','たびじ','つうろ','どうろ','はんろ','ろぎん','ろじ','ろじょう','ろせん','ろめん']
	},
	{
		pronunciation:[['ワ','オ'],['やわらぐ','やわらげる','なごむ','なごやか']],
		question:['温和','漢和','親和','中和','調和','同和','日和','日和','平和','大和','和歌','和牛','和語','和合','和紙','和式','和室','和食','和声','和風','和服','和文','和平','和名','和洋'],
		kanji:['温和','漢和','親和','中和','調和','同和','日和','日和','平和','大和','和歌','和牛','和語','和合','和紙','和式','和室','和食','和声','和風','和服','和文','和平','和名','和洋'],
		answer:['おんわ','かんわ','しんわ','ちゅうわ','ちょうわ','どうわ','ひより','びより','へいわ','やまと','わか','わぎゅう','わご','わごう','わし','わしき','わしつ','わしょく','わせい','わふう','わふく','わぶん','わへい','わめい','わよう']
	}
];

const kanjiList = [
    ['一','右','雨','円','王','音','下','火','花','貝','学','気','九','休','玉','金','空','月','犬','見','五','口','校','左','三','山','子','四','糸','字','耳','七','車','手','十','出','女','小','上','森','人','水','正','生','青','夕','石','赤','千','川','先','早','草','足','村','大','男','竹','中','虫','町','天','田','土','二','日','入','年','白','八','百','文','木','本','名','目','立','力','林','六'],
    ['引','羽','雲','園','遠','何','科','夏','家','歌','画','回','会','海','絵','外','角','楽','活','間','丸','岩','顔','汽','記','帰','弓','牛','魚','京','強','教','近','兄','形','計','元','言','原','戸','古','午','後','語','工','公','広','交','光','考','行','高','黄','合','谷','国','黒','今','才','細','作','算','止','市','矢','姉','思','紙','寺','自','時','室','社','弱','首','秋','週','春','書','少','場','色','食','心','新','親','図','数','西','声','星','晴','切','雪','船','線','前','組','走','多','太','体','台','地','池','知','茶','昼','長','鳥','朝','直','通','弟','店','点','電','刀','冬','当','東','答','頭','同','道','読','内','南','肉','馬','売','買','麦','半','番','父','風','分','聞','米','歩','母','方','北','毎','妹','万','明','鳴','毛','門','夜','野','友','用','曜','来','里','理','話'],
    ['悪','安','暗','医','委','意','育','員','院','飲','運','泳','駅','央','横','屋','温','化','荷','界','開','階','寒','感','漢','館','岸','起','期','客','究','急','級','宮','球','去','橋','業','曲','局','銀','区','苦','具','君','係','軽','血','決','研','県','庫','湖','向','幸','港','号','根','祭','皿','仕','死','使','始','指','歯','詩','次','事','持','式','実','写','者','主','守','取','酒','受','州','拾','終','習','集','住','重','宿','所','暑','助','昭','消','商','章','勝','乗','植','申','身','神','真','深','進','世','整','昔','全','相','送','想','息','速','族','他','打','対','待','代','第','題','炭','短','談','着','注','柱','丁','帳','調','追','定','庭','笛','鉄','転','都','度','投','豆','島','湯','登','等','動','童','農','波','配','倍','箱','畑','発','反','坂','板','皮','悲','美','鼻','筆','氷','表','秒','病','品','負','部','服','福','物','平','返','勉','放','味','命','面','問','役','薬','由','油','有','遊','予','羊','洋','葉','陽','様','落','流','旅','両','緑','礼','列','練','路','和'],
    ['愛','案','以','衣','位','茨','印','英','栄','媛','塩','岡','億','加','果','貨','課','芽','賀','改','械','害','街','各','覚','潟','完','官','管','関','観','願','岐','希','季','旗','器','機','議','求','泣','給','挙','漁','共','協','鏡','競','極','熊','訓','軍','郡','群','径','景','芸','欠','結','建','健','験','固','功','好','香','候','康','佐','差','菜','最','埼','材','崎','昨','札','刷','察','参','産','散','残','氏','司','試','児','治','滋','辞','鹿','失','借','種','周','祝','順','初','松','笑','唱','焼','照','城','縄','臣','信','井','成','省','清','静','席','積','折','節','説','浅','戦','選','然','争','倉','巣','束','側','続','卒','孫','帯','隊','達','単','置','仲','沖','兆','低','底','的','典','伝','徒','努','灯','働','特','徳','栃','奈','梨','熱','念','敗','梅','博','阪','飯','飛','必','票','標','不','夫','付','府','阜','富','副','兵','別','辺','変','便','包','法','望','牧','末','満','未','民','無','約','勇','要','養','浴','利','陸','良','料','量','輪','類','令','冷','例','連','老','労','録'],
    ['圧','囲','移','因','永','営','衛','易','益','液','演','応','往','桜','可','仮','価','河','過','快','解','格','確','額','刊','幹','慣','眼','紀','基','寄','規','喜','技','義','逆','久','旧','救','居','許','境','均','禁','句','型','経','潔','件','険','検','限','現','減','故','個','護','効','厚','耕','航','鉱','構','興','講','告','混','査','再','災','妻','採','際','在','財','罪','殺','雑','酸','賛','士','支','史','志','枝','師','資','飼','示','似','識','質','舎','謝','授','修','述','術','準','序','招','証','象','賞','条','状','常','情','織','職','制','性','政','勢','精','製','税','責','績','接','設','絶','祖','素','総','造','像','増','則','測','属','率','損','貸','態','団','断','築','貯','張','停','提','程','適','統','堂','銅','導','得','毒','独','任','燃','能','破','犯','判','版','比','肥','非','費','備','評','貧','布','婦','武','復','複','仏','粉','編','弁','保','墓','報','豊','防','貿','暴','脈','務','夢','迷','綿','輸','余','容','略','留','領','歴'],
    ['胃','異','遺','域','宇','映','延','沿','恩','我','灰','拡','革','閣','割','株','干','巻','看','簡','危','机','揮','貴','疑','吸','供','胸','郷','勤','筋','系','敬','警','劇','激','穴','券','絹','権','憲','源','厳','己','呼','誤','后','孝','皇','紅','降','鋼','刻','穀','骨','困','砂','座','済','裁','策','冊','蚕','至','私','姿','視','詞','誌','磁','射','捨','尺','若','樹','収','宗','就','衆','従','縦','縮','熟','純','処','署','諸','除','承','将','傷','障','蒸','針','仁','垂','推','寸','盛','聖','誠','舌','宣','専','泉','洗','染','銭','善','奏','窓','創','装','層','操','蔵','臓','存','尊','退','宅','担','探','誕','段','暖','値','宙','忠','著','庁','頂','腸','潮','賃','痛','敵','展','討','党','糖','届','難','乳','認','納','脳','派','拝','背','肺','俳','班','晩','否','批','秘','俵','腹','奮','並','陛','閉','片','補','暮','宝','訪','亡','忘','棒','枚','幕','密','盟','模','訳','郵','優','預','幼','欲','翌','乱','卵','覧','裏','律','臨','朗','論']
];


window.onload = function () {

    if (window.name != "any") {
        location.reload();
        window.name = "any";
    } else {
        window.name = "";
    }

}

let kanjiGrade = 2;
let kanjiNumber = 0;
let passData = 0;
const quizLength = quiz.length;



//漢字の読みクイズのセットアップ
const setUpQuiz = (kanjiNumber, quiz) => {
	
	//指定学年に合わせて漢字ボタンを作成
	let kanjiCloneCounter = 0;
	while(kanjiCloneCounter < kanjiList[kanjiGrade].length-1){
		let kanjiClone = document.getElementsByClassName('kanjis');
		let cloneElement = kanjiClone[kanjiCloneCounter].cloneNode(true);
		kanjiClone[kanjiCloneCounter].after(cloneElement);
		kanjiCloneCounter++;
	}
	setKanji(kanjiGrade);
	
	//漢字の読みクイズをあるだけ作成
	let cloneCounter = 0;
		while(cloneCounter < quiz[kanjiNumber].question.length-1){
		let quizClone = document.getElementsByClassName('quiz_clone');
		let cloneElement = quizClone[cloneCounter].cloneNode(true);
		quizClone[cloneCounter].after(cloneElement);
		cloneCounter++;
	}

	const $question = document.getElementsByClassName('kanji-question');
	const $how_to_read = document.getElementsByClassName('how_to_read');
	
	//クイズ作成
	let inputCounter = 0;
	while(inputCounter < quiz[kanjiNumber].question.length){
		let inputToSplit = quiz[kanjiNumber].question[inputCounter].split(quiz[kanjiNumber].kanji[inputCounter]);
		$question[inputCounter].textContent = String(inputCounter+1) + '、 ' + inputToSplit[0] + ' [ ' + quiz[kanjiNumber].kanji[inputCounter] + ' ] ' + inputToSplit[1];
		$how_to_read[inputCounter].value = '';
		inputCounter++;
	}
	document.getElementById('correct_message').textContent = '';
	goToQuestion(kanjiGrade);
	hiddenRegisterBtn();
	setKanjiColor(kanjiGrade);
	changePassKanjiColor();
}
setUpQuiz(kanjiNumber, quiz);
document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];



//漢字の読みクイズの合否判定
function judge() {
	let score = 0;
	let quizLength = quiz[kanjiNumber].question.length;

	let answerToShow = document.getElementsByClassName('kanji-answer');

	for(let i = 0; i < quizLength; i++){
		let $answer = document.getElementsByClassName('how_to_read')[i].value;
		answerToShow[i].textContent = quiz[kanjiNumber].answer[i];
		if ($answer == quiz[kanjiNumber].answer[i]){
			score++;
		}
	}
	setTimeout(removeAnswer,3000);

	if (score == quizLength){
		document.getElementById('correct_message').textContent = '全問正解です！！（' + score + '点/' + quizLength + '点中）';
		$targetPassKanji = document.getElementById('kanji');
		passNumber = kanjiList[kanjiGrade].indexOf($targetPassKanji.textContent);
		passData = passNumber;

		$('#congratulations').css('visibility','visible');
		$('#registerButton').css('visibility','visible');
		openPopup(kanjiGrade, kanjiNumber);
	} else {
		document.getElementById('correct_message').textContent = '残念！もう一度やってみよう！！';
	}

}


//答えを消す
function removeAnswer(){
	let quizLength = quiz[kanjiNumber].question.length;
	let answerToShow = document.getElementsByClassName('kanji-answer');
	for(let i = 0; i < quizLength; i++){
		answerToShow[i].textContent = '';
	}
}


//各学年の漢字に色をつける
function setKanjiColor(kanjiGrade){
	let colorList = ['#ffdbdb','#ffdbed','#eddbff','#dbdbff','#dbedff','#ffeddb'];
	if(kanjiGrade == 0){
		changeColor(colorList[0]);
	}else if(kanjiGrade == 1){
		changeColor(colorList[1]);
	}else if(kanjiGrade == 2){
		changeColor(colorList[2]);
	}else if(kanjiGrade == 3){
		changeColor(colorList[3]);
	}else if(kanjiGrade == 4){
		changeColor(colorList[4]);
	}else if(kanjiGrade == 5){
		changeColor(colorList[5]);
	}
}

//色変え
function changeColor(color){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].style.backgroundColor = color;
	}
	setHover(color);
}

function setHover(color){
	let $mouseover = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $mouseover.length; i++){
		$mouseover[i].addEventListener('mouseover', function() {
			$mouseover[i].style.backgroundColor = 'white';
		});
		$mouseover[i].addEventListener('mouseleave', function() {
			$mouseover[i].style.backgroundColor = color;
		});
	}
}





//指定された学年の漢字をボタンに書き込む
function setKanji(kanjiGrade){
	const $kanjiList = document.getElementsByClassName('kanjis');
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].textContent = kanjiList[kanjiGrade][i];
	}
	//漢字ボタンのクリック機能(漢字大きく表示)をオンにする
	for(let i = 0; i < $kanjiList.length; i++){
		$kanjiList[i].addEventListener('click', showKanji, false);
	}

}





//前回のクイズ削除
function removeQuiz(){
	removeAnswer();
	let cloneRemoveCounter = quiz[kanjiNumber].question.length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('quiz_clone');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
}





//前回の学年の漢字削除
function removeKanji(){
	let cloneRemoveCounter = kanjiList[kanjiGrade].length-1;
		while(cloneRemoveCounter > 0 ){
			let quizCloneToRemove = document.getElementsByClassName('kanjis');
			quizCloneToRemove[cloneRemoveCounter].remove();
			cloneRemoveCounter--;
		}
	document.getElementsByClassName('kanjis')[0].textContent = kanjiList[kanjiGrade][0];
}




//漢字ボタンを押すと、その漢字を大きく表示
function showKanji(e){
	removeQuiz();
	removeKanji();

	$targetKanji = document.getElementById('kanji');
	$targetKanji.textContent = e.target.textContent;
	kanjiNumber = kanjiList[kanjiGrade].indexOf($targetKanji.textContent);

	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	document.getElementsByClassName('how_to_read')[0].value = '';
	
	setUpQuiz(kanjiNumber, quiz);
}




//学年変更
function changeGrade(grade){
	removeQuiz();
	removeKanji();

	kanjiGrade = grade;
	kanjiNumber = 0;

	if(grade == 1){
		quiz = quiz2;
		document.getElementById('grade').textContent = '小学校２年生の漢字';
	} else if(grade == 2){
		quiz = quiz3;
		document.getElementById('grade').textContent = '小学校３年生の漢字';
	} else if(grade == 3){
		quiz = quiz4;
		document.getElementById('grade').textContent = '小学校４年生の漢字';
	} else if(grade == 4){
		quiz = quiz5;
		document.getElementById('grade').textContent = '小学校５年生の漢字';
	} else if(grade == 5){
		quiz = quiz6;
		document.getElementById('grade').textContent = '小学校６年生の漢字';
	} else {
		quiz = quiz1;
		document.getElementById('grade').textContent = '小学校1年生の漢字';
	}
	
	setUpQuiz(kanjiNumber, quiz);
	document.getElementById('kanji').textContent = kanjiList[kanjiGrade][0];
	document.getElementById('on_yomi').textContent = '音読み： ' + quiz[kanjiNumber].pronunciation[0];
	document.getElementById('kun_yomi').textContent = '訓読み： ' + quiz[kanjiNumber].pronunciation[1];
	location.href = '#';
}





function hiddenRegisterBtn() {
    $('#congratulations').css('visibility','hidden');
	$('#registerButton').css('visibility','hidden');
}




//答え合わせボタンでjudge()発動
document.addEventListener('DOMContentLoaded', () => {
    const answerButton = document.getElementById("answerButton");
    answerButton.addEventListener("click", () => { judge() });
});

//学年変更ボタンでchangeGrade()発動
document.addEventListener('DOMContentLoaded', () => {
	const changeGradeButton = document.getElementsByClassName("changeGradeButton");
	for(let i = 0; i < changeGradeButton.length; i++){
    	changeGradeButton[i].addEventListener("click", () => { changeGrade(i) });
	}
});


//railsに正解した漢字のデータをpost
function postData(){

	$.ajax({
		url: '/kanji_quiz/update',
		type: 'GET',
		dataType: 'text',
		async: true,
		data: {
			grade: String(kanjiGrade),
			passData: String(passData),
		},
	});
}


//図鑑に登録ボタンでpostData()発動
let login_checker = document.getElementById('login_checker');
if(login_checker.textContent == 'true'){
	document.addEventListener('DOMContentLoaded', () => {
		const registerButton = document.getElementById("registerButton");
		registerButton.addEventListener("click", () => { postData() });
	});
}



//合格時のアニメーション
function openPopup(grade, num){
	let img = document.getElementById('image_file');
	let imgName = '/image' + grade + '_' + num + '.jpg';
	if(num > 8){
		imgName = '/dummy.jpg';
	}
	if(grade > 0){
		imgName = '/dummy.jpg';
	}
	img.src = imgName;
	document.querySelector('#image_file').animate(
		[
			{ transform: 'scale(0)' },
			{ transform: 'scale(2)' },
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(5px, 0)'},
			{ transform: 'translate(-5px, -0)'},
			{ transform: 'translate(0, 0)'},
			{ transform: 'translate(0, 0)'}
		],
		{
		  duration: 3000,
		  iterations: 1,
		  direction: 'normal'
		}
	);
	let popup = document.getElementById('js-popup');
	popup.classList.add('is-show');
	let passMessage = document.getElementById('pass_message');
	passMessage.style.visibility = 'visible';
}

function closePopUp() {
	let popup = document.getElementById('js-popup');
	let blackBg = document.getElementById('js-black-bg');
	let closeBtn = document.getElementById('js-close-btn');
	let img = document.getElementById('image_file');
	blackBg.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
	closeBtn.addEventListener('click', function() {
		popup.classList.remove('is-show');
		let passMessage = document.getElementById('pass_message');
		passMessage.style.visibility = 'hidden';
		img.src = '/white.jpg';
	});
}
closePopUp();


let pageTop = document.getElementById('page_top');
pageTop.addEventListener('click', function() {
	$('html, body').animate({scrollTop:0},400);
});

function goToQuestion(kanjiGrade){
	let $goToQues = document.getElementsByClassName('kanjis');
	let $target = document.getElementById('hidden_block');
	for(let i = 0; i < kanjiList[kanjiGrade].length; i++){
		$goToQues[i].addEventListener('click', function() {
			$target.scrollIntoView({
				behavior: "smooth",
				block: "start",
				inline: "nearest"
			  });
		});
	}
}


//合格漢字の色を変える
function changePassKanjiColor(){
	//forで正解配列作る処理
	let login_checker = document.getElementById('login_checker');
	if(login_checker.textContent == 'true'){
		let $dummy = document.getElementsByClassName('dummy_data');
		let correctList = [];
		for(let i = 1; i < $dummy.length; i++){
			let splitData = $dummy[i].textContent.trim();
			splitData = splitData.slice(0,-1);
			let splitList = splitData.split(',');
			correctList.push(splitList);
		}
		

		let newColorList = ['#ff7f7f', '#ff7fbf', '#bf7fff', '#7f7fff', '#7fbfff', '#ffbf7f'];
		const $kanjiList = document.getElementsByClassName('kanjis');
		for(let i = 0; i < correctList[kanjiGrade].length; i++){
			let num = correctList[kanjiGrade][i];
			if(num != ''){
				$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];
				$kanjiList[num].addEventListener('mouseleave', function() {
					$kanjiList[num].style.backgroundColor = newColorList[kanjiGrade];	
				});
			}
		}
	}
	
}